; ModuleID = '<stdin>'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct._DEVICE_OBJECT = type { i16, i16, i64, %struct._DRIVER_OBJECT*, %struct._DEVICE_OBJECT*, %struct._DEVICE_OBJECT*, %struct._IRP*, %struct._IO_TIMER*, i64, i64, %struct._VPB*, i8*, i64, i8, %union.__anonunion_Queue_43, i64, %struct._KDEVICE_QUEUE, %struct._KDPC, i64, i8*, %struct._KEVENT, i16, i16, %struct._DEVOBJ_EXTENSION*, i8* }
%struct._DRIVER_OBJECT = type { i16, i16, %struct._DEVICE_OBJECT*, i64, i8*, i64, i8*, %struct._DRIVER_EXTENSION*, %struct._UNICODE_STRING, %struct._UNICODE_STRING*, %struct._FAST_IO_DISPATCH*, i64 (%struct._DRIVER_OBJECT*, %struct._UNICODE_STRING*)*, void (%struct._DEVICE_OBJECT*, %struct._IRP*)*, void (%struct._DRIVER_OBJECT*)*, [28 x i64 (%struct._DEVICE_OBJECT*, %struct._IRP*)*] }
%struct._DRIVER_EXTENSION = type { %struct._DRIVER_OBJECT*, i64 (%struct._DRIVER_OBJECT*, %struct._DEVICE_OBJECT*)*, i64, %struct._UNICODE_STRING }
%struct._UNICODE_STRING = type { i16, i16, i16* }

!189 = !DIEnumerator(name: "PrinterPeripheral", value: 30)
!190 = !DIEnumerator(name: "PointerPeripheral", value: 31)
!191 = !DIEnumerator(name: "KeyboardPeripheral", value: 32)
!192 = !DIEnumerator(name: "TerminalPeripheral", value: 33)
!193 = !DIEnumerator(name: "OtherPeripheral", value: 34)
!194 = !DIEnumerator(name: "LinePeripheral", value: 35)
!195 = !DIEnumerator(name: "NetworkPeripheral", value: 36)
!196 = !DIEnumerator(name: "SystemMemory", value: 37)
!197 = !DIEnumerator(name: "DockingInformation", value: 38)
!198 = !DIEnumerator(name: "RealModeIrqRoutingTable", value: 39)
!199 = !DIEnumerator(name: "MaximumType", value: 40)
!200 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_EVENT_TYPE", file: !1, line: 73, size: 32, align: 32, elements: !201)
!201 = !{!202, !203}
!202 = !DIEnumerator(name: "NotificationEvent", value: 0)
!203 = !DIEnumerator(name: "SynchronizationEvent", value: 1)
!204 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_KWAIT_REASON", file: !1, line: 603, size: 32, align: 32, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233}
!206 = !DIEnumerator(name: "Executive", value: 0)
!207 = !DIEnumerator(name: "FreePage", value: 1)
!208 = !DIEnumerator(name: "PageIn", value: 2)
!209 = !DIEnumerator(name: "PoolAllocation", value: 3)
!210 = !DIEnumerator(name: "DelayExecution", value: 4)
!211 = !DIEnumerator(name: "Suspended", value: 5)
!212 = !DIEnumerator(name: "UserRequest", value: 6)
!213 = !DIEnumerator(name: "WrExecutive", value: 7)
!214 = !DIEnumerator(name: "WrFreePage", value: 8)
!215 = !DIEnumerator(name: "WrPageIn", value: 9)
!216 = !DIEnumerator(name: "WrPoolAllocation", value: 10)
!217 = !DIEnumerator(name: "WrDelayExecution", value: 11)
!218 = !DIEnumerator(name: "WrSuspended", value: 12)
!219 = !DIEnumerator(name: "WrUserRequest", value: 13)
!220 = !DIEnumerator(name: "WrEventPair", value: 14)
!221 = !DIEnumerator(name: "WrQueue", value: 15)
!222 = !DIEnumerator(name: "WrLpcReceive", value: 16)
!223 = !DIEnumerator(name: "WrLpcReply", value: 17)
!224 = !DIEnumerator(name: "WrVirtualMemory", value: 18)
!225 = !DIEnumerator(name: "WrPageOut", value: 19)
!226 = !DIEnumerator(name: "WrRendezvous", value: 20)
!227 = !DIEnumerator(name: "Spare2", value: 21)
!228 = !DIEnumerator(name: "Spare3", value: 22)
!229 = !DIEnumerator(name: "Spare4", value: 23)
!230 = !DIEnumerator(name: "Spare5", value: 24)
!231 = !DIEnumerator(name: "Spare6", value: 25)
!232 = !DIEnumerator(name: "WrKernel", value: 26)
!233 = !DIEnumerator(name: "MaximumWaitReason", value: 27)
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_MEMORY_CACHING_TYPE", file: !1, line: 677, size: 32, align: 32, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241, !242}
!236 = !DIEnumerator(name: "MmNonCached", value: 0)
!237 = !DIEnumerator(name: "MmCached", value: 1)
!238 = !DIEnumerator(name: "MmWriteCombined", value: 2)
!239 = !DIEnumerator(name: "MmHardwareCoherentCached", value: 3)
!240 = !DIEnumerator(name: "MmNonCachedUnordered", value: 4)
!241 = !DIEnumerator(name: "MmUSWCCached", value: 5)
!242 = !DIEnumerator(name: "MmMaximumCacheType", value: 6)
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_MM_PAGE_PRIORITY", file: !1, line: 742, size: 32, align: 32, elements: !244)
!244 = !{!245, !246, !247}
!245 = !DIEnumerator(name: "LowPagePriority", value: 0)
!246 = !DIEnumerator(name: "NormalPagePriority", value: 16)
!247 = !DIEnumerator(name: "HighPagePriority", value: 32)
!248 = !{!249, !250, !251, !255, !256, !257, !1152, !264, !1153, !1190, !1192, !1193, !1198, !1266, !1267, !1287, !1147, !1288, !1437, !1532, !1533, !2613, !2659, !1716}
!249 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "WCHAR", file: !1, line: 20, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !1, line: 12, baseType: !254)
!254 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!255 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!256 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DICompositeType(tag: DW_TAG_union_type, name: "_CDB", file: !1, line: 2158, size: 256, align: 64, elements: !259)
!259 = !{!260, !276, !278, !288, !290, !300, !302, !313, !315, !325, !327, !344, !346, !362, !364, !376, !378, !396, !398, !410, !412, !424, !426, !438, !440, !450, !452, !466, !468, !502, !504, !518, !520, !531, !533, !549, !551, !570, !572, !597, !599, !615, !617, !630, !632, !645, !647, !660, !662, !673, !675, !686, !688, !702, !704, !719, !721, !734, !736, !744, !746, !755, !757, !767, !769, !781, !783, !794, !796, !807, !809, !819, !821, !830, !832, !842, !844, !865, !867, !876, !878, !891, !893, !902, !904, !917, !919, !931, !933, !946, !948, !962, !964, !977, !979, !994, !996, !1009, !1011, !1025, !1027, !1040, !1042, !1054, !1056, !1068, !1070, !1083, !1085, !1096, !1098, !1110, !1112, !1122, !1124, !1133, !1135, !1143, !1145, !1148}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "CDB6GENERIC", scope: !258, file: !1, line: 2159, baseType: !261, size: 48, align: 8)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CDB6GENERIC", file: !1, line: 1472, size: 48, align: 8, elements: !262)
!262 = !{!263, !265, !266, !267, !268, !272, !273, !274, !275}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !261, file: !1, line: 1473, baseType: !264, size: 8, align: 8)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "UCHAR", file: !1, line: 25, baseType: !255)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Immediate", scope: !261, file: !1, line: 1474, baseType: !264, size: 1, align: 8, offset: 8)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "CommandUniqueBits", scope: !261, file: !1, line: 1475, baseType: !264, size: 4, align: 8, offset: 9)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !261, file: !1, line: 1476, baseType: !264, size: 3, align: 8, offset: 13)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "CommandUniqueBytes", scope: !261, file: !1, line: 1477, baseType: !269, size: 24, align: 8, offset: 16)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 24, align: 8, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 3)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !261, file: !1, line: 1478, baseType: !264, size: 1, align: 8, offset: 40)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Flag", scope: !261, file: !1, line: 1479, baseType: !264, size: 1, align: 8, offset: 41)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !261, file: !1, line: 1480, baseType: !264, size: 4, align: 8, offset: 42)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "VendorUnique", scope: !261, file: !1, line: 1481, baseType: !264, size: 2, align: 8, offset: 46)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "PCDB6GENERIC", scope: !258, file: !1, line: 2160, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "CDB6READWRITE", scope: !258, file: !1, line: 2161, baseType: !279, size: 48, align: 8)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CDB6READWRITE", file: !1, line: 1483, size: 48, align: 8, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286, !287}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !279, file: !1, line: 1484, baseType: !264, size: 8, align: 8)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlockMsb1", scope: !279, file: !1, line: 1485, baseType: !264, size: 5, align: 8, offset: 8)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !279, file: !1, line: 1486, baseType: !264, size: 3, align: 8, offset: 13)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlockMsb0", scope: !279, file: !1, line: 1487, baseType: !264, size: 8, align: 8, offset: 16)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlockLsb", scope: !279, file: !1, line: 1488, baseType: !264, size: 8, align: 8, offset: 24)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "TransferBlocks", scope: !279, file: !1, line: 1489, baseType: !264, size: 8, align: 8, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !279, file: !1, line: 1490, baseType: !264, size: 8, align: 8, offset: 40)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "PCDB6READWRITE", scope: !258, file: !1, line: 2162, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "CDB6INQUIRY", scope: !258, file: !1, line: 2163, baseType: !291, size: 48, align: 8)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CDB6INQUIRY", file: !1, line: 1492, size: 48, align: 8, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !298, !299}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !291, file: !1, line: 1493, baseType: !264, size: 8, align: 8)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !291, file: !1, line: 1494, baseType: !264, size: 5, align: 8, offset: 8)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !291, file: !1, line: 1495, baseType: !264, size: 3, align: 8, offset: 13)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "PageCode", scope: !291, file: !1, line: 1496, baseType: !264, size: 8, align: 8, offset: 16)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "IReserved", scope: !291, file: !1, line: 1497, baseType: !264, size: 8, align: 8, offset: 24)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationLength", scope: !291, file: !1, line: 1498, baseType: !264, size: 8, align: 8, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !291, file: !1, line: 1499, baseType: !264, size: 8, align: 8, offset: 40)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "PCDB6INQUIRY", scope: !258, file: !1, line: 2164, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "CDB6VERIFY", scope: !258, file: !1, line: 2165, baseType: !303, size: 48, align: 8)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CDB6VERIFY", file: !1, line: 1501, size: 48, align: 8, elements: !304)
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !303, file: !1, line: 1502, baseType: !264, size: 8, align: 8)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Fixed", scope: !303, file: !1, line: 1503, baseType: !264, size: 1, align: 8, offset: 8)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ByteCompare", scope: !303, file: !1, line: 1504, baseType: !264, size: 1, align: 8, offset: 9)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Immediate", scope: !303, file: !1, line: 1505, baseType: !264, size: 1, align: 8, offset: 10)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !303, file: !1, line: 1506, baseType: !264, size: 2, align: 8, offset: 11)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !303, file: !1, line: 1507, baseType: !264, size: 3, align: 8, offset: 13)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "VerificationLength", scope: !303, file: !1, line: 1508, baseType: !269, size: 24, align: 8, offset: 16)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !303, file: !1, line: 1509, baseType: !264, size: 8, align: 8, offset: 40)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "PCDB6VERIFY", scope: !258, file: !1, line: 2166, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "CDB6FORMAT", scope: !258, file: !1, line: 2167, baseType: !316, size: 48, align: 8)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CDB6FORMAT", file: !1, line: 1511, size: 48, align: 8, elements: !317)
!317 = !{!318, !319, !320, !321, !322, !323, !324}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !316, file: !1, line: 1512, baseType: !264, size: 8, align: 8)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "FormatControl", scope: !316, file: !1, line: 1513, baseType: !264, size: 5, align: 8, offset: 8)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !316, file: !1, line: 1514, baseType: !264, size: 3, align: 8, offset: 13)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "FReserved1", scope: !316, file: !1, line: 1515, baseType: !264, size: 8, align: 8, offset: 16)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "InterleaveMsb", scope: !316, file: !1, line: 1516, baseType: !264, size: 8, align: 8, offset: 24)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "InterleaveLsb", scope: !316, file: !1, line: 1517, baseType: !264, size: 8, align: 8, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "FReserved2", scope: !316, file: !1, line: 1518, baseType: !264, size: 8, align: 8, offset: 40)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "PCDB6FORMAT", scope: !258, file: !1, line: 2168, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "CDB10", scope: !258, file: !1, line: 2169, baseType: !328, size: 80, align: 8)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CDB10", file: !1, line: 1520, size: 80, align: 8, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !328, file: !1, line: 1521, baseType: !264, size: 8, align: 8)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "RelativeAddress", scope: !328, file: !1, line: 1522, baseType: !264, size: 1, align: 8, offset: 8)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !328, file: !1, line: 1523, baseType: !264, size: 2, align: 8, offset: 9)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ForceUnitAccess", scope: !328, file: !1, line: 1524, baseType: !264, size: 1, align: 8, offset: 11)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "DisablePageOut", scope: !328, file: !1, line: 1525, baseType: !264, size: 1, align: 8, offset: 12)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !328, file: !1, line: 1526, baseType: !264, size: 3, align: 8, offset: 13)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlockByte0", scope: !328, file: !1, line: 1527, baseType: !264, size: 8, align: 8, offset: 16)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlockByte1", scope: !328, file: !1, line: 1528, baseType: !264, size: 8, align: 8, offset: 24)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlockByte2", scope: !328, file: !1, line: 1529, baseType: !264, size: 8, align: 8, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlockByte3", scope: !328, file: !1, line: 1530, baseType: !264, size: 8, align: 8, offset: 40)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !328, file: !1, line: 1531, baseType: !264, size: 8, align: 8, offset: 48)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "TransferBlocksMsb", scope: !328, file: !1, line: 1532, baseType: !264, size: 8, align: 8, offset: 56)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "TransferBlocksLsb", scope: !328, file: !1, line: 1533, baseType: !264, size: 8, align: 8, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !328, file: !1, line: 1534, baseType: !264, size: 8, align: 8, offset: 72)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "PCDB10", scope: !258, file: !1, line: 2170, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "CDB12", scope: !258, file: !1, line: 2171, baseType: !347, size: 96, align: 8)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CDB12", file: !1, line: 1536, size: 96, align: 8, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !355, !359, !360, !361}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !347, file: !1, line: 1537, baseType: !264, size: 8, align: 8)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "RelativeAddress", scope: !347, file: !1, line: 1538, baseType: !264, size: 1, align: 8, offset: 8)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !347, file: !1, line: 1539, baseType: !264, size: 2, align: 8, offset: 9)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ForceUnitAccess", scope: !347, file: !1, line: 1540, baseType: !264, size: 1, align: 8, offset: 11)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "DisablePageOut", scope: !347, file: !1, line: 1541, baseType: !264, size: 1, align: 8, offset: 12)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !347, file: !1, line: 1542, baseType: !264, size: 3, align: 8, offset: 13)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlock", scope: !347, file: !1, line: 1543, baseType: !356, size: 32, align: 8, offset: 16)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 32, align: 8, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 4)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "TransferLength", scope: !347, file: !1, line: 1544, baseType: !356, size: 32, align: 8, offset: 48)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !347, file: !1, line: 1545, baseType: !264, size: 8, align: 8, offset: 80)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !347, file: !1, line: 1546, baseType: !264, size: 8, align: 8, offset: 88)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "PCDB12", scope: !258, file: !1, line: 2172, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "PAUSE_RESUME", scope: !258, file: !1, line: 2173, baseType: !365, size: 80, align: 8)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PAUSE_RESUME", file: !1, line: 1548, size: 80, align: 8, elements: !366)
!366 = !{!367, !368, !369, !370, !374, !375}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !365, file: !1, line: 1549, baseType: !264, size: 8, align: 8)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !365, file: !1, line: 1550, baseType: !264, size: 5, align: 8, offset: 8)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !365, file: !1, line: 1551, baseType: !264, size: 3, align: 8, offset: 13)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !365, file: !1, line: 1552, baseType: !371, size: 48, align: 8, offset: 16)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 48, align: 8, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 6)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Action", scope: !365, file: !1, line: 1553, baseType: !264, size: 8, align: 8, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !365, file: !1, line: 1554, baseType: !264, size: 8, align: 8, offset: 72)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "PPAUSE_RESUME", scope: !258, file: !1, line: 2174, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "READ_TOC", scope: !258, file: !1, line: 2175, baseType: !379, size: 80, align: 8)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "_READ_TOC", file: !1, line: 1556, size: 80, align: 8, elements: !380)
!380 = !{!381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !394, !395}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !379, file: !1, line: 1557, baseType: !264, size: 8, align: 8)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved0", scope: !379, file: !1, line: 1558, baseType: !264, size: 1, align: 8, offset: 8)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Msf", scope: !379, file: !1, line: 1559, baseType: !264, size: 1, align: 8, offset: 9)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !379, file: !1, line: 1560, baseType: !264, size: 3, align: 8, offset: 10)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !379, file: !1, line: 1561, baseType: !264, size: 3, align: 8, offset: 13)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Format2", scope: !379, file: !1, line: 1562, baseType: !264, size: 4, align: 8, offset: 16)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !379, file: !1, line: 1563, baseType: !264, size: 4, align: 8, offset: 20)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !379, file: !1, line: 1564, baseType: !269, size: 24, align: 8, offset: 24)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "StartingTrack", scope: !379, file: !1, line: 1565, baseType: !264, size: 8, align: 8, offset: 48)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationLength", scope: !379, file: !1, line: 1566, baseType: !391, size: 16, align: 8, offset: 56)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 16, align: 8, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 2)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !379, file: !1, line: 1567, baseType: !264, size: 6, align: 8, offset: 72)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Format", scope: !379, file: !1, line: 1568, baseType: !264, size: 2, align: 8, offset: 78)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "PREAD_TOC", scope: !258, file: !1, line: 2176, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "READ_DISK_INFORMATION", scope: !258, file: !1, line: 2177, baseType: !399, size: 80, align: 8)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "_READ_DISK_INFORMATION", file: !1, line: 1570, size: 80, align: 8, elements: !400)
!400 = !{!401, !402, !403, !404, !408, !409}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !399, file: !1, line: 1571, baseType: !264, size: 8, align: 8)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !399, file: !1, line: 1572, baseType: !264, size: 5, align: 8, offset: 8)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Lun", scope: !399, file: !1, line: 1573, baseType: !264, size: 3, align: 8, offset: 13)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !399, file: !1, line: 1574, baseType: !405, size: 40, align: 8, offset: 16)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 40, align: 8, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 5)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationLength", scope: !399, file: !1, line: 1575, baseType: !391, size: 16, align: 8, offset: 56)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !399, file: !1, line: 1576, baseType: !264, size: 8, align: 8, offset: 72)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "PREAD_DISK_INFORMATION", scope: !258, file: !1, line: 2178, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "READ_TRACK_INFORMATION", scope: !258, file: !1, line: 2179, baseType: !413, size: 80, align: 8)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "_READ_TRACK_INFORMATION", file: !1, line: 1578, size: 80, align: 8, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420, !421, !422, !423}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !413, file: !1, line: 1579, baseType: !264, size: 8, align: 8)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Track", scope: !413, file: !1, line: 1580, baseType: !264, size: 1, align: 8, offset: 8)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !413, file: !1, line: 1581, baseType: !264, size: 3, align: 8, offset: 9)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !413, file: !1, line: 1582, baseType: !264, size: 1, align: 8, offset: 12)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Lun", scope: !413, file: !1, line: 1583, baseType: !264, size: 3, align: 8, offset: 13)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "BlockAddress", scope: !413, file: !1, line: 1584, baseType: !356, size: 32, align: 8, offset: 16)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !413, file: !1, line: 1585, baseType: !264, size: 8, align: 8, offset: 48)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationLength", scope: !413, file: !1, line: 1586, baseType: !391, size: 16, align: 8, offset: 56)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !413, file: !1, line: 1587, baseType: !264, size: 8, align: 8, offset: 72)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "PREAD_TRACK_INFORMATION", scope: !258, file: !1, line: 2180, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "READ_HEADER", scope: !258, file: !1, line: 2181, baseType: !427, size: 80, align: 8)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "_READ_HEADER", file: !1, line: 1589, size: 80, align: 8, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !427, file: !1, line: 1590, baseType: !264, size: 8, align: 8)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !427, file: !1, line: 1591, baseType: !264, size: 1, align: 8, offset: 8)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Msf", scope: !427, file: !1, line: 1592, baseType: !264, size: 1, align: 8, offset: 9)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !427, file: !1, line: 1593, baseType: !264, size: 3, align: 8, offset: 10)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Lun", scope: !427, file: !1, line: 1594, baseType: !264, size: 3, align: 8, offset: 13)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlockAddress", scope: !427, file: !1, line: 1595, baseType: !356, size: 32, align: 8, offset: 16)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !427, file: !1, line: 1596, baseType: !264, size: 8, align: 8, offset: 48)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationLength", scope: !427, file: !1, line: 1597, baseType: !391, size: 16, align: 8, offset: 56)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !427, file: !1, line: 1598, baseType: !264, size: 8, align: 8, offset: 72)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "PREAD_HEADER", scope: !258, file: !1, line: 2182, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "PLAY_AUDIO", scope: !258, file: !1, line: 2183, baseType: !441, size: 80, align: 8)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PLAY_AUDIO", file: !1, line: 1600, size: 80, align: 8, elements: !442)
!442 = !{!443, !444, !445, !446, !447, !448, !449}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !441, file: !1, line: 1601, baseType: !264, size: 8, align: 8)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !441, file: !1, line: 1602, baseType: !264, size: 5, align: 8, offset: 8)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !441, file: !1, line: 1603, baseType: !264, size: 3, align: 8, offset: 13)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "StartingBlockAddress", scope: !441, file: !1, line: 1604, baseType: !356, size: 32, align: 8, offset: 16)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !441, file: !1, line: 1605, baseType: !264, size: 8, align: 8, offset: 48)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "PlayLength", scope: !441, file: !1, line: 1606, baseType: !391, size: 16, align: 8, offset: 56)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !441, file: !1, line: 1607, baseType: !264, size: 8, align: 8, offset: 72)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "PPLAY_AUDIO", scope: !258, file: !1, line: 2184, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "PLAY_AUDIO_MSF", scope: !258, file: !1, line: 2185, baseType: !453, size: 80, align: 8)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PLAY_AUDIO_MSF", file: !1, line: 1609, size: 80, align: 8, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !453, file: !1, line: 1610, baseType: !264, size: 8, align: 8)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !453, file: !1, line: 1611, baseType: !264, size: 5, align: 8, offset: 8)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !453, file: !1, line: 1612, baseType: !264, size: 3, align: 8, offset: 13)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !453, file: !1, line: 1613, baseType: !264, size: 8, align: 8, offset: 16)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "StartingM", scope: !453, file: !1, line: 1614, baseType: !264, size: 8, align: 8, offset: 24)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "StartingS", scope: !453, file: !1, line: 1615, baseType: !264, size: 8, align: 8, offset: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "StartingF", scope: !453, file: !1, line: 1616, baseType: !264, size: 8, align: 8, offset: 40)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "EndingM", scope: !453, file: !1, line: 1617, baseType: !264, size: 8, align: 8, offset: 48)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "EndingS", scope: !453, file: !1, line: 1618, baseType: !264, size: 8, align: 8, offset: 56)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "EndingF", scope: !453, file: !1, line: 1619, baseType: !264, size: 8, align: 8, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !453, file: !1, line: 1620, baseType: !264, size: 8, align: 8, offset: 72)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "PPLAY_AUDIO_MSF", scope: !258, file: !1, line: 2186, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "PLAY_CD", scope: !258, file: !1, line: 2187, baseType: !469, size: 96, align: 8)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PLAY_CD", file: !1, line: 1640, size: 96, align: 8, elements: !470)
!470 = !{!471, !472, !473, !474, !475, !476, !495, !496, !497, !498, !499, !500, !501}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !469, file: !1, line: 1641, baseType: !264, size: 8, align: 8)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !469, file: !1, line: 1642, baseType: !264, size: 1, align: 8, offset: 8)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "CMSF", scope: !469, file: !1, line: 1643, baseType: !264, size: 1, align: 8, offset: 9)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedSectorType", scope: !469, file: !1, line: 1644, baseType: !264, size: 3, align: 8, offset: 10)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Lun", scope: !469, file: !1, line: 1645, baseType: !264, size: 3, align: 8, offset: 13)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField22", scope: !469, file: !1, line: 1646, baseType: !477, size: 64, align: 8, offset: 16)
!477 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_117", file: !1, line: 1636, size: 64, align: 8, elements: !478)
!478 = !{!479, !484}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "LBA", scope: !477, file: !1, line: 1637, baseType: !480, size: 64, align: 8)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LBA", file: !1, line: 1622, size: 64, align: 8, elements: !481)
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "StartingBlockAddress", scope: !480, file: !1, line: 1623, baseType: !356, size: 32, align: 8)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "PlayLength", scope: !480, file: !1, line: 1624, baseType: !356, size: 32, align: 8, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "MSF", scope: !477, file: !1, line: 1638, baseType: !485, size: 64, align: 8)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MSF", file: !1, line: 1626, size: 64, align: 8, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !492, !493, !494}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !485, file: !1, line: 1627, baseType: !264, size: 8, align: 8)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "StartingM", scope: !485, file: !1, line: 1628, baseType: !264, size: 8, align: 8, offset: 8)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "StartingS", scope: !485, file: !1, line: 1629, baseType: !264, size: 8, align: 8, offset: 16)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "StartingF", scope: !485, file: !1, line: 1630, baseType: !264, size: 8, align: 8, offset: 24)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "EndingM", scope: !485, file: !1, line: 1631, baseType: !264, size: 8, align: 8, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "EndingS", scope: !485, file: !1, line: 1632, baseType: !264, size: 8, align: 8, offset: 40)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "EndingF", scope: !485, file: !1, line: 1633, baseType: !264, size: 8, align: 8, offset: 48)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !485, file: !1, line: 1634, baseType: !264, size: 8, align: 8, offset: 56)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Audio", scope: !469, file: !1, line: 1647, baseType: !264, size: 1, align: 8, offset: 80)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Composite", scope: !469, file: !1, line: 1648, baseType: !264, size: 1, align: 8, offset: 81)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Port1", scope: !469, file: !1, line: 1649, baseType: !264, size: 1, align: 8, offset: 82)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Port2", scope: !469, file: !1, line: 1650, baseType: !264, size: 1, align: 8, offset: 83)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !469, file: !1, line: 1651, baseType: !264, size: 3, align: 8, offset: 84)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Speed", scope: !469, file: !1, line: 1652, baseType: !264, size: 1, align: 8, offset: 87)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !469, file: !1, line: 1653, baseType: !264, size: 8, align: 8, offset: 88)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "PPLAY_CD", scope: !258, file: !1, line: 2188, baseType: !503, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "SCAN_CD", scope: !258, file: !1, line: 2189, baseType: !505, size: 96, align: 8)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SCAN_CD", file: !1, line: 1655, size: 96, align: 8, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !505, file: !1, line: 1656, baseType: !264, size: 8, align: 8)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "RelativeAddress", scope: !505, file: !1, line: 1657, baseType: !264, size: 1, align: 8, offset: 8)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !505, file: !1, line: 1658, baseType: !264, size: 3, align: 8, offset: 9)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Direct", scope: !505, file: !1, line: 1659, baseType: !264, size: 1, align: 8, offset: 12)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Lun", scope: !505, file: !1, line: 1660, baseType: !264, size: 3, align: 8, offset: 13)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "StartingAddress", scope: !505, file: !1, line: 1661, baseType: !356, size: 32, align: 8, offset: 16)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !505, file: !1, line: 1662, baseType: !269, size: 24, align: 8, offset: 48)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !505, file: !1, line: 1663, baseType: !264, size: 6, align: 8, offset: 72)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !505, file: !1, line: 1664, baseType: !264, size: 2, align: 8, offset: 78)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !505, file: !1, line: 1665, baseType: !264, size: 8, align: 8, offset: 80)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !505, file: !1, line: 1666, baseType: !264, size: 8, align: 8, offset: 88)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "PSCAN_CD", scope: !258, file: !1, line: 2190, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "STOP_PLAY_SCAN", scope: !258, file: !1, line: 2191, baseType: !521, size: 80, align: 8)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "_STOP_PLAY_SCAN", file: !1, line: 1668, size: 80, align: 8, elements: !522)
!522 = !{!523, !524, !525, !526, !530}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !521, file: !1, line: 1669, baseType: !264, size: 8, align: 8)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !521, file: !1, line: 1670, baseType: !264, size: 5, align: 8, offset: 8)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Lun", scope: !521, file: !1, line: 1671, baseType: !264, size: 3, align: 8, offset: 13)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !521, file: !1, line: 1672, baseType: !527, size: 56, align: 8, offset: 16)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 56, align: 8, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 7)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !521, file: !1, line: 1673, baseType: !264, size: 8, align: 8, offset: 72)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "PSTOP_PLAY_SCAN", scope: !258, file: !1, line: 2192, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "SUBCHANNEL", scope: !258, file: !1, line: 2193, baseType: !534, size: 80, align: 8)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SUBCHANNEL", file: !1, line: 1675, size: 80, align: 8, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !534, file: !1, line: 1676, baseType: !264, size: 8, align: 8)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved0", scope: !534, file: !1, line: 1677, baseType: !264, size: 1, align: 8, offset: 8)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Msf", scope: !534, file: !1, line: 1678, baseType: !264, size: 1, align: 8, offset: 9)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !534, file: !1, line: 1679, baseType: !264, size: 3, align: 8, offset: 10)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !534, file: !1, line: 1680, baseType: !264, size: 3, align: 8, offset: 13)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !534, file: !1, line: 1681, baseType: !264, size: 6, align: 8, offset: 16)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "SubQ", scope: !534, file: !1, line: 1682, baseType: !264, size: 1, align: 8, offset: 22)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !534, file: !1, line: 1683, baseType: !264, size: 1, align: 8, offset: 23)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Format", scope: !534, file: !1, line: 1684, baseType: !264, size: 8, align: 8, offset: 24)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !534, file: !1, line: 1685, baseType: !391, size: 16, align: 8, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "TrackNumber", scope: !534, file: !1, line: 1686, baseType: !264, size: 8, align: 8, offset: 48)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationLength", scope: !534, file: !1, line: 1687, baseType: !391, size: 16, align: 8, offset: 56)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !534, file: !1, line: 1688, baseType: !264, size: 8, align: 8, offset: 72)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "PSUBCHANNEL", scope: !258, file: !1, line: 2194, baseType: !550, size: 64, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "READ_CD", scope: !258, file: !1, line: 2195, baseType: !552, size: 96, align: 8)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "_READ_CD", file: !1, line: 1690, size: 96, align: 8, elements: !553)
!553 = !{!554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !552, file: !1, line: 1691, baseType: !264, size: 8, align: 8)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "RelativeAddress", scope: !552, file: !1, line: 1692, baseType: !264, size: 1, align: 8, offset: 8)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved0", scope: !552, file: !1, line: 1693, baseType: !264, size: 1, align: 8, offset: 9)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedSectorType", scope: !552, file: !1, line: 1694, baseType: !264, size: 3, align: 8, offset: 10)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Lun", scope: !552, file: !1, line: 1695, baseType: !264, size: 3, align: 8, offset: 13)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "StartingLBA", scope: !552, file: !1, line: 1696, baseType: !356, size: 32, align: 8, offset: 16)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "TransferBlocks", scope: !552, file: !1, line: 1697, baseType: !269, size: 24, align: 8, offset: 48)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !552, file: !1, line: 1698, baseType: !264, size: 1, align: 8, offset: 72)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorFlags", scope: !552, file: !1, line: 1699, baseType: !264, size: 2, align: 8, offset: 73)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "IncludeEDC", scope: !552, file: !1, line: 1700, baseType: !264, size: 1, align: 8, offset: 75)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "IncludeUserData", scope: !552, file: !1, line: 1701, baseType: !264, size: 1, align: 8, offset: 76)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderCode", scope: !552, file: !1, line: 1702, baseType: !264, size: 2, align: 8, offset: 77)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "IncludeSyncData", scope: !552, file: !1, line: 1703, baseType: !264, size: 1, align: 8, offset: 79)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "SubChannelSelection", scope: !552, file: !1, line: 1704, baseType: !264, size: 3, align: 8, offset: 80)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !552, file: !1, line: 1705, baseType: !264, size: 5, align: 8, offset: 83)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !552, file: !1, line: 1706, baseType: !264, size: 8, align: 8, offset: 88)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "PREAD_CD", scope: !258, file: !1, line: 2196, baseType: !571, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "READ_CD_MSF", scope: !258, file: !1, line: 2197, baseType: !573, size: 104, align: 8)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "_READ_CD_MSF", file: !1, line: 1708, size: 104, align: 8, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !573, file: !1, line: 1709, baseType: !264, size: 8, align: 8)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "RelativeAddress", scope: !573, file: !1, line: 1710, baseType: !264, size: 1, align: 8, offset: 8)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !573, file: !1, line: 1711, baseType: !264, size: 1, align: 8, offset: 9)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedSectorType", scope: !573, file: !1, line: 1712, baseType: !264, size: 3, align: 8, offset: 10)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Lun", scope: !573, file: !1, line: 1713, baseType: !264, size: 3, align: 8, offset: 13)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !573, file: !1, line: 1714, baseType: !264, size: 8, align: 8, offset: 16)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "StartingM", scope: !573, file: !1, line: 1715, baseType: !264, size: 8, align: 8, offset: 24)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "StartingS", scope: !573, file: !1, line: 1716, baseType: !264, size: 8, align: 8, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "StartingF", scope: !573, file: !1, line: 1717, baseType: !264, size: 8, align: 8, offset: 40)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "EndingM", scope: !573, file: !1, line: 1718, baseType: !264, size: 8, align: 8, offset: 48)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "EndingS", scope: !573, file: !1, line: 1719, baseType: !264, size: 8, align: 8, offset: 56)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "EndingF", scope: !573, file: !1, line: 1720, baseType: !264, size: 8, align: 8, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !573, file: !1, line: 1721, baseType: !264, size: 8, align: 8, offset: 72)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !573, file: !1, line: 1722, baseType: !264, size: 1, align: 8, offset: 80)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorFlags", scope: !573, file: !1, line: 1723, baseType: !264, size: 2, align: 8, offset: 81)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "IncludeEDC", scope: !573, file: !1, line: 1724, baseType: !264, size: 1, align: 8, offset: 83)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "IncludeUserData", scope: !573, file: !1, line: 1725, baseType: !264, size: 1, align: 8, offset: 84)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderCode", scope: !573, file: !1, line: 1726, baseType: !264, size: 2, align: 8, offset: 85)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "IncludeSyncData", scope: !573, file: !1, line: 1727, baseType: !264, size: 1, align: 8, offset: 87)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "SubChannelSelection", scope: !573, file: !1, line: 1728, baseType: !264, size: 3, align: 8, offset: 88)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !573, file: !1, line: 1729, baseType: !264, size: 5, align: 8, offset: 91)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !573, file: !1, line: 1730, baseType: !264, size: 8, align: 8, offset: 96)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "PREAD_CD_MSF", scope: !258, file: !1, line: 2198, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "PLXTR_READ_CDDA", scope: !258, file: !1, line: 2199, baseType: !600, size: 96, align: 8)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PLXTR_READ_CDDA", file: !1, line: 1732, size: 96, align: 8, elements: !601)
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !600, file: !1, line: 1733, baseType: !264, size: 8, align: 8)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved0", scope: !600, file: !1, line: 1734, baseType: !264, size: 5, align: 8, offset: 8)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !600, file: !1, line: 1735, baseType: !264, size: 3, align: 8, offset: 13)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlockByte0", scope: !600, file: !1, line: 1736, baseType: !264, size: 8, align: 8, offset: 16)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlockByte1", scope: !600, file: !1, line: 1737, baseType: !264, size: 8, align: 8, offset: 24)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlockByte2", scope: !600, file: !1, line: 1738, baseType: !264, size: 8, align: 8, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlockByte3", scope: !600, file: !1, line: 1739, baseType: !264, size: 8, align: 8, offset: 40)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "TransferBlockByte0", scope: !600, file: !1, line: 1740, baseType: !264, size: 8, align: 8, offset: 48)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "TransferBlockByte1", scope: !600, file: !1, line: 1741, baseType: !264, size: 8, align: 8, offset: 56)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "TransferBlockByte2", scope: !600, file: !1, line: 1742, baseType: !264, size: 8, align: 8, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "TransferBlockByte3", scope: !600, file: !1, line: 1743, baseType: !264, size: 8, align: 8, offset: 72)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "SubCode", scope: !600, file: !1, line: 1744, baseType: !264, size: 8, align: 8, offset: 80)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !600, file: !1, line: 1745, baseType: !264, size: 8, align: 8, offset: 88)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "PPLXTR_READ_CDDA", scope: !258, file: !1, line: 2200, baseType: !616, size: 64, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "NEC_READ_CDDA", scope: !258, file: !1, line: 2201, baseType: !618, size: 80, align: 8)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NEC_READ_CDDA", file: !1, line: 1747, size: 80, align: 8, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625, !626, !627, !628, !629}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !618, file: !1, line: 1748, baseType: !264, size: 8, align: 8)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved0", scope: !618, file: !1, line: 1749, baseType: !264, size: 8, align: 8, offset: 8)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlockByte0", scope: !618, file: !1, line: 1750, baseType: !264, size: 8, align: 8, offset: 16)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlockByte1", scope: !618, file: !1, line: 1751, baseType: !264, size: 8, align: 8, offset: 24)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlockByte2", scope: !618, file: !1, line: 1752, baseType: !264, size: 8, align: 8, offset: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlockByte3", scope: !618, file: !1, line: 1753, baseType: !264, size: 8, align: 8, offset: 40)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !618, file: !1, line: 1754, baseType: !264, size: 8, align: 8, offset: 48)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "TransferBlockByte0", scope: !618, file: !1, line: 1755, baseType: !264, size: 8, align: 8, offset: 56)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "TransferBlockByte1", scope: !618, file: !1, line: 1756, baseType: !264, size: 8, align: 8, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !618, file: !1, line: 1757, baseType: !264, size: 8, align: 8, offset: 72)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "PNEC_READ_CDDA", scope: !258, file: !1, line: 2202, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "MODE_SENSE", scope: !258, file: !1, line: 2203, baseType: !633, size: 48, align: 8)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MODE_SENSE", file: !1, line: 1759, size: 48, align: 8, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !633, file: !1, line: 1760, baseType: !264, size: 8, align: 8)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !633, file: !1, line: 1761, baseType: !264, size: 3, align: 8, offset: 8)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Dbd", scope: !633, file: !1, line: 1762, baseType: !264, size: 1, align: 8, offset: 11)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !633, file: !1, line: 1763, baseType: !264, size: 1, align: 8, offset: 12)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !633, file: !1, line: 1764, baseType: !264, size: 3, align: 8, offset: 13)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "PageCode", scope: !633, file: !1, line: 1765, baseType: !264, size: 6, align: 8, offset: 16)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Pc", scope: !633, file: !1, line: 1766, baseType: !264, size: 2, align: 8, offset: 22)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !633, file: !1, line: 1767, baseType: !264, size: 8, align: 8, offset: 24)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationLength", scope: !633, file: !1, line: 1768, baseType: !264, size: 8, align: 8, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !633, file: !1, line: 1769, baseType: !264, size: 8, align: 8, offset: 40)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "PMODE_SENSE", scope: !258, file: !1, line: 2204, baseType: !646, size: 64, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "MODE_SENSE10", scope: !258, file: !1, line: 2205, baseType: !648, size: 80, align: 8)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MODE_SENSE10", file: !1, line: 1771, size: 80, align: 8, elements: !649)
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !648, file: !1, line: 1772, baseType: !264, size: 8, align: 8)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !648, file: !1, line: 1773, baseType: !264, size: 3, align: 8, offset: 8)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Dbd", scope: !648, file: !1, line: 1774, baseType: !264, size: 1, align: 8, offset: 11)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !648, file: !1, line: 1775, baseType: !264, size: 1, align: 8, offset: 12)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !648, file: !1, line: 1776, baseType: !264, size: 3, align: 8, offset: 13)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "PageCode", scope: !648, file: !1, line: 1777, baseType: !264, size: 6, align: 8, offset: 16)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Pc", scope: !648, file: !1, line: 1778, baseType: !264, size: 2, align: 8, offset: 22)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !648, file: !1, line: 1779, baseType: !356, size: 32, align: 8, offset: 24)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationLength", scope: !648, file: !1, line: 1780, baseType: !391, size: 16, align: 8, offset: 56)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !648, file: !1, line: 1781, baseType: !264, size: 8, align: 8, offset: 72)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "PMODE_SENSE10", scope: !258, file: !1, line: 2206, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "MODE_SELECT", scope: !258, file: !1, line: 2207, baseType: !663, size: 48, align: 8)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MODE_SELECT", file: !1, line: 1783, size: 48, align: 8, elements: !664)
!664 = !{!665, !666, !667, !668, !669, !670, !671, !672}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !663, file: !1, line: 1784, baseType: !264, size: 8, align: 8)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "SPBit", scope: !663, file: !1, line: 1785, baseType: !264, size: 1, align: 8, offset: 8)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !663, file: !1, line: 1786, baseType: !264, size: 3, align: 8, offset: 9)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "PFBit", scope: !663, file: !1, line: 1787, baseType: !264, size: 1, align: 8, offset: 12)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !663, file: !1, line: 1788, baseType: !264, size: 3, align: 8, offset: 13)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !663, file: !1, line: 1789, baseType: !391, size: 16, align: 8, offset: 16)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ParameterListLength", scope: !663, file: !1, line: 1790, baseType: !264, size: 8, align: 8, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !663, file: !1, line: 1791, baseType: !264, size: 8, align: 8, offset: 40)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "PMODE_SELECT", scope: !258, file: !1, line: 2208, baseType: !674, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64, align: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "MODE_SELECT10", scope: !258, file: !1, line: 2209, baseType: !676, size: 80, align: 8)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MODE_SELECT10", file: !1, line: 1793, size: 80, align: 8, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !676, file: !1, line: 1794, baseType: !264, size: 8, align: 8)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "SPBit", scope: !676, file: !1, line: 1795, baseType: !264, size: 1, align: 8, offset: 8)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !676, file: !1, line: 1796, baseType: !264, size: 3, align: 8, offset: 9)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "PFBit", scope: !676, file: !1, line: 1797, baseType: !264, size: 1, align: 8, offset: 12)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !676, file: !1, line: 1798, baseType: !264, size: 3, align: 8, offset: 13)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !676, file: !1, line: 1799, baseType: !405, size: 40, align: 8, offset: 16)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ParameterListLength", scope: !676, file: !1, line: 1800, baseType: !391, size: 16, align: 8, offset: 56)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !676, file: !1, line: 1801, baseType: !264, size: 8, align: 8, offset: 72)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "PMODE_SELECT10", scope: !258, file: !1, line: 2210, baseType: !687, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "LOCATE", scope: !258, file: !1, line: 2211, baseType: !689, size: 80, align: 8)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LOCATE", file: !1, line: 1803, size: 80, align: 8, elements: !690)
!690 = !{!691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !689, file: !1, line: 1804, baseType: !264, size: 8, align: 8)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Immediate", scope: !689, file: !1, line: 1805, baseType: !264, size: 1, align: 8, offset: 8)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "CPBit", scope: !689, file: !1, line: 1806, baseType: !264, size: 1, align: 8, offset: 9)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "BTBit", scope: !689, file: !1, line: 1807, baseType: !264, size: 1, align: 8, offset: 10)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !689, file: !1, line: 1808, baseType: !264, size: 2, align: 8, offset: 11)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !689, file: !1, line: 1809, baseType: !264, size: 3, align: 8, offset: 13)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !689, file: !1, line: 1810, baseType: !264, size: 8, align: 8, offset: 16)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlockAddress", scope: !689, file: !1, line: 1811, baseType: !356, size: 32, align: 8, offset: 24)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !689, file: !1, line: 1812, baseType: !264, size: 8, align: 8, offset: 56)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Partition", scope: !689, file: !1, line: 1813, baseType: !264, size: 8, align: 8, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !689, file: !1, line: 1814, baseType: !264, size: 8, align: 8, offset: 72)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "PLOCATE", scope: !258, file: !1, line: 2212, baseType: !703, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64, align: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "LOGSENSE", scope: !258, file: !1, line: 2213, baseType: !705, size: 80, align: 8)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LOGSENSE", file: !1, line: 1816, size: 80, align: 8, elements: !706)
!706 = !{!707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !705, file: !1, line: 1817, baseType: !264, size: 8, align: 8)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "SPBit", scope: !705, file: !1, line: 1818, baseType: !264, size: 1, align: 8, offset: 8)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "PPCBit", scope: !705, file: !1, line: 1819, baseType: !264, size: 1, align: 8, offset: 9)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !705, file: !1, line: 1820, baseType: !264, size: 3, align: 8, offset: 10)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !705, file: !1, line: 1821, baseType: !264, size: 3, align: 8, offset: 13)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "PageCode", scope: !705, file: !1, line: 1822, baseType: !264, size: 6, align: 8, offset: 16)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "PCBit", scope: !705, file: !1, line: 1823, baseType: !264, size: 2, align: 8, offset: 22)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !705, file: !1, line: 1824, baseType: !264, size: 8, align: 8, offset: 24)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !705, file: !1, line: 1825, baseType: !264, size: 8, align: 8, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ParameterPointer", scope: !705, file: !1, line: 1826, baseType: !391, size: 16, align: 8, offset: 40)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationLength", scope: !705, file: !1, line: 1827, baseType: !391, size: 16, align: 8, offset: 56)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !705, file: !1, line: 1828, baseType: !264, size: 8, align: 8, offset: 72)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "PLOGSENSE", scope: !258, file: !1, line: 2214, baseType: !720, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64, align: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "LOGSELECT", scope: !258, file: !1, line: 2215, baseType: !722, size: 80, align: 8)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LOGSELECT", file: !1, line: 1830, size: 80, align: 8, elements: !723)
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732, !733}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !722, file: !1, line: 1831, baseType: !264, size: 8, align: 8)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "SPBit", scope: !722, file: !1, line: 1832, baseType: !264, size: 1, align: 8, offset: 8)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "PCRBit", scope: !722, file: !1, line: 1833, baseType: !264, size: 1, align: 8, offset: 9)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !722, file: !1, line: 1834, baseType: !264, size: 3, align: 8, offset: 10)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !722, file: !1, line: 1835, baseType: !264, size: 3, align: 8, offset: 13)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !722, file: !1, line: 1836, baseType: !264, size: 6, align: 8, offset: 16)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "PCBit", scope: !722, file: !1, line: 1837, baseType: !264, size: 2, align: 8, offset: 22)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !722, file: !1, line: 1838, baseType: !356, size: 32, align: 8, offset: 24)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ParameterListLength", scope: !722, file: !1, line: 1839, baseType: !391, size: 16, align: 8, offset: 56)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !722, file: !1, line: 1840, baseType: !264, size: 8, align: 8, offset: 72)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "PLOGSELECT", scope: !258, file: !1, line: 2216, baseType: !735, size: 64, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "PRINT", scope: !258, file: !1, line: 2217, baseType: !737, size: 48, align: 8)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PRINT", file: !1, line: 1842, size: 48, align: 8, elements: !738)
!738 = !{!739, !740, !741, !742, !743}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !737, file: !1, line: 1843, baseType: !264, size: 8, align: 8)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !737, file: !1, line: 1844, baseType: !264, size: 5, align: 8, offset: 8)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !737, file: !1, line: 1845, baseType: !264, size: 3, align: 8, offset: 13)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "TransferLength", scope: !737, file: !1, line: 1846, baseType: !269, size: 24, align: 8, offset: 16)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !737, file: !1, line: 1847, baseType: !264, size: 8, align: 8, offset: 40)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "PPRINT", scope: !258, file: !1, line: 2218, baseType: !745, size: 64, align: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64, align: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "SEEK", scope: !258, file: !1, line: 2219, baseType: !747, size: 80, align: 8)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SEEK", file: !1, line: 1849, size: 80, align: 8, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !754}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !747, file: !1, line: 1850, baseType: !264, size: 8, align: 8)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !747, file: !1, line: 1851, baseType: !264, size: 5, align: 8, offset: 8)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !747, file: !1, line: 1852, baseType: !264, size: 3, align: 8, offset: 13)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalBlockAddress", scope: !747, file: !1, line: 1853, baseType: !356, size: 32, align: 8, offset: 16)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !747, file: !1, line: 1854, baseType: !269, size: 24, align: 8, offset: 48)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !747, file: !1, line: 1855, baseType: !264, size: 8, align: 8, offset: 72)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "PSEEK", scope: !258, file: !1, line: 2220, baseType: !756, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ERASE", scope: !258, file: !1, line: 2221, baseType: !758, size: 48, align: 8)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ERASE", file: !1, line: 1857, size: 48, align: 8, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !758, file: !1, line: 1858, baseType: !264, size: 8, align: 8)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Long", scope: !758, file: !1, line: 1859, baseType: !264, size: 1, align: 8, offset: 8)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "Immediate", scope: !758, file: !1, line: 1860, baseType: !264, size: 1, align: 8, offset: 9)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !758, file: !1, line: 1861, baseType: !264, size: 3, align: 8, offset: 10)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !758, file: !1, line: 1862, baseType: !264, size: 3, align: 8, offset: 13)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !758, file: !1, line: 1863, baseType: !269, size: 24, align: 8, offset: 16)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !758, file: !1, line: 1864, baseType: !264, size: 8, align: 8, offset: 40)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "PERASE", scope: !258, file: !1, line: 2222, baseType: !768, size: 64, align: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, align: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "START_STOP", scope: !258, file: !1, line: 2223, baseType: !770, size: 48, align: 8)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "_START_STOP", file: !1, line: 1866, size: 48, align: 8, elements: !771)
!771 = !{!772, !773, !774, !775, !776, !777, !778, !779, !780}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !770, file: !1, line: 1867, baseType: !264, size: 8, align: 8)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "Immediate", scope: !770, file: !1, line: 1868, baseType: !264, size: 1, align: 8, offset: 8)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !770, file: !1, line: 1869, baseType: !264, size: 4, align: 8, offset: 9)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !770, file: !1, line: 1870, baseType: !264, size: 3, align: 8, offset: 13)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !770, file: !1, line: 1871, baseType: !391, size: 16, align: 8, offset: 16)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "Start", scope: !770, file: !1, line: 1872, baseType: !264, size: 1, align: 8, offset: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "LoadEject", scope: !770, file: !1, line: 1873, baseType: !264, size: 1, align: 8, offset: 33)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !770, file: !1, line: 1874, baseType: !264, size: 6, align: 8, offset: 34)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !770, file: !1, line: 1875, baseType: !264, size: 8, align: 8, offset: 40)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "PSTART_STOP", scope: !258, file: !1, line: 2224, baseType: !782, size: 64, align: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "MEDIA_REMOVAL", scope: !258, file: !1, line: 2225, baseType: !784, size: 48, align: 8)
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MEDIA_REMOVAL", file: !1, line: 1877, size: 48, align: 8, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !791, !792, !793}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !784, file: !1, line: 1878, baseType: !264, size: 8, align: 8)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !784, file: !1, line: 1879, baseType: !264, size: 5, align: 8, offset: 8)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !784, file: !1, line: 1880, baseType: !264, size: 3, align: 8, offset: 13)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !784, file: !1, line: 1881, baseType: !391, size: 16, align: 8, offset: 16)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "Prevent", scope: !784, file: !1, line: 1882, baseType: !264, size: 1, align: 8, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Persistant", scope: !784, file: !1, line: 1883, baseType: !264, size: 1, align: 8, offset: 33)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !784, file: !1, line: 1884, baseType: !264, size: 6, align: 8, offset: 34)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !784, file: !1, line: 1885, baseType: !264, size: 8, align: 8, offset: 40)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "PMEDIA_REMOVAL", scope: !258, file: !1, line: 2226, baseType: !795, size: 64, align: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64, align: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "SEEK_BLOCK", scope: !258, file: !1, line: 2227, baseType: !797, size: 48, align: 8)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SEEK_BLOCK", file: !1, line: 1887, size: 48, align: 8, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !797, file: !1, line: 1888, baseType: !264, size: 8, align: 8)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "Immediate", scope: !797, file: !1, line: 1889, baseType: !264, size: 1, align: 8, offset: 8)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !797, file: !1, line: 1890, baseType: !264, size: 7, align: 8, offset: 9)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "BlockAddress", scope: !797, file: !1, line: 1891, baseType: !269, size: 24, align: 8, offset: 16)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !797, file: !1, line: 1892, baseType: !264, size: 1, align: 8, offset: 40)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "Flag", scope: !797, file: !1, line: 1893, baseType: !264, size: 1, align: 8, offset: 41)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !797, file: !1, line: 1894, baseType: !264, size: 4, align: 8, offset: 42)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "VendorUnique", scope: !797, file: !1, line: 1895, baseType: !264, size: 2, align: 8, offset: 46)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "PSEEK_BLOCK", scope: !258, file: !1, line: 2228, baseType: !808, size: 64, align: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "REQUEST_BLOCK_ADDRESS", scope: !258, file: !1, line: 2229, baseType: !810, size: 48, align: 8)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REQUEST_BLOCK_ADDRESS", file: !1, line: 1897, size: 48, align: 8, elements: !811)
!811 = !{!812, !813, !814, !815, !816, !817, !818}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !810, file: !1, line: 1898, baseType: !264, size: 8, align: 8)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !810, file: !1, line: 1899, baseType: !269, size: 24, align: 8, offset: 8)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationLength", scope: !810, file: !1, line: 1900, baseType: !264, size: 8, align: 8, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !810, file: !1, line: 1901, baseType: !264, size: 1, align: 8, offset: 40)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "Flag", scope: !810, file: !1, line: 1902, baseType: !264, size: 1, align: 8, offset: 41)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !810, file: !1, line: 1903, baseType: !264, size: 4, align: 8, offset: 42)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "VendorUnique", scope: !810, file: !1, line: 1904, baseType: !264, size: 2, align: 8, offset: 46)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "PREQUEST_BLOCK_ADDRESS", scope: !258, file: !1, line: 2230, baseType: !820, size: 64, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64, align: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "PARTITION", scope: !258, file: !1, line: 2231, baseType: !822, size: 48, align: 8)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PARTITION", file: !1, line: 1906, size: 48, align: 8, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !822, file: !1, line: 1907, baseType: !264, size: 8, align: 8)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "Immediate", scope: !822, file: !1, line: 1908, baseType: !264, size: 1, align: 8, offset: 8)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Sel", scope: !822, file: !1, line: 1909, baseType: !264, size: 1, align: 8, offset: 9)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "PartitionSelect", scope: !822, file: !1, line: 1910, baseType: !264, size: 6, align: 8, offset: 10)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !822, file: !1, line: 1911, baseType: !269, size: 24, align: 8, offset: 16)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !822, file: !1, line: 1912, baseType: !264, size: 8, align: 8, offset: 40)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "PPARTITION", scope: !258, file: !1, line: 2232, baseType: !831, size: 64, align: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64, align: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "WRITE_TAPE_MARKS", scope: !258, file: !1, line: 2233, baseType: !833, size: 48, align: 8)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WRITE_TAPE_MARKS", file: !1, line: 1914, size: 48, align: 8, elements: !834)
!834 = !{!835, !836, !837, !838, !839, !840, !841}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !833, file: !1, line: 1915, baseType: !264, size: 8, align: 8)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "Immediate", scope: !833, file: !1, line: 1916, baseType: !264, size: 1, align: 8, offset: 8)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "WriteSetMarks", scope: !833, file: !1, line: 1917, baseType: !264, size: 1, align: 8, offset: 9)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !833, file: !1, line: 1918, baseType: !264, size: 3, align: 8, offset: 10)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !833, file: !1, line: 1919, baseType: !264, size: 3, align: 8, offset: 13)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "TransferLength", scope: !833, file: !1, line: 1920, baseType: !269, size: 24, align: 8, offset: 16)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !833, file: !1, line: 1921, baseType: !264, size: 8, align: 8, offset: 40)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "PWRITE_TAPE_MARKS", scope: !258, file: !1, line: 2234, baseType: !843, size: 64, align: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64, align: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "SPACE_TAPE_MARKS", scope: !258, file: !1, line: 2235, baseType: !845, size: 48, align: 8)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SPACE_TAPE_MARKS", file: !1, line: 1933, size: 48, align: 8, elements: !846)
!846 = !{!847, !848, !849, !850, !851, !852, !853, !854}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !845, file: !1, line: 1934, baseType: !264, size: 8, align: 8)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "Code", scope: !845, file: !1, line: 1935, baseType: !264, size: 3, align: 8, offset: 8)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !845, file: !1, line: 1936, baseType: !264, size: 2, align: 8, offset: 11)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !845, file: !1, line: 1937, baseType: !264, size: 3, align: 8, offset: 13)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "NumMarksMSB", scope: !845, file: !1, line: 1938, baseType: !264, size: 8, align: 8, offset: 16)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "NumMarks", scope: !845, file: !1, line: 1939, baseType: !264, size: 8, align: 8, offset: 24)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "NumMarksLSB", scope: !845, file: !1, line: 1940, baseType: !264, size: 8, align: 8, offset: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Byte6", scope: !845, file: !1, line: 1941, baseType: !855, size: 8, align: 8, offset: 40)
!855 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_Byte6_118", file: !1, line: 1929, size: 8, align: 8, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !855, file: !1, line: 1930, baseType: !264, size: 8, align: 8)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "Fields", scope: !855, file: !1, line: 1931, baseType: !859, size: 8, align: 8)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Fields_119", file: !1, line: 1923, size: 8, align: 8, elements: !860)
!860 = !{!861, !862, !863, !864}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !859, file: !1, line: 1924, baseType: !264, size: 1, align: 8)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "Flag", scope: !859, file: !1, line: 1925, baseType: !264, size: 1, align: 8, offset: 1)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !859, file: !1, line: 1926, baseType: !264, size: 4, align: 8, offset: 2)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "VendorUnique", scope: !859, file: !1, line: 1927, baseType: !264, size: 2, align: 8, offset: 6)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "PSPACE_TAPE_MARKS", scope: !258, file: !1, line: 2236, baseType: !866, size: 64, align: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "READ_POSITION", scope: !258, file: !1, line: 2237, baseType: !868, size: 80, align: 8)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "_READ_POSITION", file: !1, line: 1943, size: 80, align: 8, elements: !869)
!869 = !{!870, !871, !872, !873, !874, !875}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "Operation", scope: !868, file: !1, line: 1944, baseType: !264, size: 8, align: 8)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "BlockType", scope: !868, file: !1, line: 1945, baseType: !264, size: 1, align: 8, offset: 8)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !868, file: !1, line: 1946, baseType: !264, size: 4, align: 8, offset: 9)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "Lun", scope: !868, file: !1, line: 1947, baseType: !264, size: 3, align: 8, offset: 13)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !868, file: !1, line: 1948, baseType: !527, size: 56, align: 8, offset: 16)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !868, file: !1, line: 1949, baseType: !264, size: 8, align: 8, offset: 72)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "PREAD_POSITION", scope: !258, file: !1, line: 2238, baseType: !877, size: 64, align: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64, align: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "CDB6READWRITETAPE", scope: !258, file: !1, line: 2239, baseType: !879, size: 48, align: 8)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CDB6READWRITETAPE", file: !1, line: 1951, size: 48, align: 8, elements: !880)
!880 = !{!881, !882, !883, !884, !885, !886, !887, !888, !889, !890}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !879, file: !1, line: 1952, baseType: !264, size: 8, align: 8)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "VendorSpecific", scope: !879, file: !1, line: 1953, baseType: !264, size: 5, align: 8, offset: 8)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !879, file: !1, line: 1954, baseType: !264, size: 3, align: 8, offset: 13)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "TransferLenMSB", scope: !879, file: !1, line: 1955, baseType: !264, size: 8, align: 8, offset: 16)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "TransferLen", scope: !879, file: !1, line: 1956, baseType: !264, size: 8, align: 8, offset: 24)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "TransferLenLSB", scope: !879, file: !1, line: 1957, baseType: !264, size: 8, align: 8, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !879, file: !1, line: 1958, baseType: !264, size: 1, align: 8, offset: 40)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "Flag", scope: !879, file: !1, line: 1959, baseType: !264, size: 1, align: 8, offset: 41)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !879, file: !1, line: 1960, baseType: !264, size: 4, align: 8, offset: 42)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "VendorUnique", scope: !879, file: !1, line: 1961, baseType: !264, size: 2, align: 8, offset: 46)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "PCDB6READWRITETAPE", scope: !258, file: !1, line: 2240, baseType: !892, size: 64, align: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64, align: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "INIT_ELEMENT_STATUS", scope: !258, file: !1, line: 2241, baseType: !894, size: 48, align: 8)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "_INIT_ELEMENT_STATUS", file: !1, line: 1963, size: 48, align: 8, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !894, file: !1, line: 1964, baseType: !264, size: 8, align: 8)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !894, file: !1, line: 1965, baseType: !264, size: 5, align: 8, offset: 8)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNubmer", scope: !894, file: !1, line: 1966, baseType: !264, size: 3, align: 8, offset: 13)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !894, file: !1, line: 1967, baseType: !269, size: 24, align: 8, offset: 16)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !894, file: !1, line: 1968, baseType: !264, size: 7, align: 8, offset: 40)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "NoBarCode", scope: !894, file: !1, line: 1969, baseType: !264, size: 1, align: 8, offset: 47)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "PINIT_ELEMENT_STATUS", scope: !258, file: !1, line: 2242, baseType: !903, size: 64, align: 64)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "INITIALIZE_ELEMENT_RANGE", scope: !258, file: !1, line: 2243, baseType: !905, size: 80, align: 8)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "_INITIALIZE_ELEMENT_RANGE", file: !1, line: 1971, size: 80, align: 8, elements: !906)
!906 = !{!907, !908, !909, !910, !911, !912, !913, !914, !915, !916}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !905, file: !1, line: 1972, baseType: !264, size: 8, align: 8)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "Range", scope: !905, file: !1, line: 1973, baseType: !264, size: 1, align: 8, offset: 8)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !905, file: !1, line: 1974, baseType: !264, size: 4, align: 8, offset: 9)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNubmer", scope: !905, file: !1, line: 1975, baseType: !264, size: 3, align: 8, offset: 13)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "FirstElementAddress", scope: !905, file: !1, line: 1976, baseType: !391, size: 16, align: 8, offset: 16)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !905, file: !1, line: 1977, baseType: !391, size: 16, align: 8, offset: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfElements", scope: !905, file: !1, line: 1978, baseType: !391, size: 16, align: 8, offset: 48)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !905, file: !1, line: 1979, baseType: !264, size: 8, align: 8, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !905, file: !1, line: 1980, baseType: !264, size: 7, align: 8, offset: 72)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "NoBarCode", scope: !905, file: !1, line: 1981, baseType: !264, size: 1, align: 8, offset: 79)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "PINITIALIZE_ELEMENT_RANGE", scope: !258, file: !1, line: 2244, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "POSITION_TO_ELEMENT", scope: !258, file: !1, line: 2245, baseType: !920, size: 80, align: 8)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "_POSITION_TO_ELEMENT", file: !1, line: 1983, size: 80, align: 8, elements: !921)
!921 = !{!922, !923, !924, !925, !926, !927, !928, !929, !930}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !920, file: !1, line: 1984, baseType: !264, size: 8, align: 8)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !920, file: !1, line: 1985, baseType: !264, size: 5, align: 8, offset: 8)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !920, file: !1, line: 1986, baseType: !264, size: 3, align: 8, offset: 13)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "TransportElementAddress", scope: !920, file: !1, line: 1987, baseType: !391, size: 16, align: 8, offset: 16)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationElementAddress", scope: !920, file: !1, line: 1988, baseType: !391, size: 16, align: 8, offset: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !920, file: !1, line: 1989, baseType: !391, size: 16, align: 8, offset: 48)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "Flip", scope: !920, file: !1, line: 1990, baseType: !264, size: 1, align: 8, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !920, file: !1, line: 1991, baseType: !264, size: 7, align: 8, offset: 65)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !920, file: !1, line: 1992, baseType: !264, size: 8, align: 8, offset: 72)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "PPOSITION_TO_ELEMENT", scope: !258, file: !1, line: 2246, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "MOVE_MEDIUM", scope: !258, file: !1, line: 2247, baseType: !934, size: 96, align: 8)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MOVE_MEDIUM", file: !1, line: 1994, size: 96, align: 8, elements: !935)
!935 = !{!936, !937, !938, !939, !940, !941, !942, !943, !944, !945}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !934, file: !1, line: 1995, baseType: !264, size: 8, align: 8)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !934, file: !1, line: 1996, baseType: !264, size: 5, align: 8, offset: 8)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !934, file: !1, line: 1997, baseType: !264, size: 3, align: 8, offset: 13)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "TransportElementAddress", scope: !934, file: !1, line: 1998, baseType: !391, size: 16, align: 8, offset: 16)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "SourceElementAddress", scope: !934, file: !1, line: 1999, baseType: !391, size: 16, align: 8, offset: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationElementAddress", scope: !934, file: !1, line: 2000, baseType: !391, size: 16, align: 8, offset: 48)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !934, file: !1, line: 2001, baseType: !391, size: 16, align: 8, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "Flip", scope: !934, file: !1, line: 2002, baseType: !264, size: 1, align: 8, offset: 80)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !934, file: !1, line: 2003, baseType: !264, size: 7, align: 8, offset: 81)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !934, file: !1, line: 2004, baseType: !264, size: 8, align: 8, offset: 88)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "PMOVE_MEDIUM", scope: !258, file: !1, line: 2248, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "EXCHANGE_MEDIUM", scope: !258, file: !1, line: 2249, baseType: !949, size: 96, align: 8)
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "_EXCHANGE_MEDIUM", file: !1, line: 2006, size: 96, align: 8, elements: !950)
!950 = !{!951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !949, file: !1, line: 2007, baseType: !264, size: 8, align: 8)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !949, file: !1, line: 2008, baseType: !264, size: 5, align: 8, offset: 8)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !949, file: !1, line: 2009, baseType: !264, size: 3, align: 8, offset: 13)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "TransportElementAddress", scope: !949, file: !1, line: 2010, baseType: !391, size: 16, align: 8, offset: 16)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "SourceElementAddress", scope: !949, file: !1, line: 2011, baseType: !391, size: 16, align: 8, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "Destination1ElementAddress", scope: !949, file: !1, line: 2012, baseType: !391, size: 16, align: 8, offset: 48)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "Destination2ElementAddress", scope: !949, file: !1, line: 2013, baseType: !391, size: 16, align: 8, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "Flip1", scope: !949, file: !1, line: 2014, baseType: !264, size: 1, align: 8, offset: 80)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "Flip2", scope: !949, file: !1, line: 2015, baseType: !264, size: 1, align: 8, offset: 81)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !949, file: !1, line: 2016, baseType: !264, size: 6, align: 8, offset: 82)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !949, file: !1, line: 2017, baseType: !264, size: 8, align: 8, offset: 88)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "PEXCHANGE_MEDIUM", scope: !258, file: !1, line: 2250, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "READ_ELEMENT_STATUS", scope: !258, file: !1, line: 2251, baseType: !965, size: 96, align: 8)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "_READ_ELEMENT_STATUS", file: !1, line: 2019, size: 96, align: 8, elements: !966)
!966 = !{!967, !968, !969, !970, !971, !972, !973, !974, !975, !976}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "OperationCode", scope: !965, file: !1, line: 2020, baseType: !264, size: 8, align: 8)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ElementType", scope: !965, file: !1, line: 2021, baseType: !264, size: 4, align: 8, offset: 8)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "VolTag", scope: !965, file: !1, line: 2022, baseType: !264, size: 1, align: 8, offset: 12)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "LogicalUnitNumber", scope: !965, file: !1, line: 2023, baseType: !264, size: 3, align: 8, offset: 13)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "StartingElementAddress", scope: !965, file: !1, line: 2024, baseType: !391, size: 16, align: 8, offset: 16)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfElements", scope: !965, file: !1, line: 2025, baseType: !391, size: 16, align: 8, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !965, file: !1, line: 2026, baseType: !264, size: 8, align: 8, offset: 48)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationLength", scope: !965, file: !1, line: 2027, baseType: !269, size: 24, align: 8, offset: 56)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !965, file: !1, line: 2028, baseType: !264, size: 8, align: 8, offset: 80)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !965, file: !1, line: 2029, baseType: !264, size: 8, align: 8, offset: 88)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "PREAD_ELEMENT_STATUS", scope: !258, file: !1, line: 2252, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "SEND_VOLUME_TAG", scope: !258, file: !1, line: 2253, baseType: !980, size: 96, align: 8)
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SEND_VOLUME_TAG", file: !1, line: 2031, size: 96, align: 8, elements: !981)
!981 = !{!982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993}
