; ModuleID = '<stdin>'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.11.0"

%struct._GUID = type { i64, i16, i16, [8 x i8] }
%struct._DEVICE_OBJECT = type { i16, i16, i64, %struct._DRIVER_OBJECT*, %struct._DEVICE_OBJECT*, %struct._DEVICE_OBJECT*, %struct._IRP*, %struct._IO_TIMER*, i64, i64, %struct._VPB*, i8*, i64, i8, %union.__anonunion_Queue_43, i64, %struct._KDEVICE_QUEUE, %struct._KDPC, i64, i8*, %struct._KEVENT, i16, i16, %struct._DEVOBJ_EXTENSION*, i8* }
%struct._DRIVER_OBJECT = type { i16, i16, %struct._DEVICE_OBJECT*, i64, i8*, i64, i8*, %struct._DRIVER_EXTENSION*, %struct._UNICODE_STRING, %struct._UNICODE_STRING*, %struct._FAST_IO_DISPATCH*, i64 (%struct._DRIVER_OBJECT*, %struct._UNICODE_STRING*)*, void (%struct._DEVICE_OBJECT*, %struct._IRP*)*, void (%struct._DRIVER_OBJECT*)*, [28 x i64 (%struct._DEVICE_OBJECT*, %struct._IRP*)*] }
%struct._DRIVER_EXTENSION = type { %struct._DRIVER_OBJECT*, i64 (%struct._DRIVER_OBJECT*, %struct._DEVICE_OBJECT*)*, i64, %struct._UNICODE_STRING }
%struct._UNICODE_STRING = type { i16, i16, i16* }

!185 = !DIEnumerator(name: "WormController", value: 16)
!186 = !DIEnumerator(name: "SerialController", value: 17)
!187 = !DIEnumerator(name: "NetworkController", value: 18)
!188 = !DIEnumerator(name: "DisplayController", value: 19)
!189 = !DIEnumerator(name: "ParallelController", value: 20)
!190 = !DIEnumerator(name: "PointerController", value: 21)
!191 = !DIEnumerator(name: "KeyboardController", value: 22)
!192 = !DIEnumerator(name: "AudioController", value: 23)
!193 = !DIEnumerator(name: "OtherController", value: 24)
!194 = !DIEnumerator(name: "DiskPeripheral", value: 25)
!195 = !DIEnumerator(name: "FloppyDiskPeripheral", value: 26)
!196 = !DIEnumerator(name: "TapePeripheral", value: 27)
!197 = !DIEnumerator(name: "ModemPeripheral", value: 28)
!198 = !DIEnumerator(name: "MonitorPeripheral", value: 29)
!199 = !DIEnumerator(name: "PrinterPeripheral", value: 30)
!200 = !DIEnumerator(name: "PointerPeripheral", value: 31)
!201 = !DIEnumerator(name: "KeyboardPeripheral", value: 32)
!202 = !DIEnumerator(name: "TerminalPeripheral", value: 33)
!203 = !DIEnumerator(name: "OtherPeripheral", value: 34)
!204 = !DIEnumerator(name: "LinePeripheral", value: 35)
!205 = !DIEnumerator(name: "NetworkPeripheral", value: 36)
!206 = !DIEnumerator(name: "SystemMemory", value: 37)
!207 = !DIEnumerator(name: "DockingInformation", value: 38)
!208 = !DIEnumerator(name: "RealModeIrqRoutingTable", value: 39)
!209 = !DIEnumerator(name: "MaximumType", value: 40)
!210 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_EVENT_TYPE", file: !1, line: 60, size: 32, align: 32, elements: !211)
!211 = !{!212, !213}
!212 = !DIEnumerator(name: "NotificationEvent", value: 0)
!213 = !DIEnumerator(name: "SynchronizationEvent", value: 1)
!214 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_KWAIT_REASON", file: !1, line: 606, size: 32, align: 32, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243}
!216 = !DIEnumerator(name: "Executive", value: 0)
!217 = !DIEnumerator(name: "FreePage", value: 1)
!218 = !DIEnumerator(name: "PageIn", value: 2)
!219 = !DIEnumerator(name: "PoolAllocation", value: 3)
!220 = !DIEnumerator(name: "DelayExecution", value: 4)
!221 = !DIEnumerator(name: "Suspended", value: 5)
!222 = !DIEnumerator(name: "UserRequest", value: 6)
!223 = !DIEnumerator(name: "WrExecutive", value: 7)
!224 = !DIEnumerator(name: "WrFreePage", value: 8)
!225 = !DIEnumerator(name: "WrPageIn", value: 9)
!226 = !DIEnumerator(name: "WrPoolAllocation", value: 10)
!227 = !DIEnumerator(name: "WrDelayExecution", value: 11)
!228 = !DIEnumerator(name: "WrSuspended", value: 12)
!229 = !DIEnumerator(name: "WrUserRequest", value: 13)
!230 = !DIEnumerator(name: "WrEventPair", value: 14)
!231 = !DIEnumerator(name: "WrQueue", value: 15)
!232 = !DIEnumerator(name: "WrLpcReceive", value: 16)
!233 = !DIEnumerator(name: "WrLpcReply", value: 17)
!234 = !DIEnumerator(name: "WrVirtualMemory", value: 18)
!235 = !DIEnumerator(name: "WrPageOut", value: 19)
!236 = !DIEnumerator(name: "WrRendezvous", value: 20)
!237 = !DIEnumerator(name: "Spare2", value: 21)
!238 = !DIEnumerator(name: "Spare3", value: 22)
!239 = !DIEnumerator(name: "Spare4", value: 23)
!240 = !DIEnumerator(name: "Spare5", value: 24)
!241 = !DIEnumerator(name: "Spare6", value: 25)
!242 = !DIEnumerator(name: "WrKernel", value: 26)
!243 = !DIEnumerator(name: "MaximumWaitReason", value: 27)
!244 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_MEMORY_CACHING_TYPE", file: !1, line: 672, size: 32, align: 32, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252}
!246 = !DIEnumerator(name: "MmNonCached", value: 0)
!247 = !DIEnumerator(name: "MmCached", value: 1)
!248 = !DIEnumerator(name: "MmWriteCombined", value: 2)
!249 = !DIEnumerator(name: "MmHardwareCoherentCached", value: 3)
!250 = !DIEnumerator(name: "MmNonCachedUnordered", value: 4)
!251 = !DIEnumerator(name: "MmUSWCCached", value: 5)
!252 = !DIEnumerator(name: "MmMaximumCacheType", value: 6)
!253 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_MM_PAGE_PRIORITY", file: !1, line: 737, size: 32, align: 32, elements: !254)
!254 = !{!255, !256, !257}
!255 = !DIEnumerator(name: "LowPagePriority", value: 0)
!256 = !DIEnumerator(name: "NormalPagePriority", value: 16)
!257 = !DIEnumerator(name: "HighPagePriority", value: 32)
!258 = !{!259, !260, !261, !287, !286, !277, !1419, !682, !1349, !550, !1421, !627, !1422, !1423, !428, !394, !331, !1425, !1442, !312, !302, !1458}
!259 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DEVICE_EXTENSION", file: !1, line: 1444, size: 2752, align: 64, elements: !263)
!263 = !{!264, !1341, !1342, !1343, !1344, !1346, !1347, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1374}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !262, file: !1, line: 1445, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PDEVICE_OBJECT", file: !1, line: 931, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DEVICE_OBJECT", file: !1, line: 903, size: 2944, align: 64, elements: !268)
!268 = !{!269, !272, !275, !278, !1266, !1267, !1268, !1269, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1316, !1317, !1326, !1328, !1329, !1330, !1331, !1332, !1333, !1340}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !267, file: !1, line: 904, baseType: !270, size: 16, align: 16)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "CSHORT", file: !1, line: 34, baseType: !271)
!271 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !267, file: !1, line: 905, baseType: !273, size: 16, align: 16, offset: 16)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "USHORT", file: !1, line: 27, baseType: !274)
!274 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ReferenceCount", scope: !267, file: !1, line: 906, baseType: !276, size: 64, align: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "LONG", file: !1, line: 19, baseType: !277)
!277 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "DriverObject", scope: !267, file: !1, line: 907, baseType: !279, size: 64, align: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DRIVER_OBJECT", file: !1, line: 944, size: 2688, align: 64, elements: !281)
!281 = !{!282, !283, !284, !285, !288, !290, !291, !292, !315, !316, !319, !1249, !1253, !1254, !1258}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !280, file: !1, line: 945, baseType: !270, size: 16, align: 16)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !280, file: !1, line: 946, baseType: !270, size: 16, align: 16, offset: 16)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !280, file: !1, line: 947, baseType: !265, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !280, file: !1, line: 948, baseType: !286, size: 64, align: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "ULONG", file: !1, line: 28, baseType: !287)
!287 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "DriverStart", scope: !280, file: !1, line: 949, baseType: !289, size: 64, align: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PVOID", file: !1, line: 16, baseType: !260)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "DriverSize", scope: !280, file: !1, line: 950, baseType: !286, size: 64, align: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "DriverSection", scope: !280, file: !1, line: 951, baseType: !289, size: 64, align: 64, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "DriverExtension", scope: !280, file: !1, line: 952, baseType: !293, size: 64, align: 64, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PDRIVER_EXTENSION", file: !1, line: 943, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DRIVER_EXTENSION", file: !1, line: 937, size: 320, align: 64, elements: !296)
!296 = !{!297, !298, !303, !304}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "DriverObject", scope: !295, file: !1, line: 938, baseType: !279, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "AddDevice", scope: !295, file: !1, line: 939, baseType: !299, size: 64, align: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!302, !279, !266}
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "NTSTATUS", file: !1, line: 37, baseType: !276)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !295, file: !1, line: 940, baseType: !286, size: 64, align: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ServiceKeyName", scope: !295, file: !1, line: 941, baseType: !305, size: 128, align: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "UNICODE_STRING", file: !1, line: 79, baseType: !306)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "_UNICODE_STRING", file: !1, line: 74, size: 128, align: 64, elements: !307)
!307 = !{!308, !309, !310}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !306, file: !1, line: 75, baseType: !273, size: 16, align: 16)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumLength", scope: !306, file: !1, line: 76, baseType: !273, size: 16, align: 16, offset: 16)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !306, file: !1, line: 77, baseType: !311, size: 64, align: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWSTR", file: !1, line: 22, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "WCHAR", file: !1, line: 20, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !1, line: 12, baseType: !274)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "DriverName", scope: !280, file: !1, line: 953, baseType: !305, size: 128, align: 64, offset: 448)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "HardwareDatabase", scope: !280, file: !1, line: 954, baseType: !317, size: 64, align: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PUNICODE_STRING", file: !1, line: 80, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoDispatch", scope: !280, file: !1, line: 955, baseType: !320, size: 64, align: 64, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFAST_IO_DISPATCH", file: !1, line: 861, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FAST_IO_DISPATCH", file: !1, line: 792, size: 1792, align: 64, elements: !323)
!323 = !{!324, !325, !440, !444, !445, !458, !471, !478, !482, !486, !490, !494, !498, !499, !503, !517, !566, !583, !587, !588, !592, !598, !599, !600, !601, !1240, !1244, !1248}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfFastIoDispatch", scope: !322, file: !1, line: 793, baseType: !286, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoCheckIfPossible", scope: !322, file: !1, line: 794, baseType: !326, size: 64, align: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!329, !332, !427, !286, !329, !286, !329, !429, !266}
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !1, line: 81, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "UCHAR", file: !1, line: 26, baseType: !331)
!331 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE_OBJECT", file: !1, line: 975, size: 1728, align: 64, elements: !334)
!334 = !{!335, !336, !337, !338, !355, !356, !357, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !396, !397, !398, !399, !419, !420}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !333, file: !1, line: 976, baseType: !270, size: 16, align: 16)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !333, file: !1, line: 977, baseType: !270, size: 16, align: 16, offset: 16)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !333, file: !1, line: 978, baseType: !265, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Vpb", scope: !333, file: !1, line: 979, baseType: !339, size: 64, align: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "PVPB", file: !1, line: 886, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "_VPB", file: !1, line: 875, size: 832, align: 64, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348, !349, !350, !351}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !341, file: !1, line: 876, baseType: !270, size: 16, align: 16)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !341, file: !1, line: 877, baseType: !270, size: 16, align: 16, offset: 16)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !341, file: !1, line: 878, baseType: !273, size: 16, align: 16, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "VolumeLabelLength", scope: !341, file: !1, line: 879, baseType: !273, size: 16, align: 16, offset: 48)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !341, file: !1, line: 880, baseType: !266, size: 64, align: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "RealDevice", scope: !341, file: !1, line: 881, baseType: !266, size: 64, align: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", scope: !341, file: !1, line: 882, baseType: !286, size: 64, align: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ReferenceCount", scope: !341, file: !1, line: 883, baseType: !286, size: 64, align: 64, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "VolumeLabel", scope: !341, file: !1, line: 884, baseType: !352, size: 512, align: 16, offset: 320)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 512, align: 16, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "FsContext", scope: !333, file: !1, line: 980, baseType: !289, size: 64, align: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "FsContext2", scope: !333, file: !1, line: 981, baseType: !289, size: 64, align: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "SectionObjectPointer", scope: !333, file: !1, line: 982, baseType: !358, size: 64, align: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSECTION_OBJECT_POINTERS", file: !1, line: 969, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECTION_OBJECT_POINTERS", file: !1, line: 968, baseType: !361)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SECTION_OBJECT_POINTERS", file: !1, line: 963, size: 192, align: 64, elements: !362)
!362 = !{!363, !364, !365}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "DataSectionObject", scope: !361, file: !1, line: 964, baseType: !289, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "SharedCacheMap", scope: !361, file: !1, line: 965, baseType: !289, size: 64, align: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ImageSectionObject", scope: !361, file: !1, line: 966, baseType: !289, size: 64, align: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateCacheMap", scope: !333, file: !1, line: 983, baseType: !289, size: 64, align: 64, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "FinalStatus", scope: !333, file: !1, line: 984, baseType: !302, size: 64, align: 64, offset: 448)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "RelatedFileObject", scope: !333, file: !1, line: 985, baseType: !332, size: 64, align: 64, offset: 512)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "LockOperation", scope: !333, file: !1, line: 986, baseType: !329, size: 8, align: 8, offset: 576)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "DeletePending", scope: !333, file: !1, line: 987, baseType: !329, size: 8, align: 8, offset: 584)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ReadAccess", scope: !333, file: !1, line: 988, baseType: !329, size: 8, align: 8, offset: 592)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "WriteAccess", scope: !333, file: !1, line: 989, baseType: !329, size: 8, align: 8, offset: 600)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteAccess", scope: !333, file: !1, line: 990, baseType: !329, size: 8, align: 8, offset: 608)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "SharedRead", scope: !333, file: !1, line: 991, baseType: !329, size: 8, align: 8, offset: 616)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "SharedWrite", scope: !333, file: !1, line: 992, baseType: !329, size: 8, align: 8, offset: 624)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "SharedDelete", scope: !333, file: !1, line: 993, baseType: !329, size: 8, align: 8, offset: 632)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !333, file: !1, line: 994, baseType: !286, size: 64, align: 64, offset: 640)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "FileName", scope: !333, file: !1, line: 995, baseType: !305, size: 128, align: 64, offset: 704)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentByteOffset", scope: !333, file: !1, line: 996, baseType: !380, size: 128, align: 64, offset: 832)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "LARGE_INTEGER", file: !1, line: 52, baseType: !381)
!381 = !DICompositeType(tag: DW_TAG_union_type, name: "_LARGE_INTEGER", file: !1, line: 47, size: 128, align: 64, elements: !382)
!382 = !{!383, !388, !393}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField1", scope: !381, file: !1, line: 48, baseType: !384, size: 128, align: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct____missing_field_name_1", file: !1, line: 39, size: 128, align: 64, elements: !385)
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "LowPart", scope: !384, file: !1, line: 40, baseType: !286, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "HighPart", scope: !384, file: !1, line: 41, baseType: !276, size: 64, align: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !381, file: !1, line: 49, baseType: !389, size: 128, align: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_u_2", file: !1, line: 43, size: 128, align: 64, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "LowPart", scope: !389, file: !1, line: 44, baseType: !286, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "HighPart", scope: !389, file: !1, line: 45, baseType: !276, size: 64, align: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "QuadPart", scope: !381, file: !1, line: 50, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "LONGLONG", file: !1, line: 38, baseType: !395)
!395 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Waiters", scope: !333, file: !1, line: 997, baseType: !286, size: 64, align: 64, offset: 960)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Busy", scope: !333, file: !1, line: 998, baseType: !286, size: 64, align: 64, offset: 1024)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "LastLock", scope: !333, file: !1, line: 999, baseType: !289, size: 64, align: 64, offset: 1088)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", scope: !333, file: !1, line: 1000, baseType: !400, size: 256, align: 64, offset: 1152)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "KEVENT", file: !1, line: 663, baseType: !401)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "_KEVENT", file: !1, line: 660, size: 256, align: 64, elements: !402)
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !401, file: !1, line: 661, baseType: !404, size: 256, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "DISPATCHER_HEADER", file: !1, line: 645, baseType: !405)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DISPATCHER_HEADER", file: !1, line: 637, size: 256, align: 64, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !405, file: !1, line: 638, baseType: !330, size: 8, align: 8)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Absolute", scope: !405, file: !1, line: 639, baseType: !330, size: 8, align: 8, offset: 8)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !405, file: !1, line: 640, baseType: !330, size: 8, align: 8, offset: 16)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Inserted", scope: !405, file: !1, line: 641, baseType: !330, size: 8, align: 8, offset: 24)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "SignalState", scope: !405, file: !1, line: 642, baseType: !276, size: 64, align: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "WaitListHead", scope: !405, file: !1, line: 643, baseType: !413, size: 128, align: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIST_ENTRY", file: !1, line: 86, baseType: !414)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LIST_ENTRY", file: !1, line: 82, size: 128, align: 64, elements: !415)
!415 = !{!416, !418}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Flink", scope: !414, file: !1, line: 83, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "Blink", scope: !414, file: !1, line: 84, baseType: !417, size: 64, align: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Event", scope: !333, file: !1, line: 1001, baseType: !400, size: 256, align: 64, offset: 1408)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "CompletionContext", scope: !333, file: !1, line: 1002, baseType: !421, size: 64, align: 64, offset: 1664)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIO_COMPLETION_CONTEXT", file: !1, line: 974, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_COMPLETION_CONTEXT", file: !1, line: 970, size: 128, align: 64, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Port", scope: !423, file: !1, line: 971, baseType: !289, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Key", scope: !423, file: !1, line: 972, baseType: !289, size: 64, align: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PLARGE_INTEGER", file: !1, line: 53, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIO_STATUS_BLOCK", file: !1, line: 224, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_STATUS_BLOCK", file: !1, line: 219, size: 128, align: 64, elements: !432)
!432 = !{!433, !438}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField4", scope: !431, file: !1, line: 220, baseType: !434, size: 64, align: 64)
!434 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_6", file: !1, line: 215, size: 64, align: 64, elements: !435)
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !434, file: !1, line: 216, baseType: !302, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !434, file: !1, line: 217, baseType: !289, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Information", scope: !431, file: !1, line: 221, baseType: !439, size: 64, align: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "ULONG_PTR", file: !1, line: 13, baseType: !287)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoRead", scope: !322, file: !1, line: 798, baseType: !441, size: 64, align: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!329, !332, !427, !286, !329, !286, !289, !429, !266}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoWrite", scope: !322, file: !1, line: 801, baseType: !441, size: 64, align: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoQueryBasicInfo", scope: !322, file: !1, line: 804, baseType: !446, size: 64, align: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!329, !332, !329, !449, !429, !266}
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFILE_BASIC_INFORMATION", file: !1, line: 272, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE_BASIC_INFORMATION", file: !1, line: 265, size: 576, align: 64, elements: !452)
!452 = !{!453, !454, !455, !456, !457}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "CreationTime", scope: !451, file: !1, line: 266, baseType: !380, size: 128, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessTime", scope: !451, file: !1, line: 267, baseType: !380, size: 128, align: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "LastWriteTime", scope: !451, file: !1, line: 268, baseType: !380, size: 128, align: 64, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ChangeTime", scope: !451, file: !1, line: 269, baseType: !380, size: 128, align: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "FileAttributes", scope: !451, file: !1, line: 270, baseType: !286, size: 64, align: 64, offset: 512)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoQueryStandardInfo", scope: !322, file: !1, line: 807, baseType: !459, size: 64, align: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!329, !332, !329, !462, !429, !266}
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFILE_STANDARD_INFORMATION", file: !1, line: 280, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE_STANDARD_INFORMATION", file: !1, line: 273, size: 384, align: 64, elements: !465)
!465 = !{!466, !467, !468, !469, !470}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationSize", scope: !464, file: !1, line: 274, baseType: !380, size: 128, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "EndOfFile", scope: !464, file: !1, line: 275, baseType: !380, size: 128, align: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfLinks", scope: !464, file: !1, line: 276, baseType: !286, size: 64, align: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "DeletePending", scope: !464, file: !1, line: 277, baseType: !329, size: 8, align: 8, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Directory", scope: !464, file: !1, line: 278, baseType: !329, size: 8, align: 8, offset: 328)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoLock", scope: !322, file: !1, line: 810, baseType: !472, size: 64, align: 64, offset: 384)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!329, !332, !427, !427, !475, !286, !329, !329, !429, !266}
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "PEPROCESS", file: !1, line: 113, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "_EPROCESS", file: !1, line: 112, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoUnlockSingle", scope: !322, file: !1, line: 814, baseType: !479, size: 64, align: 64, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!329, !332, !427, !427, !475, !286, !429, !266}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoUnlockAll", scope: !322, file: !1, line: 817, baseType: !483, size: 64, align: 64, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64, align: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!329, !332, !475, !429, !266}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoUnlockAllByKey", scope: !322, file: !1, line: 819, baseType: !487, size: 64, align: 64, offset: 576)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!329, !332, !289, !286, !429, !266}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoDeviceControl", scope: !322, file: !1, line: 821, baseType: !491, size: 64, align: 64, offset: 640)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!329, !332, !329, !289, !286, !289, !286, !286, !429, !266}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "AcquireFileForNtCreateSection", scope: !322, file: !1, line: 825, baseType: !495, size: 64, align: 64, offset: 704)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !332}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ReleaseFileForNtCreateSection", scope: !322, file: !1, line: 826, baseType: !495, size: 64, align: 64, offset: 768)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoDetachDevice", scope: !322, file: !1, line: 827, baseType: !500, size: 64, align: 64, offset: 832)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !266, !266}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoQueryNetworkOpenInfo", scope: !322, file: !1, line: 828, baseType: !504, size: 64, align: 64, offset: 896)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!329, !332, !329, !507, !430, !266}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE_NETWORK_OPEN_INFORMATION", file: !1, line: 281, size: 832, align: 64, elements: !509)
!509 = !{!510, !511, !512, !513, !514, !515, !516}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "CreationTime", scope: !508, file: !1, line: 282, baseType: !380, size: 128, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessTime", scope: !508, file: !1, line: 283, baseType: !380, size: 128, align: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "LastWriteTime", scope: !508, file: !1, line: 284, baseType: !380, size: 128, align: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ChangeTime", scope: !508, file: !1, line: 285, baseType: !380, size: 128, align: 64, offset: 384)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationSize", scope: !508, file: !1, line: 286, baseType: !380, size: 128, align: 64, offset: 512)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "EndOfFile", scope: !508, file: !1, line: 287, baseType: !380, size: 128, align: 64, offset: 640)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "FileAttributes", scope: !508, file: !1, line: 288, baseType: !286, size: 64, align: 64, offset: 768)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "AcquireForModWrite", scope: !322, file: !1, line: 831, baseType: !518, size: 64, align: 64, offset: 960)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!302, !332, !427, !521, !266}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64, align: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ERESOURCE", file: !1, line: 723, size: 896, align: 64, elements: !524)
!524 = !{!525, !526, !538, !540, !541, !548, !551, !556, !557, !558, !559, !564}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "SystemResourcesList", scope: !523, file: !1, line: 724, baseType: !413, size: 128, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "OwnerTable", scope: !523, file: !1, line: 725, baseType: !527, size: 64, align: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWNER_ENTRY", file: !1, line: 718, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "_OWNER_ENTRY", file: !1, line: 713, size: 128, align: 64, elements: !530)
!530 = !{!531, !533}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "OwnerThread", scope: !529, file: !1, line: 714, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "ERESOURCE_THREAD", file: !1, line: 708, baseType: !439)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField10", scope: !529, file: !1, line: 715, baseType: !534, size: 64, align: 64, offset: 64)
!534 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_38", file: !1, line: 709, size: 64, align: 64, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "OwnerCount", scope: !534, file: !1, line: 710, baseType: !276, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "TableSize", scope: !534, file: !1, line: 711, baseType: !286, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ActiveCount", scope: !523, file: !1, line: 726, baseType: !539, size: 16, align: 16, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHORT", file: !1, line: 18, baseType: !271)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Flag", scope: !523, file: !1, line: 727, baseType: !273, size: 16, align: 16, offset: 208)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "SharedWaiters", scope: !523, file: !1, line: 728, baseType: !542, size: 64, align: 64, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKSEMAPHORE", file: !1, line: 670, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "_KSEMAPHORE", file: !1, line: 666, size: 320, align: 64, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !544, file: !1, line: 667, baseType: !404, size: 256, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Limit", scope: !544, file: !1, line: 668, baseType: !276, size: 64, align: 64, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ExclusiveWaiters", scope: !523, file: !1, line: 729, baseType: !549, size: 64, align: 64, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKEVENT", file: !1, line: 664, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "OwnerThreads", scope: !523, file: !1, line: 730, baseType: !552, size: 256, align: 64, offset: 384)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 256, align: 64, elements: !554)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "OWNER_ENTRY", file: !1, line: 717, baseType: !529)
!554 = !{!555}
!555 = !DISubrange(count: 2)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ContentionCount", scope: !523, file: !1, line: 731, baseType: !286, size: 64, align: 64, offset: 640)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfSharedWaiters", scope: !523, file: !1, line: 732, baseType: !273, size: 16, align: 16, offset: 704)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfExclusiveWaiters", scope: !523, file: !1, line: 733, baseType: !273, size: 16, align: 16, offset: 720)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField11", scope: !523, file: !1, line: 734, baseType: !560, size: 64, align: 64, offset: 768)
!560 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_39", file: !1, line: 719, size: 64, align: 64, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Address", scope: !560, file: !1, line: 720, baseType: !289, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "CreatorBackTraceIndex", scope: !560, file: !1, line: 721, baseType: !439, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "SpinLock", scope: !523, file: !1, line: 735, baseType: !565, size: 64, align: 64, offset: 832)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPIN_LOCK", file: !1, line: 201, baseType: !439)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "MdlRead", scope: !322, file: !1, line: 833, baseType: !567, size: 64, align: 64, offset: 1024)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64, align: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!329, !332, !427, !286, !286, !570, !429, !266}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "PMDL", file: !1, line: 167, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64, align: 64)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MDL", file: !1, line: 156, size: 448, align: 64, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !580, !581, !582}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !573, file: !1, line: 157, baseType: !572, size: 64, align: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !573, file: !1, line: 158, baseType: !270, size: 16, align: 16, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "MdlFlags", scope: !573, file: !1, line: 159, baseType: !270, size: 16, align: 16, offset: 80)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Process", scope: !573, file: !1, line: 160, baseType: !476, size: 64, align: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "MappedSystemVa", scope: !573, file: !1, line: 161, baseType: !289, size: 64, align: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "StartVa", scope: !573, file: !1, line: 162, baseType: !289, size: 64, align: 64, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ByteCount", scope: !573, file: !1, line: 163, baseType: !286, size: 64, align: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ByteOffset", scope: !573, file: !1, line: 164, baseType: !286, size: 64, align: 64, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "MdlReadComplete", scope: !322, file: !1, line: 836, baseType: !584, size: 64, align: 64, offset: 1088)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!329, !332, !571, !266}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "PrepareMdlWrite", scope: !322, file: !1, line: 837, baseType: !567, size: 64, align: 64, offset: 1152)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "MdlWriteComplete", scope: !322, file: !1, line: 840, baseType: !589, size: 64, align: 64, offset: 1216)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64, align: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!329, !332, !427, !571, !266}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoReadCompressed", scope: !322, file: !1, line: 842, baseType: !593, size: 64, align: 64, offset: 1280)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!329, !332, !427, !286, !286, !289, !570, !429, !596, !286, !266}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64, align: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "_COMPRESSED_DATA_INFO", file: !1, line: 791, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoWriteCompressed", scope: !322, file: !1, line: 846, baseType: !593, size: 64, align: 64, offset: 1344)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "MdlReadCompleteCompressed", scope: !322, file: !1, line: 850, baseType: !584, size: 64, align: 64, offset: 1408)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "MdlWriteCompleteCompressed", scope: !322, file: !1, line: 852, baseType: !589, size: 64, align: 64, offset: 1472)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoQueryOpen", scope: !322, file: !1, line: 854, baseType: !602, size: 64, align: 64, offset: 1536)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, align: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!329, !605, !1239, !266}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64, align: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IRP", file: !1, line: 1047, size: 1728, align: 64, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !618, !619, !621, !625, !626, !628, !629, !630, !632, !633, !634, !635, !636, !648, !652, !653}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !606, file: !1, line: 1048, baseType: !270, size: 16, align: 16)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !606, file: !1, line: 1049, baseType: !273, size: 16, align: 16, offset: 16)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "MdlAddress", scope: !606, file: !1, line: 1050, baseType: !571, size: 64, align: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !606, file: !1, line: 1051, baseType: !286, size: 64, align: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "AssociatedIrp", scope: !606, file: !1, line: 1052, baseType: !613, size: 64, align: 64, offset: 192)
!613 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_AssociatedIrp_44", file: !1, line: 1005, size: 64, align: 64, elements: !614)
!614 = !{!615, !616, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "MasterIrp", scope: !613, file: !1, line: 1006, baseType: !605, size: 64, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "IrpCount", scope: !613, file: !1, line: 1007, baseType: !276, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "SystemBuffer", scope: !613, file: !1, line: 1008, baseType: !289, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ThreadListEntry", scope: !606, file: !1, line: 1053, baseType: !413, size: 128, align: 64, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "IoStatus", scope: !606, file: !1, line: 1054, baseType: !620, size: 128, align: 64, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "IO_STATUS_BLOCK", file: !1, line: 223, baseType: !431)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "RequestorMode", scope: !606, file: !1, line: 1055, baseType: !622, size: 8, align: 8, offset: 512)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "KPROCESSOR_MODE", file: !1, line: 118, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCHAR", file: !1, line: 33, baseType: !624)
!624 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "PendingReturned", scope: !606, file: !1, line: 1056, baseType: !329, size: 8, align: 8, offset: 520)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "StackCount", scope: !606, file: !1, line: 1057, baseType: !627, size: 8, align: 8, offset: 528)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR", file: !1, line: 17, baseType: !624)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentLocation", scope: !606, file: !1, line: 1058, baseType: !627, size: 8, align: 8, offset: 536)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", scope: !606, file: !1, line: 1059, baseType: !329, size: 8, align: 8, offset: 544)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "CancelIrql", scope: !606, file: !1, line: 1060, baseType: !631, size: 8, align: 8, offset: 552)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "KIRQL", file: !1, line: 107, baseType: !330)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ApcEnvironment", scope: !606, file: !1, line: 1061, baseType: !623, size: 8, align: 8, offset: 560)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationFlags", scope: !606, file: !1, line: 1062, baseType: !330, size: 8, align: 8, offset: 568)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "UserIosb", scope: !606, file: !1, line: 1063, baseType: !429, size: 64, align: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "UserEvent", scope: !606, file: !1, line: 1064, baseType: !549, size: 64, align: 64, offset: 640)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Overlay", scope: !606, file: !1, line: 1065, baseType: !637, size: 128, align: 64, offset: 704)
!637 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_Overlay_45", file: !1, line: 1015, size: 128, align: 64, elements: !638)
!638 = !{!639, !647}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "AsynchronousParameters", scope: !637, file: !1, line: 1016, baseType: !640, size: 128, align: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_AsynchronousParameters_46", file: !1, line: 1010, size: 128, align: 64, elements: !641)
!641 = !{!642, !646}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "UserApcRoutine", scope: !640, file: !1, line: 1011, baseType: !643, size: 64, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64, align: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{null, !289, !429, !286}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "UserApcContext", scope: !640, file: !1, line: 1013, baseType: !289, size: 64, align: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationSize", scope: !637, file: !1, line: 1017, baseType: !380, size: 128, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "CancelRoutine", scope: !606, file: !1, line: 1066, baseType: !649, size: 64, align: 64, offset: 832)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, align: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !266, !605}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "UserBuffer", scope: !606, file: !1, line: 1067, baseType: !289, size: 64, align: 64, offset: 896)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Tail", scope: !606, file: !1, line: 1068, baseType: !654, size: 768, align: 64, offset: 960)
!654 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_Tail_47", file: !1, line: 1042, size: 768, align: 64, elements: !655)
!655 = !{!656, !1205, !1238}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Overlay", scope: !654, file: !1, line: 1043, baseType: !657, size: 640, align: 64)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Overlay_48", file: !1, line: 1035, size: 640, align: 64, elements: !658)
!658 = !{!659, !676, !680, !683, !1204}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField15", scope: !657, file: !1, line: 1036, baseType: !660, size: 256, align: 64)
!660 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_49", file: !1, line: 1022, size: 256, align: 64, elements: !661)
!661 = !{!662, !669}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceQueueEntry", scope: !660, file: !1, line: 1023, baseType: !663, size: 256, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "KDEVICE_QUEUE_ENTRY", file: !1, line: 659, baseType: !664)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "_KDEVICE_QUEUE_ENTRY", file: !1, line: 654, size: 256, align: 64, elements: !665)
!665 = !{!666, !667, !668}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceListEntry", scope: !664, file: !1, line: 655, baseType: !413, size: 128, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "SortKey", scope: !664, file: !1, line: 656, baseType: !286, size: 64, align: 64, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Inserted", scope: !664, file: !1, line: 657, baseType: !329, size: 8, align: 8, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField14", scope: !660, file: !1, line: 1024, baseType: !670, size: 256, align: 64)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct____missing_field_name_50", file: !1, line: 1019, size: 256, align: 64, elements: !671)
!671 = !{!672}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "DriverContext", scope: !670, file: !1, line: 1020, baseType: !673, size: 256, align: 64)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 256, align: 64, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 4)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Thread", scope: !657, file: !1, line: 1037, baseType: !677, size: 64, align: 64, offset: 256)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "PETHREAD", file: !1, line: 111, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64, align: 64)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ETHREAD", file: !1, line: 110, flags: DIFlagFwdDecl)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "AuxiliaryBuffer", scope: !657, file: !1, line: 1038, baseType: !681, size: 64, align: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCHAR", file: !1, line: 24, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField17", scope: !657, file: !1, line: 1039, baseType: !684, size: 192, align: 64, offset: 384)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct____missing_field_name_51", file: !1, line: 1031, size: 192, align: 64, elements: !685)
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ListEntry", scope: !684, file: !1, line: 1032, baseType: !413, size: 128, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField16", scope: !684, file: !1, line: 1033, baseType: !688, size: 64, align: 64, offset: 128)
!688 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_52", file: !1, line: 1027, size: 64, align: 64, elements: !689)
!689 = !{!690, !1203}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentStackLocation", scope: !688, file: !1, line: 1028, baseType: !691, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64, align: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_STACK_LOCATION", file: !1, line: 1305, size: 544, align: 32, elements: !693)
!693 = !{!694, !695, !696, !697, !698, !1195, !1196, !1197, !1202}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "MajorFunction", scope: !692, file: !1, line: 1306, baseType: !330, size: 8, align: 8)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "MinorFunction", scope: !692, file: !1, line: 1307, baseType: !330, size: 8, align: 8, offset: 8)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !692, file: !1, line: 1308, baseType: !330, size: 8, align: 8, offset: 16)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !692, file: !1, line: 1309, baseType: !330, size: 8, align: 8, offset: 24)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Parameters", scope: !692, file: !1, line: 1310, baseType: !699, size: 256, align: 32, offset: 32)
!699 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_Parameters_55", file: !1, line: 1276, size: 256, align: 32, elements: !700)
!700 = !{!701, !789, !795, !801, !807, !825, !831, !838, !844, !849, !854, !859, !865, !870, !902, !943, !1043, !1050, !1054, !1059, !1066, !1074, !1078, !1089, !1103, !1181, !1188}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Create", scope: !699, file: !1, line: 1277, baseType: !702, size: 224, align: 32)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Create_56", file: !1, line: 1146, size: 224, align: 32, elements: !703)
!703 = !{!704, !785, !786, !787, !788}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityContext", scope: !702, file: !1, line: 1147, baseType: !705, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIO_SECURITY_CONTEXT", file: !1, line: 874, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64, align: 64)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_SECURITY_CONTEXT", file: !1, line: 868, size: 256, align: 64, elements: !708)
!708 = !{!709, !720, !783, !784}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityQos", scope: !707, file: !1, line: 869, baseType: !710, size: 64, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSECURITY_QUALITY_OF_SERVICE", file: !1, line: 198, baseType: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64, align: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SECURITY_QUALITY_OF_SERVICE", file: !1, line: 192, size: 128, align: 64, elements: !713)
!713 = !{!714, !715, !717, !719}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !712, file: !1, line: 193, baseType: !286, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ImpersonationLevel", scope: !712, file: !1, line: 194, baseType: !716, size: 32, align: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECURITY_IMPERSONATION_LEVEL", file: !1, line: 190, baseType: !3)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ContextTrackingMode", scope: !712, file: !1, line: 195, baseType: !718, size: 8, align: 8, offset: 96)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECURITY_CONTEXT_TRACKING_MODE", file: !1, line: 191, baseType: !329)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "EffectiveOnly", scope: !712, file: !1, line: 196, baseType: !329, size: 8, align: 8, offset: 104)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "AccessState", scope: !707, file: !1, line: 870, baseType: !721, size: 64, align: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "PACCESS_STATE", file: !1, line: 780, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ACCESS_STATE", file: !1, line: 762, size: 1856, align: 64, elements: !724)
!724 = !{!725, !731, !732, !733, !734, !735, !736, !738, !739, !740, !749, !751, !752, !780, !781, !782}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "OperationID", scope: !723, file: !1, line: 763, baseType: !726, size: 128, align: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "LUID", file: !1, line: 58, baseType: !727)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LUID", file: !1, line: 54, size: 128, align: 64, elements: !728)
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "LowPart", scope: !727, file: !1, line: 55, baseType: !286, size: 64, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "HighPart", scope: !727, file: !1, line: 56, baseType: !276, size: 64, align: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityEvaluated", scope: !723, file: !1, line: 764, baseType: !329, size: 8, align: 8, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "GenerateAudit", scope: !723, file: !1, line: 765, baseType: !329, size: 8, align: 8, offset: 136)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "GenerateOnClose", scope: !723, file: !1, line: 766, baseType: !329, size: 8, align: 8, offset: 144)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "PrivilegesAllocated", scope: !723, file: !1, line: 767, baseType: !329, size: 8, align: 8, offset: 152)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !723, file: !1, line: 768, baseType: !286, size: 64, align: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "RemainingDesiredAccess", scope: !723, file: !1, line: 769, baseType: !737, size: 64, align: 64, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "ACCESS_MASK", file: !1, line: 170, baseType: !286)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "PreviouslyGrantedAccess", scope: !723, file: !1, line: 770, baseType: !737, size: 64, align: 64, offset: 320)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "OriginalDesiredAccess", scope: !723, file: !1, line: 771, baseType: !737, size: 64, align: 64, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectSecurityContext", scope: !723, file: !1, line: 772, baseType: !741, size: 256, align: 64, offset: 448)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECURITY_SUBJECT_CONTEXT", file: !1, line: 751, baseType: !742)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SECURITY_SUBJECT_CONTEXT", file: !1, line: 745, size: 256, align: 64, elements: !743)
!743 = !{!744, !746, !747, !748}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ClientToken", scope: !742, file: !1, line: 746, baseType: !745, size: 64, align: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "PACCESS_TOKEN", file: !1, line: 168, baseType: !289)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ImpersonationLevel", scope: !742, file: !1, line: 747, baseType: !716, size: 32, align: 32, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "PrimaryToken", scope: !742, file: !1, line: 748, baseType: !745, size: 64, align: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessAuditId", scope: !742, file: !1, line: 749, baseType: !289, size: 64, align: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityDescriptor", scope: !723, file: !1, line: 773, baseType: !750, size: 64, align: 64, offset: 704)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSECURITY_DESCRIPTOR", file: !1, line: 169, baseType: !289)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "AuxData", scope: !723, file: !1, line: 774, baseType: !289, size: 64, align: 64, offset: 768)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Privileges", scope: !723, file: !1, line: 775, baseType: !753, size: 704, align: 64, offset: 832)
!753 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_Privileges_40", file: !1, line: 758, size: 704, align: 64, elements: !754)
!754 = !{!755, !770}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "InitialPrivilegeSet", scope: !753, file: !1, line: 759, baseType: !756, size: 704, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "INITIAL_PRIVILEGE_SET", file: !1, line: 757, baseType: !757)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "_INITIAL_PRIVILEGE_SET", file: !1, line: 752, size: 704, align: 64, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "PrivilegeCount", scope: !757, file: !1, line: 753, baseType: !286, size: 64, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !757, file: !1, line: 754, baseType: !286, size: 64, align: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Privilege", scope: !757, file: !1, line: 755, baseType: !762, size: 576, align: 32, offset: 128)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 576, align: 32, elements: !768)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "LUID_AND_ATTRIBUTES", file: !1, line: 176, baseType: !764)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LUID_AND_ATTRIBUTES", file: !1, line: 172, size: 192, align: 32, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Luid", scope: !764, file: !1, line: 173, baseType: !726, size: 128, align: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !764, file: !1, line: 174, baseType: !286, size: 64, align: 64, offset: 128)
!768 = !{!769}
!769 = !DISubrange(count: 3)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "PrivilegeSet", scope: !753, file: !1, line: 760, baseType: !771, size: 320, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "PRIVILEGE_SET", file: !1, line: 183, baseType: !772)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PRIVILEGE_SET", file: !1, line: 178, size: 320, align: 64, elements: !773)
!773 = !{!774, !775, !776}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "PrivilegeCount", scope: !772, file: !1, line: 179, baseType: !286, size: 64, align: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !772, file: !1, line: 180, baseType: !286, size: 64, align: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Privilege", scope: !772, file: !1, line: 181, baseType: !777, size: 192, align: 32, offset: 128)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 192, align: 32, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 1)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "AuditPrivileges", scope: !723, file: !1, line: 776, baseType: !329, size: 8, align: 8, offset: 1536)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ObjectName", scope: !723, file: !1, line: 777, baseType: !305, size: 128, align: 64, offset: 1600)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ObjectTypeName", scope: !723, file: !1, line: 778, baseType: !305, size: 128, align: 64, offset: 1728)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "DesiredAccess", scope: !707, file: !1, line: 871, baseType: !737, size: 64, align: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "FullCreateOptions", scope: !707, file: !1, line: 872, baseType: !286, size: 64, align: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Options", scope: !702, file: !1, line: 1148, baseType: !286, size: 64, align: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "FileAttributes", scope: !702, file: !1, line: 1149, baseType: !273, size: 16, align: 16, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ShareAccess", scope: !702, file: !1, line: 1150, baseType: !273, size: 16, align: 16, offset: 144)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "EaLength", scope: !702, file: !1, line: 1151, baseType: !286, size: 64, align: 64, offset: 160)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "Read", scope: !699, file: !1, line: 1278, baseType: !790, size: 256, align: 32)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Read_57", file: !1, line: 1153, size: 256, align: 32, elements: !791)
!791 = !{!792, !793, !794}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !790, file: !1, line: 1154, baseType: !286, size: 64, align: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Key", scope: !790, file: !1, line: 1155, baseType: !286, size: 64, align: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ByteOffset", scope: !790, file: !1, line: 1156, baseType: !380, size: 128, align: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "Write", scope: !699, file: !1, line: 1279, baseType: !796, size: 256, align: 32)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Write_58", file: !1, line: 1158, size: 256, align: 32, elements: !797)
!797 = !{!798, !799, !800}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !796, file: !1, line: 1159, baseType: !286, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "Key", scope: !796, file: !1, line: 1160, baseType: !286, size: 64, align: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ByteOffset", scope: !796, file: !1, line: 1161, baseType: !380, size: 128, align: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "QueryFile", scope: !699, file: !1, line: 1280, baseType: !802, size: 96, align: 32)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryFile_59", file: !1, line: 1163, size: 96, align: 32, elements: !803)
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !802, file: !1, line: 1164, baseType: !286, size: 64, align: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "FileInformationClass", scope: !802, file: !1, line: 1165, baseType: !806, size: 32, align: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE_INFORMATION_CLASS", file: !1, line: 264, baseType: !9)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "SetFile", scope: !699, file: !1, line: 1281, baseType: !808, size: 224, align: 32)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_SetFile_60", file: !1, line: 1176, size: 224, align: 32, elements: !809)
!809 = !{!810, !811, !812, !814}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !808, file: !1, line: 1177, baseType: !286, size: 64, align: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "FileInformationClass", scope: !808, file: !1, line: 1178, baseType: !806, size: 32, align: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "FileObject", scope: !808, file: !1, line: 1179, baseType: !813, size: 64, align: 64, offset: 96)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFILE_OBJECT", file: !1, line: 1004, baseType: !332)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField19", scope: !808, file: !1, line: 1180, baseType: !815, size: 64, align: 32, offset: 160)
!815 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_61", file: !1, line: 1171, size: 64, align: 32, elements: !816)
!816 = !{!817, !822, !823}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField18", scope: !815, file: !1, line: 1172, baseType: !818, size: 16, align: 8)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct____missing_field_name_62", file: !1, line: 1167, size: 16, align: 8, elements: !819)
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ReplaceIfExists", scope: !818, file: !1, line: 1168, baseType: !329, size: 8, align: 8)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "AdvanceOnly", scope: !818, file: !1, line: 1169, baseType: !329, size: 8, align: 8, offset: 8)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !815, file: !1, line: 1173, baseType: !286, size: 64, align: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteHandle", scope: !815, file: !1, line: 1174, baseType: !824, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "HANDLE", file: !1, line: 31, baseType: !260)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "QueryVolume", scope: !699, file: !1, line: 1282, baseType: !826, size: 96, align: 32)
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryVolume_63", file: !1, line: 1182, size: 96, align: 32, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !826, file: !1, line: 1183, baseType: !286, size: 64, align: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "FsInformationClass", scope: !826, file: !1, line: 1184, baseType: !830, size: 32, align: 32, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "FS_INFORMATION_CLASS", file: !1, line: 302, baseType: !48)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceIoControl", scope: !699, file: !1, line: 1283, baseType: !832, size: 256, align: 32)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_DeviceIoControl_64", file: !1, line: 1186, size: 256, align: 32, elements: !833)
!833 = !{!834, !835, !836, !837}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "OutputBufferLength", scope: !832, file: !1, line: 1187, baseType: !286, size: 64, align: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "InputBufferLength", scope: !832, file: !1, line: 1188, baseType: !286, size: 64, align: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "IoControlCode", scope: !832, file: !1, line: 1189, baseType: !286, size: 64, align: 64, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "Type3InputBuffer", scope: !832, file: !1, line: 1190, baseType: !289, size: 64, align: 64, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "QuerySecurity", scope: !699, file: !1, line: 1284, baseType: !839, size: 128, align: 32)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QuerySecurity_65", file: !1, line: 1192, size: 128, align: 32, elements: !840)
!840 = !{!841, !843}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityInformation", scope: !839, file: !1, line: 1193, baseType: !842, size: 64, align: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECURITY_INFORMATION", file: !1, line: 199, baseType: !286)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !839, file: !1, line: 1194, baseType: !286, size: 64, align: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "SetSecurity", scope: !699, file: !1, line: 1285, baseType: !845, size: 128, align: 32)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_SetSecurity_66", file: !1, line: 1196, size: 128, align: 32, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityInformation", scope: !845, file: !1, line: 1197, baseType: !842, size: 64, align: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityDescriptor", scope: !845, file: !1, line: 1198, baseType: !750, size: 64, align: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "MountVolume", scope: !699, file: !1, line: 1286, baseType: !850, size: 128, align: 32)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_MountVolume_67", file: !1, line: 1200, size: 128, align: 32, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "Vpb", scope: !850, file: !1, line: 1201, baseType: !339, size: 64, align: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !850, file: !1, line: 1202, baseType: !265, size: 64, align: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "VerifyVolume", scope: !699, file: !1, line: 1287, baseType: !855, size: 128, align: 32)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_VerifyVolume_68", file: !1, line: 1204, size: 128, align: 32, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "Vpb", scope: !855, file: !1, line: 1205, baseType: !339, size: 64, align: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !855, file: !1, line: 1206, baseType: !265, size: 64, align: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "Scsi", scope: !699, file: !1, line: 1288, baseType: !860, size: 64, align: 32)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Scsi_69", file: !1, line: 1208, size: 64, align: 32, elements: !861)
!861 = !{!862}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "Srb", scope: !860, file: !1, line: 1209, baseType: !863, size: 64, align: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64, align: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SCSI_REQUEST_BLOCK", file: !1, line: 788, flags: DIFlagFwdDecl)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "QueryDeviceRelations", scope: !699, file: !1, line: 1289, baseType: !866, size: 32, align: 32)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryDeviceRelations_70", file: !1, line: 1211, size: 32, align: 32, elements: !867)
!867 = !{!868}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !866, file: !1, line: 1212, baseType: !869, size: 32, align: 32)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEVICE_RELATION_TYPE", file: !1, line: 1079, baseType: !59)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "QueryInterface", scope: !699, file: !1, line: 1290, baseType: !871, size: 224, align: 32)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryInterface_71", file: !1, line: 1214, size: 224, align: 32, elements: !872)
!872 = !{!873, !886, !887, !888, !901}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceType", scope: !871, file: !1, line: 1215, baseType: !874, size: 64, align: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64, align: 64)
!875 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !1, line: 104, baseType: !877)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GUID", file: !1, line: 98, size: 192, align: 64, elements: !878)
!878 = !{!879, !880, !881, !882}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !877, file: !1, line: 99, baseType: !287, size: 64, align: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !877, file: !1, line: 100, baseType: !274, size: 16, align: 16, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !877, file: !1, line: 101, baseType: !274, size: 16, align: 16, offset: 80)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !877, file: !1, line: 102, baseType: !883, size: 64, align: 8, offset: 96)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 64, align: 8, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 8)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !871, file: !1, line: 1216, baseType: !273, size: 16, align: 16, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !871, file: !1, line: 1217, baseType: !273, size: 16, align: 16, offset: 80)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "Interface", scope: !871, file: !1, line: 1218, baseType: !889, size: 64, align: 64, offset: 96)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "PINTERFACE", file: !1, line: 1094, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64, align: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "_INTERFACE", file: !1, line: 1087, size: 256, align: 64, elements: !892)
!892 = !{!893, !894, !895, !896, !900}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !891, file: !1, line: 1088, baseType: !273, size: 16, align: 16)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !891, file: !1, line: 1089, baseType: !273, size: 16, align: 16, offset: 16)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "Context", scope: !891, file: !1, line: 1090, baseType: !289, size: 64, align: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceReference", scope: !891, file: !1, line: 1091, baseType: !897, size: 64, align: 64, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64, align: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{null, !289}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceDereference", scope: !891, file: !1, line: 1092, baseType: !897, size: 64, align: 64, offset: 192)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceSpecificData", scope: !871, file: !1, line: 1219, baseType: !289, size: 64, align: 64, offset: 160)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceCapabilities", scope: !699, file: !1, line: 1291, baseType: !903, size: 64, align: 32)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_DeviceCapabilities_72", file: !1, line: 1221, size: 64, align: 32, elements: !904)
!904 = !{!905}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "Capabilities", scope: !903, file: !1, line: 1222, baseType: !906, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "PDEVICE_CAPABILITIES", file: !1, line: 1125, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DEVICE_CAPABILITIES", file: !1, line: 1095, size: 704, align: 64, elements: !909)
!909 = !{!910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !937, !939, !940, !941, !942}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !908, file: !1, line: 1096, baseType: !273, size: 16, align: 16)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !908, file: !1, line: 1097, baseType: !273, size: 16, align: 16, offset: 16)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceD1", scope: !908, file: !1, line: 1098, baseType: !286, size: 1, align: 64, offset: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceD2", scope: !908, file: !1, line: 1099, baseType: !286, size: 1, align: 64, offset: 33)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "LockSupported", scope: !908, file: !1, line: 1100, baseType: !286, size: 1, align: 64, offset: 34)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "EjectSupported", scope: !908, file: !1, line: 1101, baseType: !286, size: 1, align: 64, offset: 35)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "Removable", scope: !908, file: !1, line: 1102, baseType: !286, size: 1, align: 64, offset: 36)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "DockDevice", scope: !908, file: !1, line: 1103, baseType: !286, size: 1, align: 64, offset: 37)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "UniqueID", scope: !908, file: !1, line: 1104, baseType: !286, size: 1, align: 64, offset: 38)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "SilentInstall", scope: !908, file: !1, line: 1105, baseType: !286, size: 1, align: 64, offset: 39)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "RawDeviceOK", scope: !908, file: !1, line: 1106, baseType: !286, size: 1, align: 64, offset: 40)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "SurpriseRemovalOK", scope: !908, file: !1, line: 1107, baseType: !286, size: 1, align: 64, offset: 41)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "WakeFromD0", scope: !908, file: !1, line: 1108, baseType: !286, size: 1, align: 64, offset: 42)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "WakeFromD1", scope: !908, file: !1, line: 1109, baseType: !286, size: 1, align: 64, offset: 43)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "WakeFromD2", scope: !908, file: !1, line: 1110, baseType: !286, size: 1, align: 64, offset: 44)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "WakeFromD3", scope: !908, file: !1, line: 1111, baseType: !286, size: 1, align: 64, offset: 45)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "HardwareDisabled", scope: !908, file: !1, line: 1112, baseType: !286, size: 1, align: 64, offset: 46)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "NonDynamic", scope: !908, file: !1, line: 1113, baseType: !286, size: 1, align: 64, offset: 47)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "WarmEjectSupported", scope: !908, file: !1, line: 1114, baseType: !286, size: 1, align: 64, offset: 48)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !908, file: !1, line: 1115, baseType: !286, size: 15, align: 64, offset: 49)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "Address", scope: !908, file: !1, line: 1116, baseType: !286, size: 64, align: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "UINumber", scope: !908, file: !1, line: 1117, baseType: !286, size: 64, align: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceState", scope: !908, file: !1, line: 1118, baseType: !933, size: 224, align: 32, offset: 192)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 224, align: 32, elements: !935)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEVICE_POWER_STATE", file: !1, line: 387, baseType: !66)
!935 = !{!936}
!936 = !DISubrange(count: 7)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "SystemWake", scope: !908, file: !1, line: 1119, baseType: !938, size: 32, align: 32, offset: 416)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSTEM_POWER_STATE", file: !1, line: 367, baseType: !74)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceWake", scope: !908, file: !1, line: 1120, baseType: !934, size: 32, align: 32, offset: 448)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "D1Latency", scope: !908, file: !1, line: 1121, baseType: !286, size: 64, align: 64, offset: 512)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "D2Latency", scope: !908, file: !1, line: 1122, baseType: !286, size: 64, align: 64, offset: 576)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "D3Latency", scope: !908, file: !1, line: 1123, baseType: !286, size: 64, align: 64, offset: 640)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "FilterResourceRequirements", scope: !699, file: !1, line: 1292, baseType: !944, size: 64, align: 32)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_FilterResourceRequirements_73", file: !1, line: 1224, size: 64, align: 32, elements: !945)
!945 = !{!946}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "IoResourceRequirementList", scope: !944, file: !1, line: 1225, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIO_RESOURCE_REQUIREMENTS_LIST", file: !1, line: 560, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_RESOURCE_REQUIREMENTS_LIST", file: !1, line: 551, size: 1088, align: 64, elements: !950)
!950 = !{!951, !952, !954, !955, !956, !958, !959}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ListSize", scope: !949, file: !1, line: 552, baseType: !286, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceType", scope: !949, file: !1, line: 553, baseType: !953, size: 32, align: 32, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERFACE_TYPE", file: !1, line: 323, baseType: !84)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "BusNumber", scope: !949, file: !1, line: 554, baseType: !286, size: 64, align: 64, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "SlotNumber", scope: !949, file: !1, line: 555, baseType: !286, size: 64, align: 64, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !949, file: !1, line: 556, baseType: !957, size: 192, align: 64, offset: 256)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 192, align: 64, elements: !768)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "AlternativeLists", scope: !949, file: !1, line: 557, baseType: !286, size: 64, align: 64, offset: 448)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "List", scope: !949, file: !1, line: 558, baseType: !960, size: 576, align: 64, offset: 512)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 576, align: 64, elements: !778)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "IO_RESOURCE_LIST", file: !1, line: 550, baseType: !962)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_RESOURCE_LIST", file: !1, line: 544, size: 576, align: 64, elements: !963)
!963 = !{!964, !965, !966, !967}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !962, file: !1, line: 545, baseType: !273, size: 16, align: 16)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !962, file: !1, line: 546, baseType: !273, size: 16, align: 16, offset: 16)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !962, file: !1, line: 547, baseType: !286, size: 64, align: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptors", scope: !962, file: !1, line: 548, baseType: !968, size: 448, align: 64, offset: 128)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !969, size: 448, align: 64, elements: !778)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "IO_RESOURCE_DESCRIPTOR", file: !1, line: 543, baseType: !970)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_RESOURCE_DESCRIPTOR", file: !1, line: 534, size: 448, align: 64, elements: !971)
!971 = !{!972, !973, !974, !975, !976, !977, !978}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "Option", scope: !970, file: !1, line: 535, baseType: !330, size: 8, align: 8)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !970, file: !1, line: 536, baseType: !330, size: 8, align: 8, offset: 8)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ShareDisposition", scope: !970, file: !1, line: 537, baseType: !330, size: 8, align: 8, offset: 16)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "Spare1", scope: !970, file: !1, line: 538, baseType: !330, size: 8, align: 8, offset: 24)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !970, file: !1, line: 539, baseType: !273, size: 16, align: 16, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "Spare2", scope: !970, file: !1, line: 540, baseType: !273, size: 16, align: 16, offset: 48)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !970, file: !1, line: 541, baseType: !979, size: 384, align: 64, offset: 64)
!979 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_u_24", file: !1, line: 522, size: 384, align: 64, elements: !980)
!980 = !{!981, !989, !996, !1001, !1006, !1013, !1017, !1024, !1029, !1037}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "Port", scope: !979, file: !1, line: 523, baseType: !982, size: 384, align: 64)
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Port_25", file: !1, line: 473, size: 384, align: 64, elements: !983)
!983 = !{!984, !985, !986, !988}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !982, file: !1, line: 474, baseType: !286, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "Alignment", scope: !982, file: !1, line: 475, baseType: !286, size: 64, align: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumAddress", scope: !982, file: !1, line: 476, baseType: !987, size: 128, align: 64, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "PHYSICAL_ADDRESS", file: !1, line: 59, baseType: !380)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumAddress", scope: !982, file: !1, line: 477, baseType: !987, size: 128, align: 64, offset: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "Memory", scope: !979, file: !1, line: 524, baseType: !990, size: 384, align: 64)
!990 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Memory_26", file: !1, line: 479, size: 384, align: 64, elements: !991)
!991 = !{!992, !993, !994, !995}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !990, file: !1, line: 480, baseType: !286, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "Alignment", scope: !990, file: !1, line: 481, baseType: !286, size: 64, align: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumAddress", scope: !990, file: !1, line: 482, baseType: !987, size: 128, align: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumAddress", scope: !990, file: !1, line: 483, baseType: !987, size: 128, align: 64, offset: 256)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "Interrupt", scope: !979, file: !1, line: 525, baseType: !997, size: 128, align: 64)
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Interrupt_27", file: !1, line: 485, size: 128, align: 64, elements: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumVector", scope: !997, file: !1, line: 486, baseType: !286, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumVector", scope: !997, file: !1, line: 487, baseType: !286, size: 64, align: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "Dma", scope: !979, file: !1, line: 526, baseType: !1002, size: 128, align: 64)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Dma_28", file: !1, line: 489, size: 128, align: 64, elements: !1003)
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumChannel", scope: !1002, file: !1, line: 490, baseType: !286, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumChannel", scope: !1002, file: !1, line: 491, baseType: !286, size: 64, align: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "Generic", scope: !979, file: !1, line: 527, baseType: !1007, size: 384, align: 64)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Generic_29", file: !1, line: 493, size: 384, align: 64, elements: !1008)
!1008 = !{!1009, !1010, !1011, !1012}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !1007, file: !1, line: 494, baseType: !286, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "Alignment", scope: !1007, file: !1, line: 495, baseType: !286, size: 64, align: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumAddress", scope: !1007, file: !1, line: 496, baseType: !987, size: 128, align: 64, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumAddress", scope: !1007, file: !1, line: 497, baseType: !987, size: 128, align: 64, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "DevicePrivate", scope: !979, file: !1, line: 528, baseType: !1014, size: 192, align: 64)
!1014 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_DevicePrivate_30", file: !1, line: 499, size: 192, align: 64, elements: !1015)
!1015 = !{!1016}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !1014, file: !1, line: 500, baseType: !957, size: 192, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "BusNumber", scope: !979, file: !1, line: 529, baseType: !1018, size: 256, align: 64)
!1018 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_BusNumber_31", file: !1, line: 502, size: 256, align: 64, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !1018, file: !1, line: 503, baseType: !286, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "MinBusNumber", scope: !1018, file: !1, line: 504, baseType: !286, size: 64, align: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "MaxBusNumber", scope: !1018, file: !1, line: 505, baseType: !286, size: 64, align: 64, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !1018, file: !1, line: 506, baseType: !286, size: 64, align: 64, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "AssignedResource", scope: !979, file: !1, line: 530, baseType: !1025, size: 64, align: 64)
!1025 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_AssignedResource_32", file: !1, line: 508, size: 64, align: 64, elements: !1026)
!1026 = !{!1027}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "AssignedResource", scope: !1025, file: !1, line: 509, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "PASSIGNED_RESOURCE", file: !1, line: 398, baseType: !289)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "SubAllocateFrom", scope: !979, file: !1, line: 531, baseType: !1030, size: 256, align: 64)
!1030 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_SubAllocateFrom_33", file: !1, line: 511, size: 256, align: 64, elements: !1031)
!1031 = !{!1032, !1033, !1035, !1036}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !1030, file: !1, line: 512, baseType: !330, size: 8, align: 8)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !1030, file: !1, line: 513, baseType: !1034, size: 24, align: 8, offset: 8)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 24, align: 8, elements: !768)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "AssignedResource", scope: !1030, file: !1, line: 514, baseType: !1028, size: 64, align: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "Transformation", scope: !1030, file: !1, line: 515, baseType: !987, size: 128, align: 64, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigData", scope: !979, file: !1, line: 532, baseType: !1038, size: 192, align: 64)
!1038 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_ConfigData_34", file: !1, line: 517, size: 192, align: 64, elements: !1039)
!1039 = !{!1040, !1041, !1042}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "Priority", scope: !1038, file: !1, line: 518, baseType: !286, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !1038, file: !1, line: 519, baseType: !286, size: 64, align: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !1038, file: !1, line: 520, baseType: !286, size: 64, align: 64, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ReadWriteConfig", scope: !699, file: !1, line: 1293, baseType: !1044, size: 256, align: 32)
!1044 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_ReadWriteConfig_74", file: !1, line: 1227, size: 256, align: 32, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1049}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "WhichSpace", scope: !1044, file: !1, line: 1228, baseType: !286, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !1044, file: !1, line: 1229, baseType: !289, size: 64, align: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !1044, file: !1, line: 1230, baseType: !286, size: 64, align: 64, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !1044, file: !1, line: 1231, baseType: !286, size: 64, align: 64, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "SetLock", scope: !699, file: !1, line: 1294, baseType: !1051, size: 8, align: 8)
!1051 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_SetLock_75", file: !1, line: 1233, size: 8, align: 8, elements: !1052)
!1052 = !{!1053}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", scope: !1051, file: !1, line: 1234, baseType: !329, size: 8, align: 8)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "QueryId", scope: !699, file: !1, line: 1295, baseType: !1055, size: 32, align: 32)
!1055 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryId_76", file: !1, line: 1236, size: 32, align: 32, elements: !1056)
!1056 = !{!1057}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "IdType", scope: !1055, file: !1, line: 1237, baseType: !1058, size: 32, align: 32)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUS_QUERY_ID_TYPE", file: !1, line: 1139, baseType: !104)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "QueryDeviceText", scope: !699, file: !1, line: 1296, baseType: !1060, size: 96, align: 32)
!1060 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryDeviceText_77", file: !1, line: 1239, size: 96, align: 32, elements: !1061)
!1061 = !{!1062, !1064}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceTextType", scope: !1060, file: !1, line: 1240, baseType: !1063, size: 32, align: 32)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEVICE_TEXT_TYPE", file: !1, line: 1144, baseType: !111)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "LocaleId", scope: !1060, file: !1, line: 1241, baseType: !1065, size: 64, align: 64, offset: 32)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "LCID", file: !1, line: 36, baseType: !286)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "UsageNotification", scope: !699, file: !1, line: 1297, baseType: !1067, size: 64, align: 32)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_UsageNotification_78", file: !1, line: 1243, size: 64, align: 32, elements: !1068)
!1068 = !{!1069, !1070, !1072}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "InPath", scope: !1067, file: !1, line: 1244, baseType: !329, size: 8, align: 8)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !1067, file: !1, line: 1245, baseType: !1071, size: 24, align: 8, offset: 8)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 24, align: 8, elements: !768)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !1067, file: !1, line: 1246, baseType: !1073, size: 32, align: 32, offset: 32)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEVICE_USAGE_NOTIFICATION_TYPE", file: !1, line: 1086, baseType: !115)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "WaitWake", scope: !699, file: !1, line: 1298, baseType: !1075, size: 32, align: 32)
!1075 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_WaitWake_79", file: !1, line: 1248, size: 32, align: 32, elements: !1076)
!1076 = !{!1077}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "PowerState", scope: !1075, file: !1, line: 1249, baseType: !938, size: 32, align: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "PowerSequence", scope: !699, file: !1, line: 1299, baseType: !1079, size: 64, align: 32)
