; ModuleID = '<stdin>'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct._GUID = type { i64, i16, i16, [8 x i8] }
%struct._DRIVE_MEDIA_LIMITS = type { i32, i32 }
%struct._DRIVE_MEDIA_LIMITS_NEC98 = type { i32, i32 }
%struct._DRIVE_MEDIA_CONSTANTS = type { i32, i8, i8, i8, i8, i16, i8, i8, i8, i8, i8, i16, i16, i8, i8, i8, i8, i8, i8, i8 }
%struct._DEVICE_OBJECT = type { i16, i16, i64, %struct._DRIVER_OBJECT*, %struct._DEVICE_OBJECT*, %struct._DEVICE_OBJECT*, %struct._IRP*, %struct._IO_TIMER*, i64, i64, %struct._VPB*, i8*, i64, i8, %union.__anonunion_Queue_43, i64, %struct._KDEVICE_QUEUE, %struct._KDPC, i64, i8*, %struct._KEVENT, i16, i16, %struct._DEVOBJ_EXTENSION*, i8* }
%struct._DRIVER_OBJECT = type { i16, i16, %struct._DEVICE_OBJECT*, i64, i8*, i64, i8*, %struct._DRIVER_EXTENSION*, %struct._UNICODE_STRING, %struct._UNICODE_STRING*, %struct._FAST_IO_DISPATCH*, i64 (%struct._DRIVER_OBJECT*, %struct._UNICODE_STRING*)*, void (%struct._DEVICE_OBJECT*, %struct._IRP*)*, void (%struct._DRIVER_OBJECT*)*, [28 x i64 (%struct._DEVICE_OBJECT*, %struct._IRP*)*] }
%struct._DRIVER_EXTENSION = type { %struct._DRIVER_OBJECT*, i64 (%struct._DRIVER_OBJECT*, %struct._DEVICE_OBJECT*)*, i64, %struct._UNICODE_STRING }
%struct._UNICODE_STRING = type { i16, i16, i16* }

!260 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ACPI_FDI_DEVICE_TYPE", file: !1, line: 1490, size: 32, align: 32, elements: !261)
!261 = !{!262, !263, !264, !265, !266, !267}
!262 = !DIEnumerator(name: "CmosProblem", value: 0)
!263 = !DIEnumerator(name: "Form525Capacity360", value: 1)
!264 = !DIEnumerator(name: "Form525Capacity1200", value: 2)
!265 = !DIEnumerator(name: "Form35Capacity720", value: 3)
!266 = !DIEnumerator(name: "Form35Capacity1440", value: 4)
!267 = !DIEnumerator(name: "Form35Capacity2880", value: 5)
!268 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_POOL_TYPE", file: !1, line: 734, size: 32, align: 32, elements: !269)
!269 = !{!270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284}
!270 = !DIEnumerator(name: "NonPagedPool", value: 0)
!271 = !DIEnumerator(name: "PagedPool", value: 1)
!272 = !DIEnumerator(name: "NonPagedPoolMustSucceed", value: 2)
!273 = !DIEnumerator(name: "DontUseThisType", value: 3)
!274 = !DIEnumerator(name: "NonPagedPoolCacheAligned", value: 4)
!275 = !DIEnumerator(name: "PagedPoolCacheAligned", value: 5)
!276 = !DIEnumerator(name: "NonPagedPoolCacheAlignedMustS", value: 6)
!277 = !DIEnumerator(name: "MaxPoolType", value: 7)
!278 = !DIEnumerator(name: "NonPagedPoolSession", value: 32)
!279 = !DIEnumerator(name: "PagedPoolSession", value: 33)
!280 = !DIEnumerator(name: "NonPagedPoolMustSucceedSession", value: 34)
!281 = !DIEnumerator(name: "DontUseThisTypeSession", value: 35)
!282 = !DIEnumerator(name: "NonPagedPoolCacheAlignedSession", value: 36)
!283 = !DIEnumerator(name: "PagedPoolCacheAlignedSession", value: 37)
!284 = !DIEnumerator(name: "NonPagedPoolCacheAlignedMustSSession", value: 38)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_EVENT_TYPE", file: !1, line: 61, size: 32, align: 32, elements: !286)
!286 = !{!287, !288}
!287 = !DIEnumerator(name: "NotificationEvent", value: 0)
!288 = !DIEnumerator(name: "SynchronizationEvent", value: 1)
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_KWAIT_REASON", file: !1, line: 657, size: 32, align: 32, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318}
!291 = !DIEnumerator(name: "Executive", value: 0)
!292 = !DIEnumerator(name: "FreePage", value: 1)
!293 = !DIEnumerator(name: "PageIn", value: 2)
!294 = !DIEnumerator(name: "PoolAllocation", value: 3)
!295 = !DIEnumerator(name: "DelayExecution", value: 4)
!296 = !DIEnumerator(name: "Suspended", value: 5)
!297 = !DIEnumerator(name: "UserRequest", value: 6)
!298 = !DIEnumerator(name: "WrExecutive", value: 7)
!299 = !DIEnumerator(name: "WrFreePage", value: 8)
!300 = !DIEnumerator(name: "WrPageIn", value: 9)
!301 = !DIEnumerator(name: "WrPoolAllocation", value: 10)
!302 = !DIEnumerator(name: "WrDelayExecution", value: 11)
!303 = !DIEnumerator(name: "WrSuspended", value: 12)
!304 = !DIEnumerator(name: "WrUserRequest", value: 13)
!305 = !DIEnumerator(name: "WrEventPair", value: 14)
!306 = !DIEnumerator(name: "WrQueue", value: 15)
!307 = !DIEnumerator(name: "WrLpcReceive", value: 16)
!308 = !DIEnumerator(name: "WrLpcReply", value: 17)
!309 = !DIEnumerator(name: "WrVirtualMemory", value: 18)
!310 = !DIEnumerator(name: "WrPageOut", value: 19)
!311 = !DIEnumerator(name: "WrRendezvous", value: 20)
!312 = !DIEnumerator(name: "Spare2", value: 21)
!313 = !DIEnumerator(name: "Spare3", value: 22)
!314 = !DIEnumerator(name: "Spare4", value: 23)
!315 = !DIEnumerator(name: "Spare5", value: 24)
!316 = !DIEnumerator(name: "Spare6", value: 25)
!317 = !DIEnumerator(name: "WrKernel", value: 26)
!318 = !DIEnumerator(name: "MaximumWaitReason", value: 27)
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_MEMORY_CACHING_TYPE", file: !1, line: 724, size: 32, align: 32, elements: !320)
!320 = !{!321, !322, !323, !324, !325, !326, !327}
!321 = !DIEnumerator(name: "MmNonCached", value: 0)
!322 = !DIEnumerator(name: "MmCached", value: 1)
!323 = !DIEnumerator(name: "MmWriteCombined", value: 2)
!324 = !DIEnumerator(name: "MmHardwareCoherentCached", value: 3)
!325 = !DIEnumerator(name: "MmNonCachedUnordered", value: 4)
!326 = !DIEnumerator(name: "MmUSWCCached", value: 5)
!327 = !DIEnumerator(name: "MmMaximumCacheType", value: 6)
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_MM_PAGE_PRIORITY", file: !1, line: 796, size: 32, align: 32, elements: !329)
!329 = !{!330, !331, !332}
!330 = !DIEnumerator(name: "LowPagePriority", value: 0)
!331 = !DIEnumerator(name: "NormalPagePriority", value: 16)
!332 = !DIEnumerator(name: "HighPagePriority", value: 32)
!333 = !{!334, !335, !336, !337, !411, !359, !417, !1502, !1553, !1554, !260, !380, !360, !343, !758, !344, !1576, !1584, !354, !1596, !3, !1598, !423, !379, !1606, !1614, !1082, !1616, !682, !415, !755, !1617, !813, !1619, !1623, !1642, !1643, !1355, !780, !456}
!334 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!336 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "KUSER_SHARED_DATA", file: !1, line: 425, baseType: !339)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "_KUSER_SHARED_DATA", file: !1, line: 399, size: 6848, align: 64, elements: !340)
!340 = !{!341, !345, !346, !356, !357, !358, !361, !362, !368, !369, !370, !371, !375, !377, !381, !382, !383, !387, !388, !389, !390, !392, !409, !410}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "TickCountLow", scope: !339, file: !1, line: 400, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "ULONG", file: !1, line: 30, baseType: !344)
!344 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "TickCountMultiplier", scope: !339, file: !1, line: 401, baseType: !343, size: 64, align: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "InterruptTime", scope: !339, file: !1, line: 402, baseType: !347, size: 192, align: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSYSTEM_TIME", file: !1, line: 392, baseType: !349)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "_KSYSTEM_TIME", file: !1, line: 387, size: 192, align: 64, elements: !350)
!350 = !{!351, !352, !355}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "LowPart", scope: !349, file: !1, line: 388, baseType: !343, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "High1Time", scope: !349, file: !1, line: 389, baseType: !353, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "LONG", file: !1, line: 22, baseType: !354)
!354 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "High2Time", scope: !349, file: !1, line: 390, baseType: !353, size: 64, align: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "SystemTime", scope: !339, file: !1, line: 403, baseType: !347, size: 192, align: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "TimeZoneBias", scope: !339, file: !1, line: 404, baseType: !347, size: 192, align: 64, offset: 512)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ImageNumberLow", scope: !339, file: !1, line: 405, baseType: !359, size: 16, align: 16, offset: 704)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "USHORT", file: !1, line: 29, baseType: !360)
!360 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ImageNumberHigh", scope: !339, file: !1, line: 406, baseType: !359, size: 16, align: 16, offset: 720)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "NtSystemRoot", scope: !339, file: !1, line: 407, baseType: !363, size: 4160, align: 16, offset: 736)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 4160, align: 16, elements: !366)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "WCHAR", file: !1, line: 23, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !1, line: 12, baseType: !360)
!366 = !{!367}
!367 = !DISubrange(count: 260)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "MaxStackTraceDepth", scope: !339, file: !1, line: 408, baseType: !343, size: 64, align: 64, offset: 4928)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "CryptoExponent", scope: !339, file: !1, line: 409, baseType: !343, size: 64, align: 64, offset: 4992)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "TimeZoneId", scope: !339, file: !1, line: 410, baseType: !343, size: 64, align: 64, offset: 5056)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !339, file: !1, line: 411, baseType: !372, size: 512, align: 64, offset: 5120)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 512, align: 64, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 8)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "NtProductType", scope: !339, file: !1, line: 412, baseType: !376, size: 32, align: 32, offset: 5632)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "NT_PRODUCT_TYPE", file: !1, line: 112, baseType: !207)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ProductTypeIsValid", scope: !339, file: !1, line: 413, baseType: !378, size: 8, align: 8, offset: 5664)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !1, line: 82, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "UCHAR", file: !1, line: 28, baseType: !380)
!380 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "NtMajorVersion", scope: !339, file: !1, line: 414, baseType: !343, size: 64, align: 64, offset: 5696)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "NtMinorVersion", scope: !339, file: !1, line: 415, baseType: !343, size: 64, align: 64, offset: 5760)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessorFeatures", scope: !339, file: !1, line: 416, baseType: !384, size: 512, align: 8, offset: 5824)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 512, align: 8, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !339, file: !1, line: 417, baseType: !343, size: 64, align: 64, offset: 6336)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !339, file: !1, line: 418, baseType: !343, size: 64, align: 64, offset: 6400)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "TimeSlip", scope: !339, file: !1, line: 419, baseType: !342, size: 64, align: 64, offset: 6464)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "AlternativeArchitecture", scope: !339, file: !1, line: 420, baseType: !391, size: 32, align: 32, offset: 6528)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALTERNATIVE_ARCHITECTURE_TYPE", file: !1, line: 398, baseType: !212)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "SystemExpirationDate", scope: !339, file: !1, line: 421, baseType: !393, size: 128, align: 64, offset: 6592)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "LARGE_INTEGER", file: !1, line: 53, baseType: !394)
!394 = !DICompositeType(tag: DW_TAG_union_type, name: "_LARGE_INTEGER", file: !1, line: 48, size: 128, align: 64, elements: !395)
!395 = !{!396, !401, !406}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField1", scope: !394, file: !1, line: 49, baseType: !397, size: 128, align: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct____missing_field_name_1", file: !1, line: 40, size: 128, align: 64, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "LowPart", scope: !397, file: !1, line: 41, baseType: !343, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "HighPart", scope: !397, file: !1, line: 42, baseType: !353, size: 64, align: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !394, file: !1, line: 50, baseType: !402, size: 128, align: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_u_2", file: !1, line: 44, size: 128, align: 64, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "LowPart", scope: !402, file: !1, line: 45, baseType: !343, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "HighPart", scope: !402, file: !1, line: 46, baseType: !353, size: 64, align: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "QuadPart", scope: !394, file: !1, line: 51, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "LONGLONG", file: !1, line: 39, baseType: !408)
!408 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "SuiteMask", scope: !339, file: !1, line: 422, baseType: !343, size: 64, align: 64, offset: 6720)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "KdDebuggerEnabled", scope: !339, file: !1, line: 423, baseType: !378, size: 8, align: 8, offset: 6784)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DRIVE_MEDIA_LIMITS", file: !1, line: 1621, size: 64, align: 32, elements: !413)
!413 = !{!414, !416}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "HighestDriveMediaType", scope: !412, file: !1, line: 1622, baseType: !415, size: 32, align: 32)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "DRIVE_MEDIA_TYPE", file: !1, line: 1596, baseType: !3)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "LowestDriveMediaType", scope: !412, file: !1, line: 1623, baseType: !415, size: 32, align: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "DISKETTE_EXTENSION", file: !1, line: 1703, baseType: !419)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DISKETTE_EXTENSION", file: !1, line: 1656, size: 4416, align: 64, elements: !420)
!420 = !{!421, !424, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1479, !1480, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1500, !1503, !1504, !1505, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1515, !1516, !1517, !1518, !1519, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "FlCancelSpinLock", scope: !419, file: !1, line: 1657, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPIN_LOCK", file: !1, line: 206, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "ULONG_PTR", file: !1, line: 16, baseType: !344)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlyingPDO", scope: !419, file: !1, line: 1658, baseType: !425, size: 64, align: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PDEVICE_OBJECT", file: !1, line: 990, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DEVICE_OBJECT", file: !1, line: 962, size: 2944, align: 64, elements: !428)
!428 = !{!429, !432, !433, !434, !1395, !1396, !1397, !1398, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1445, !1446, !1455, !1457, !1458, !1459, !1460, !1461, !1462, !1469}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !427, file: !1, line: 963, baseType: !430, size: 16, align: 16)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "CSHORT", file: !1, line: 36, baseType: !431)
!431 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !427, file: !1, line: 964, baseType: !359, size: 16, align: 16, offset: 16)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ReferenceCount", scope: !427, file: !1, line: 965, baseType: !353, size: 64, align: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "DriverObject", scope: !427, file: !1, line: 966, baseType: !435, size: 64, align: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DRIVER_OBJECT", file: !1, line: 1003, size: 2688, align: 64, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !444, !445, !446, !467, !468, !471, !1378, !1382, !1383, !1387}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !436, file: !1, line: 1004, baseType: !430, size: 16, align: 16)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !436, file: !1, line: 1005, baseType: !430, size: 16, align: 16, offset: 16)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !436, file: !1, line: 1006, baseType: !425, size: 64, align: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !436, file: !1, line: 1007, baseType: !343, size: 64, align: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "DriverStart", scope: !436, file: !1, line: 1008, baseType: !443, size: 64, align: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PVOID", file: !1, line: 19, baseType: !335)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "DriverSize", scope: !436, file: !1, line: 1009, baseType: !343, size: 64, align: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "DriverSection", scope: !436, file: !1, line: 1010, baseType: !443, size: 64, align: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "DriverExtension", scope: !436, file: !1, line: 1011, baseType: !447, size: 64, align: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "PDRIVER_EXTENSION", file: !1, line: 1002, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DRIVER_EXTENSION", file: !1, line: 996, size: 320, align: 64, elements: !450)
!450 = !{!451, !452, !457, !458}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "DriverObject", scope: !449, file: !1, line: 997, baseType: !435, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "AddDevice", scope: !449, file: !1, line: 998, baseType: !453, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!456, !435, !426}
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "NTSTATUS", file: !1, line: 38, baseType: !353)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !449, file: !1, line: 999, baseType: !343, size: 64, align: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ServiceKeyName", scope: !449, file: !1, line: 1000, baseType: !459, size: 128, align: 64, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "UNICODE_STRING", file: !1, line: 80, baseType: !460)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "_UNICODE_STRING", file: !1, line: 75, size: 128, align: 64, elements: !461)
!461 = !{!462, !463, !464}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !460, file: !1, line: 76, baseType: !359, size: 16, align: 16)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumLength", scope: !460, file: !1, line: 77, baseType: !359, size: 16, align: 16, offset: 16)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !460, file: !1, line: 78, baseType: !465, size: 64, align: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWSTR", file: !1, line: 24, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "DriverName", scope: !436, file: !1, line: 1012, baseType: !459, size: 128, align: 64, offset: 448)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "HardwareDatabase", scope: !436, file: !1, line: 1013, baseType: !469, size: 64, align: 64, offset: 576)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "PUNICODE_STRING", file: !1, line: 81, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoDispatch", scope: !436, file: !1, line: 1014, baseType: !472, size: 64, align: 64, offset: 640)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFAST_IO_DISPATCH", file: !1, line: 920, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FAST_IO_DISPATCH", file: !1, line: 851, size: 1792, align: 64, elements: !475)
!475 = !{!476, !477, !572, !576, !577, !590, !603, !610, !614, !618, !622, !626, !630, !631, !635, !649, !697, !714, !718, !719, !723, !729, !730, !731, !732, !1369, !1373, !1377}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfFastIoDispatch", scope: !474, file: !1, line: 852, baseType: !343, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoCheckIfPossible", scope: !474, file: !1, line: 853, baseType: !478, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!378, !481, !560, !343, !378, !343, !378, !562, !426}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE_OBJECT", file: !1, line: 1034, size: 1728, align: 64, elements: !483)
!483 = !{!484, !485, !486, !487, !504, !505, !506, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !552, !553}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !482, file: !1, line: 1035, baseType: !430, size: 16, align: 16)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !482, file: !1, line: 1036, baseType: !430, size: 16, align: 16, offset: 16)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !482, file: !1, line: 1037, baseType: !425, size: 64, align: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Vpb", scope: !482, file: !1, line: 1038, baseType: !488, size: 64, align: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "PVPB", file: !1, line: 945, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "_VPB", file: !1, line: 934, size: 832, align: 64, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499, !500}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !490, file: !1, line: 935, baseType: !430, size: 16, align: 16)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !490, file: !1, line: 936, baseType: !430, size: 16, align: 16, offset: 16)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !490, file: !1, line: 937, baseType: !359, size: 16, align: 16, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "VolumeLabelLength", scope: !490, file: !1, line: 938, baseType: !359, size: 16, align: 16, offset: 48)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !490, file: !1, line: 939, baseType: !426, size: 64, align: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "RealDevice", scope: !490, file: !1, line: 940, baseType: !426, size: 64, align: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", scope: !490, file: !1, line: 941, baseType: !343, size: 64, align: 64, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ReferenceCount", scope: !490, file: !1, line: 942, baseType: !343, size: 64, align: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "VolumeLabel", scope: !490, file: !1, line: 943, baseType: !501, size: 512, align: 16, offset: 320)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 512, align: 16, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "FsContext", scope: !482, file: !1, line: 1039, baseType: !443, size: 64, align: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "FsContext2", scope: !482, file: !1, line: 1040, baseType: !443, size: 64, align: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "SectionObjectPointer", scope: !482, file: !1, line: 1041, baseType: !507, size: 64, align: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSECTION_OBJECT_POINTERS", file: !1, line: 1028, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECTION_OBJECT_POINTERS", file: !1, line: 1027, baseType: !510)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SECTION_OBJECT_POINTERS", file: !1, line: 1022, size: 192, align: 64, elements: !511)
!511 = !{!512, !513, !514}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "DataSectionObject", scope: !510, file: !1, line: 1023, baseType: !443, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "SharedCacheMap", scope: !510, file: !1, line: 1024, baseType: !443, size: 64, align: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ImageSectionObject", scope: !510, file: !1, line: 1025, baseType: !443, size: 64, align: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateCacheMap", scope: !482, file: !1, line: 1042, baseType: !443, size: 64, align: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "FinalStatus", scope: !482, file: !1, line: 1043, baseType: !456, size: 64, align: 64, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "RelatedFileObject", scope: !482, file: !1, line: 1044, baseType: !481, size: 64, align: 64, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "LockOperation", scope: !482, file: !1, line: 1045, baseType: !378, size: 8, align: 8, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "DeletePending", scope: !482, file: !1, line: 1046, baseType: !378, size: 8, align: 8, offset: 584)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ReadAccess", scope: !482, file: !1, line: 1047, baseType: !378, size: 8, align: 8, offset: 592)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "WriteAccess", scope: !482, file: !1, line: 1048, baseType: !378, size: 8, align: 8, offset: 600)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteAccess", scope: !482, file: !1, line: 1049, baseType: !378, size: 8, align: 8, offset: 608)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "SharedRead", scope: !482, file: !1, line: 1050, baseType: !378, size: 8, align: 8, offset: 616)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "SharedWrite", scope: !482, file: !1, line: 1051, baseType: !378, size: 8, align: 8, offset: 624)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "SharedDelete", scope: !482, file: !1, line: 1052, baseType: !378, size: 8, align: 8, offset: 632)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !482, file: !1, line: 1053, baseType: !343, size: 64, align: 64, offset: 640)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "FileName", scope: !482, file: !1, line: 1054, baseType: !459, size: 128, align: 64, offset: 704)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentByteOffset", scope: !482, file: !1, line: 1055, baseType: !393, size: 128, align: 64, offset: 832)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Waiters", scope: !482, file: !1, line: 1056, baseType: !343, size: 64, align: 64, offset: 960)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Busy", scope: !482, file: !1, line: 1057, baseType: !343, size: 64, align: 64, offset: 1024)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "LastLock", scope: !482, file: !1, line: 1058, baseType: !443, size: 64, align: 64, offset: 1088)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", scope: !482, file: !1, line: 1059, baseType: !533, size: 256, align: 64, offset: 1152)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "KEVENT", file: !1, line: 714, baseType: !534)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "_KEVENT", file: !1, line: 711, size: 256, align: 64, elements: !535)
!535 = !{!536}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !534, file: !1, line: 712, baseType: !537, size: 256, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "DISPATCHER_HEADER", file: !1, line: 696, baseType: !538)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DISPATCHER_HEADER", file: !1, line: 688, size: 256, align: 64, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !538, file: !1, line: 689, baseType: !379, size: 8, align: 8)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Absolute", scope: !538, file: !1, line: 690, baseType: !379, size: 8, align: 8, offset: 8)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !538, file: !1, line: 691, baseType: !379, size: 8, align: 8, offset: 16)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Inserted", scope: !538, file: !1, line: 692, baseType: !379, size: 8, align: 8, offset: 24)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "SignalState", scope: !538, file: !1, line: 693, baseType: !353, size: 64, align: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "WaitListHead", scope: !538, file: !1, line: 694, baseType: !546, size: 128, align: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIST_ENTRY", file: !1, line: 87, baseType: !547)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LIST_ENTRY", file: !1, line: 83, size: 128, align: 64, elements: !548)
!548 = !{!549, !551}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Flink", scope: !547, file: !1, line: 84, baseType: !550, size: 64, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Blink", scope: !547, file: !1, line: 85, baseType: !550, size: 64, align: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Event", scope: !482, file: !1, line: 1060, baseType: !533, size: 256, align: 64, offset: 1408)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "CompletionContext", scope: !482, file: !1, line: 1061, baseType: !554, size: 64, align: 64, offset: 1664)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIO_COMPLETION_CONTEXT", file: !1, line: 1033, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_COMPLETION_CONTEXT", file: !1, line: 1029, size: 128, align: 64, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Port", scope: !556, file: !1, line: 1030, baseType: !443, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Key", scope: !556, file: !1, line: 1031, baseType: !443, size: 64, align: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "PLARGE_INTEGER", file: !1, line: 54, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIO_STATUS_BLOCK", file: !1, line: 230, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64, align: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_STATUS_BLOCK", file: !1, line: 225, size: 128, align: 64, elements: !565)
!565 = !{!566, !571}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField4", scope: !564, file: !1, line: 226, baseType: !567, size: 64, align: 64)
!567 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_6", file: !1, line: 221, size: 64, align: 64, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !567, file: !1, line: 222, baseType: !456, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !567, file: !1, line: 223, baseType: !443, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Information", scope: !564, file: !1, line: 227, baseType: !423, size: 64, align: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoRead", scope: !474, file: !1, line: 857, baseType: !573, size: 64, align: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!378, !481, !560, !343, !378, !343, !443, !562, !426}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoWrite", scope: !474, file: !1, line: 860, baseType: !573, size: 64, align: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoQueryBasicInfo", scope: !474, file: !1, line: 863, baseType: !578, size: 64, align: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64, align: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!378, !481, !378, !581, !562, !426}
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFILE_BASIC_INFORMATION", file: !1, line: 278, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64, align: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE_BASIC_INFORMATION", file: !1, line: 271, size: 576, align: 64, elements: !584)
!584 = !{!585, !586, !587, !588, !589}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "CreationTime", scope: !583, file: !1, line: 272, baseType: !393, size: 128, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessTime", scope: !583, file: !1, line: 273, baseType: !393, size: 128, align: 64, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "LastWriteTime", scope: !583, file: !1, line: 274, baseType: !393, size: 128, align: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ChangeTime", scope: !583, file: !1, line: 275, baseType: !393, size: 128, align: 64, offset: 384)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "FileAttributes", scope: !583, file: !1, line: 276, baseType: !343, size: 64, align: 64, offset: 512)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoQueryStandardInfo", scope: !474, file: !1, line: 866, baseType: !591, size: 64, align: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!378, !481, !378, !594, !562, !426}
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFILE_STANDARD_INFORMATION", file: !1, line: 286, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE_STANDARD_INFORMATION", file: !1, line: 279, size: 384, align: 64, elements: !597)
!597 = !{!598, !599, !600, !601, !602}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationSize", scope: !596, file: !1, line: 280, baseType: !393, size: 128, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "EndOfFile", scope: !596, file: !1, line: 281, baseType: !393, size: 128, align: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfLinks", scope: !596, file: !1, line: 282, baseType: !343, size: 64, align: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "DeletePending", scope: !596, file: !1, line: 283, baseType: !378, size: 8, align: 8, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Directory", scope: !596, file: !1, line: 284, baseType: !378, size: 8, align: 8, offset: 328)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoLock", scope: !474, file: !1, line: 869, baseType: !604, size: 64, align: 64, offset: 384)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64, align: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!378, !481, !560, !560, !607, !343, !378, !378, !562, !426}
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "PEPROCESS", file: !1, line: 118, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "_EPROCESS", file: !1, line: 117, flags: DIFlagFwdDecl)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoUnlockSingle", scope: !474, file: !1, line: 873, baseType: !611, size: 64, align: 64, offset: 448)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!378, !481, !560, !560, !607, !343, !562, !426}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoUnlockAll", scope: !474, file: !1, line: 876, baseType: !615, size: 64, align: 64, offset: 512)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64, align: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!378, !481, !607, !562, !426}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoUnlockAllByKey", scope: !474, file: !1, line: 878, baseType: !619, size: 64, align: 64, offset: 576)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64, align: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!378, !481, !443, !343, !562, !426}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoDeviceControl", scope: !474, file: !1, line: 880, baseType: !623, size: 64, align: 64, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!378, !481, !378, !443, !343, !443, !343, !343, !562, !426}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "AcquireFileForNtCreateSection", scope: !474, file: !1, line: 884, baseType: !627, size: 64, align: 64, offset: 704)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !481}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ReleaseFileForNtCreateSection", scope: !474, file: !1, line: 885, baseType: !627, size: 64, align: 64, offset: 768)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoDetachDevice", scope: !474, file: !1, line: 886, baseType: !632, size: 64, align: 64, offset: 832)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64, align: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{null, !426, !426}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoQueryNetworkOpenInfo", scope: !474, file: !1, line: 887, baseType: !636, size: 64, align: 64, offset: 896)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!378, !481, !378, !639, !563, !426}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE_NETWORK_OPEN_INFORMATION", file: !1, line: 287, size: 832, align: 64, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !647, !648}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "CreationTime", scope: !640, file: !1, line: 288, baseType: !393, size: 128, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessTime", scope: !640, file: !1, line: 289, baseType: !393, size: 128, align: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "LastWriteTime", scope: !640, file: !1, line: 290, baseType: !393, size: 128, align: 64, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ChangeTime", scope: !640, file: !1, line: 291, baseType: !393, size: 128, align: 64, offset: 384)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationSize", scope: !640, file: !1, line: 292, baseType: !393, size: 128, align: 64, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "EndOfFile", scope: !640, file: !1, line: 293, baseType: !393, size: 128, align: 64, offset: 640)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "FileAttributes", scope: !640, file: !1, line: 294, baseType: !343, size: 64, align: 64, offset: 768)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "AcquireForModWrite", scope: !474, file: !1, line: 890, baseType: !650, size: 64, align: 64, offset: 960)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!456, !481, !560, !653, !426}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ERESOURCE", file: !1, line: 776, size: 896, align: 64, elements: !656)
!656 = !{!657, !658, !670, !672, !673, !680, !683, !688, !689, !690, !691, !696}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "SystemResourcesList", scope: !655, file: !1, line: 777, baseType: !546, size: 128, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "OwnerTable", scope: !655, file: !1, line: 778, baseType: !659, size: 64, align: 64, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWNER_ENTRY", file: !1, line: 771, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "_OWNER_ENTRY", file: !1, line: 766, size: 128, align: 64, elements: !662)
!662 = !{!663, !665}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "OwnerThread", scope: !661, file: !1, line: 767, baseType: !664, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "ERESOURCE_THREAD", file: !1, line: 761, baseType: !423)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField10", scope: !661, file: !1, line: 768, baseType: !666, size: 64, align: 64, offset: 64)
!666 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_38", file: !1, line: 762, size: 64, align: 64, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "OwnerCount", scope: !666, file: !1, line: 763, baseType: !353, size: 64, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "TableSize", scope: !666, file: !1, line: 764, baseType: !343, size: 64, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ActiveCount", scope: !655, file: !1, line: 779, baseType: !671, size: 16, align: 16, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHORT", file: !1, line: 21, baseType: !431)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Flag", scope: !655, file: !1, line: 780, baseType: !359, size: 16, align: 16, offset: 208)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "SharedWaiters", scope: !655, file: !1, line: 781, baseType: !674, size: 64, align: 64, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKSEMAPHORE", file: !1, line: 722, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64, align: 64)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "_KSEMAPHORE", file: !1, line: 717, size: 320, align: 64, elements: !677)
!677 = !{!678, !679}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !676, file: !1, line: 718, baseType: !537, size: 256, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "Limit", scope: !676, file: !1, line: 719, baseType: !353, size: 64, align: 64, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ExclusiveWaiters", scope: !655, file: !1, line: 782, baseType: !681, size: 64, align: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKEVENT", file: !1, line: 715, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "OwnerThreads", scope: !655, file: !1, line: 783, baseType: !684, size: 256, align: 64, offset: 384)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 256, align: 64, elements: !686)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "OWNER_ENTRY", file: !1, line: 770, baseType: !661)
!686 = !{!687}
!687 = !DISubrange(count: 2)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ContentionCount", scope: !655, file: !1, line: 784, baseType: !343, size: 64, align: 64, offset: 640)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfSharedWaiters", scope: !655, file: !1, line: 785, baseType: !359, size: 16, align: 16, offset: 704)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfExclusiveWaiters", scope: !655, file: !1, line: 786, baseType: !359, size: 16, align: 16, offset: 720)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField11", scope: !655, file: !1, line: 787, baseType: !692, size: 64, align: 64, offset: 768)
!692 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_39", file: !1, line: 772, size: 64, align: 64, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Address", scope: !692, file: !1, line: 773, baseType: !443, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "CreatorBackTraceIndex", scope: !692, file: !1, line: 774, baseType: !423, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "SpinLock", scope: !655, file: !1, line: 788, baseType: !422, size: 64, align: 64, offset: 832)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "MdlRead", scope: !474, file: !1, line: 892, baseType: !698, size: 64, align: 64, offset: 1024)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64, align: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!378, !481, !560, !343, !343, !701, !562, !426}
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "PMDL", file: !1, line: 172, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MDL", file: !1, line: 161, size: 448, align: 64, elements: !705)
!705 = !{!706, !707, !708, !709, !710, !711, !712, !713}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !704, file: !1, line: 162, baseType: !703, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !704, file: !1, line: 163, baseType: !430, size: 16, align: 16, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "MdlFlags", scope: !704, file: !1, line: 164, baseType: !430, size: 16, align: 16, offset: 80)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "Process", scope: !704, file: !1, line: 165, baseType: !608, size: 64, align: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "MappedSystemVa", scope: !704, file: !1, line: 166, baseType: !443, size: 64, align: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "StartVa", scope: !704, file: !1, line: 167, baseType: !443, size: 64, align: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ByteCount", scope: !704, file: !1, line: 168, baseType: !343, size: 64, align: 64, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ByteOffset", scope: !704, file: !1, line: 169, baseType: !343, size: 64, align: 64, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "MdlReadComplete", scope: !474, file: !1, line: 895, baseType: !715, size: 64, align: 64, offset: 1088)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64, align: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!378, !481, !702, !426}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "PrepareMdlWrite", scope: !474, file: !1, line: 896, baseType: !698, size: 64, align: 64, offset: 1152)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "MdlWriteComplete", scope: !474, file: !1, line: 899, baseType: !720, size: 64, align: 64, offset: 1216)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64, align: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!378, !481, !560, !702, !426}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoReadCompressed", scope: !474, file: !1, line: 901, baseType: !724, size: 64, align: 64, offset: 1280)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64, align: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!378, !481, !560, !343, !343, !443, !701, !562, !727, !343, !426}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64, align: 64)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "_COMPRESSED_DATA_INFO", file: !1, line: 850, flags: DIFlagFwdDecl)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoWriteCompressed", scope: !474, file: !1, line: 905, baseType: !724, size: 64, align: 64, offset: 1344)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "MdlReadCompleteCompressed", scope: !474, file: !1, line: 909, baseType: !715, size: 64, align: 64, offset: 1408)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "MdlWriteCompleteCompressed", scope: !474, file: !1, line: 911, baseType: !720, size: 64, align: 64, offset: 1472)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoQueryOpen", scope: !474, file: !1, line: 913, baseType: !733, size: 64, align: 64, offset: 1536)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64, align: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!378, !736, !1368, !426}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64, align: 64)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IRP", file: !1, line: 1106, size: 1728, align: 64, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !749, !750, !752, !756, !757, !759, !760, !761, !763, !764, !765, !766, !767, !779, !783, !784}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !737, file: !1, line: 1107, baseType: !430, size: 16, align: 16)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !737, file: !1, line: 1108, baseType: !359, size: 16, align: 16, offset: 16)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "MdlAddress", scope: !737, file: !1, line: 1109, baseType: !702, size: 64, align: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !737, file: !1, line: 1110, baseType: !343, size: 64, align: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "AssociatedIrp", scope: !737, file: !1, line: 1111, baseType: !744, size: 64, align: 64, offset: 192)
!744 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_AssociatedIrp_44", file: !1, line: 1064, size: 64, align: 64, elements: !745)
!745 = !{!746, !747, !748}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "MasterIrp", scope: !744, file: !1, line: 1065, baseType: !736, size: 64, align: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "IrpCount", scope: !744, file: !1, line: 1066, baseType: !353, size: 64, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "SystemBuffer", scope: !744, file: !1, line: 1067, baseType: !443, size: 64, align: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ThreadListEntry", scope: !737, file: !1, line: 1112, baseType: !546, size: 128, align: 64, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "IoStatus", scope: !737, file: !1, line: 1113, baseType: !751, size: 128, align: 64, offset: 384)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "IO_STATUS_BLOCK", file: !1, line: 229, baseType: !564)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "RequestorMode", scope: !737, file: !1, line: 1114, baseType: !753, size: 8, align: 8, offset: 512)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "KPROCESSOR_MODE", file: !1, line: 123, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCHAR", file: !1, line: 35, baseType: !755)
!755 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "PendingReturned", scope: !737, file: !1, line: 1115, baseType: !378, size: 8, align: 8, offset: 520)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "StackCount", scope: !737, file: !1, line: 1116, baseType: !758, size: 8, align: 8, offset: 528)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR", file: !1, line: 20, baseType: !755)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentLocation", scope: !737, file: !1, line: 1117, baseType: !758, size: 8, align: 8, offset: 536)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", scope: !737, file: !1, line: 1118, baseType: !378, size: 8, align: 8, offset: 544)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "CancelIrql", scope: !737, file: !1, line: 1119, baseType: !762, size: 8, align: 8, offset: 552)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "KIRQL", file: !1, line: 106, baseType: !379)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ApcEnvironment", scope: !737, file: !1, line: 1120, baseType: !754, size: 8, align: 8, offset: 560)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationFlags", scope: !737, file: !1, line: 1121, baseType: !379, size: 8, align: 8, offset: 568)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "UserIosb", scope: !737, file: !1, line: 1122, baseType: !562, size: 64, align: 64, offset: 576)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "UserEvent", scope: !737, file: !1, line: 1123, baseType: !681, size: 64, align: 64, offset: 640)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Overlay", scope: !737, file: !1, line: 1124, baseType: !768, size: 128, align: 64, offset: 704)
!768 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_Overlay_45", file: !1, line: 1074, size: 128, align: 64, elements: !769)
!769 = !{!770, !778}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "AsynchronousParameters", scope: !768, file: !1, line: 1075, baseType: !771, size: 128, align: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_AsynchronousParameters_46", file: !1, line: 1069, size: 128, align: 64, elements: !772)
!772 = !{!773, !777}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "UserApcRoutine", scope: !771, file: !1, line: 1070, baseType: !774, size: 64, align: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64, align: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{null, !443, !562, !343}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "UserApcContext", scope: !771, file: !1, line: 1072, baseType: !443, size: 64, align: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationSize", scope: !768, file: !1, line: 1076, baseType: !393, size: 128, align: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "CancelRoutine", scope: !737, file: !1, line: 1125, baseType: !780, size: 64, align: 64, offset: 832)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64, align: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !426, !736}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "UserBuffer", scope: !737, file: !1, line: 1126, baseType: !443, size: 64, align: 64, offset: 896)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "Tail", scope: !737, file: !1, line: 1127, baseType: !785, size: 768, align: 64, offset: 960)
!785 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_Tail_47", file: !1, line: 1101, size: 768, align: 64, elements: !786)
!786 = !{!787, !1334, !1367}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Overlay", scope: !785, file: !1, line: 1102, baseType: !788, size: 640, align: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Overlay_48", file: !1, line: 1094, size: 640, align: 64, elements: !789)
!789 = !{!790, !807, !811, !814, !1333}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField15", scope: !788, file: !1, line: 1095, baseType: !791, size: 256, align: 64)
!791 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_49", file: !1, line: 1081, size: 256, align: 64, elements: !792)
!792 = !{!793, !800}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceQueueEntry", scope: !791, file: !1, line: 1082, baseType: !794, size: 256, align: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "KDEVICE_QUEUE_ENTRY", file: !1, line: 710, baseType: !795)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "_KDEVICE_QUEUE_ENTRY", file: !1, line: 705, size: 256, align: 64, elements: !796)
!796 = !{!797, !798, !799}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceListEntry", scope: !795, file: !1, line: 706, baseType: !546, size: 128, align: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "SortKey", scope: !795, file: !1, line: 707, baseType: !343, size: 64, align: 64, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "Inserted", scope: !795, file: !1, line: 708, baseType: !378, size: 8, align: 8, offset: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField14", scope: !791, file: !1, line: 1083, baseType: !801, size: 256, align: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct____missing_field_name_50", file: !1, line: 1078, size: 256, align: 64, elements: !802)
!802 = !{!803}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "DriverContext", scope: !801, file: !1, line: 1079, baseType: !804, size: 256, align: 64)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 256, align: 64, elements: !805)
!805 = !{!806}
!806 = !DISubrange(count: 4)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "Thread", scope: !788, file: !1, line: 1096, baseType: !808, size: 64, align: 64, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "PETHREAD", file: !1, line: 116, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64, align: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ETHREAD", file: !1, line: 115, flags: DIFlagFwdDecl)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "AuxiliaryBuffer", scope: !788, file: !1, line: 1097, baseType: !812, size: 64, align: 64, offset: 320)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCHAR", file: !1, line: 26, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, align: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField17", scope: !788, file: !1, line: 1098, baseType: !815, size: 192, align: 64, offset: 384)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct____missing_field_name_51", file: !1, line: 1090, size: 192, align: 64, elements: !816)
!816 = !{!817, !818}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ListEntry", scope: !815, file: !1, line: 1091, baseType: !546, size: 128, align: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField16", scope: !815, file: !1, line: 1092, baseType: !819, size: 64, align: 64, offset: 128)
!819 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_52", file: !1, line: 1086, size: 64, align: 64, elements: !820)
!820 = !{!821, !1332}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentStackLocation", scope: !819, file: !1, line: 1087, baseType: !822, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64, align: 64)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_STACK_LOCATION", file: !1, line: 1364, size: 544, align: 32, elements: !824)
!824 = !{!825, !826, !827, !828, !829, !1324, !1325, !1326, !1331}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "MajorFunction", scope: !823, file: !1, line: 1365, baseType: !379, size: 8, align: 8)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "MinorFunction", scope: !823, file: !1, line: 1366, baseType: !379, size: 8, align: 8, offset: 8)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !823, file: !1, line: 1367, baseType: !379, size: 8, align: 8, offset: 16)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !823, file: !1, line: 1368, baseType: !379, size: 8, align: 8, offset: 24)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "Parameters", scope: !823, file: !1, line: 1369, baseType: !830, size: 256, align: 32, offset: 32)
!830 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_Parameters_55", file: !1, line: 1335, size: 256, align: 32, elements: !831)
!831 = !{!832, !920, !926, !932, !938, !956, !962, !969, !975, !980, !985, !990, !996, !1001, !1031, !1072, !1172, !1179, !1183, !1188, !1195, !1203, !1207, !1218, !1232, !1310, !1317}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "Create", scope: !830, file: !1, line: 1336, baseType: !833, size: 224, align: 32)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Create_56", file: !1, line: 1205, size: 224, align: 32, elements: !834)
!834 = !{!835, !916, !917, !918, !919}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityContext", scope: !833, file: !1, line: 1206, baseType: !836, size: 64, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIO_SECURITY_CONTEXT", file: !1, line: 933, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64, align: 64)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_SECURITY_CONTEXT", file: !1, line: 927, size: 256, align: 64, elements: !839)
!839 = !{!840, !851, !914, !915}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityQos", scope: !838, file: !1, line: 928, baseType: !841, size: 64, align: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSECURITY_QUALITY_OF_SERVICE", file: !1, line: 203, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64, align: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SECURITY_QUALITY_OF_SERVICE", file: !1, line: 197, size: 128, align: 64, elements: !844)
!844 = !{!845, !846, !848, !850}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !843, file: !1, line: 198, baseType: !343, size: 64, align: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ImpersonationLevel", scope: !843, file: !1, line: 199, baseType: !847, size: 32, align: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECURITY_IMPERSONATION_LEVEL", file: !1, line: 195, baseType: !70)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ContextTrackingMode", scope: !843, file: !1, line: 200, baseType: !849, size: 8, align: 8, offset: 96)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECURITY_CONTEXT_TRACKING_MODE", file: !1, line: 196, baseType: !378)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "EffectiveOnly", scope: !843, file: !1, line: 201, baseType: !378, size: 8, align: 8, offset: 104)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "AccessState", scope: !838, file: !1, line: 929, baseType: !852, size: 64, align: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "PACCESS_STATE", file: !1, line: 839, baseType: !853)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64, align: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ACCESS_STATE", file: !1, line: 821, size: 1856, align: 64, elements: !855)
!855 = !{!856, !862, !863, !864, !865, !866, !867, !869, !870, !871, !880, !882, !883, !911, !912, !913}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "OperationID", scope: !854, file: !1, line: 822, baseType: !857, size: 128, align: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "LUID", file: !1, line: 59, baseType: !858)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LUID", file: !1, line: 55, size: 128, align: 64, elements: !859)
!859 = !{!860, !861}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "LowPart", scope: !858, file: !1, line: 56, baseType: !343, size: 64, align: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "HighPart", scope: !858, file: !1, line: 57, baseType: !353, size: 64, align: 64, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityEvaluated", scope: !854, file: !1, line: 823, baseType: !378, size: 8, align: 8, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "GenerateAudit", scope: !854, file: !1, line: 824, baseType: !378, size: 8, align: 8, offset: 136)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "GenerateOnClose", scope: !854, file: !1, line: 825, baseType: !378, size: 8, align: 8, offset: 144)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "PrivilegesAllocated", scope: !854, file: !1, line: 826, baseType: !378, size: 8, align: 8, offset: 152)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !854, file: !1, line: 827, baseType: !343, size: 64, align: 64, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "RemainingDesiredAccess", scope: !854, file: !1, line: 828, baseType: !868, size: 64, align: 64, offset: 256)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "ACCESS_MASK", file: !1, line: 175, baseType: !343)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "PreviouslyGrantedAccess", scope: !854, file: !1, line: 829, baseType: !868, size: 64, align: 64, offset: 320)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "OriginalDesiredAccess", scope: !854, file: !1, line: 830, baseType: !868, size: 64, align: 64, offset: 384)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectSecurityContext", scope: !854, file: !1, line: 831, baseType: !872, size: 256, align: 64, offset: 448)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECURITY_SUBJECT_CONTEXT", file: !1, line: 810, baseType: !873)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SECURITY_SUBJECT_CONTEXT", file: !1, line: 804, size: 256, align: 64, elements: !874)
!874 = !{!875, !877, !878, !879}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ClientToken", scope: !873, file: !1, line: 805, baseType: !876, size: 64, align: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "PACCESS_TOKEN", file: !1, line: 173, baseType: !443)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ImpersonationLevel", scope: !873, file: !1, line: 806, baseType: !847, size: 32, align: 32, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "PrimaryToken", scope: !873, file: !1, line: 807, baseType: !876, size: 64, align: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessAuditId", scope: !873, file: !1, line: 808, baseType: !443, size: 64, align: 64, offset: 192)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityDescriptor", scope: !854, file: !1, line: 832, baseType: !881, size: 64, align: 64, offset: 704)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSECURITY_DESCRIPTOR", file: !1, line: 174, baseType: !443)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "AuxData", scope: !854, file: !1, line: 833, baseType: !443, size: 64, align: 64, offset: 768)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "Privileges", scope: !854, file: !1, line: 834, baseType: !884, size: 704, align: 64, offset: 832)
!884 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_Privileges_40", file: !1, line: 817, size: 704, align: 64, elements: !885)
!885 = !{!886, !901}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "InitialPrivilegeSet", scope: !884, file: !1, line: 818, baseType: !887, size: 704, align: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "INITIAL_PRIVILEGE_SET", file: !1, line: 816, baseType: !888)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "_INITIAL_PRIVILEGE_SET", file: !1, line: 811, size: 704, align: 64, elements: !889)
!889 = !{!890, !891, !892}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "PrivilegeCount", scope: !888, file: !1, line: 812, baseType: !343, size: 64, align: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !888, file: !1, line: 813, baseType: !343, size: 64, align: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "Privilege", scope: !888, file: !1, line: 814, baseType: !893, size: 576, align: 32, offset: 128)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 576, align: 32, elements: !899)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "LUID_AND_ATTRIBUTES", file: !1, line: 181, baseType: !895)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LUID_AND_ATTRIBUTES", file: !1, line: 177, size: 192, align: 32, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "Luid", scope: !895, file: !1, line: 178, baseType: !857, size: 128, align: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !895, file: !1, line: 179, baseType: !343, size: 64, align: 64, offset: 128)
!899 = !{!900}
!900 = !DISubrange(count: 3)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "PrivilegeSet", scope: !884, file: !1, line: 819, baseType: !902, size: 320, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "PRIVILEGE_SET", file: !1, line: 188, baseType: !903)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PRIVILEGE_SET", file: !1, line: 183, size: 320, align: 64, elements: !904)
!904 = !{!905, !906, !907}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "PrivilegeCount", scope: !903, file: !1, line: 184, baseType: !343, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !903, file: !1, line: 185, baseType: !343, size: 64, align: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "Privilege", scope: !903, file: !1, line: 186, baseType: !908, size: 192, align: 32, offset: 128)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 192, align: 32, elements: !909)
!909 = !{!910}
!910 = !DISubrange(count: 1)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "AuditPrivileges", scope: !854, file: !1, line: 835, baseType: !378, size: 8, align: 8, offset: 1536)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ObjectName", scope: !854, file: !1, line: 836, baseType: !459, size: 128, align: 64, offset: 1600)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ObjectTypeName", scope: !854, file: !1, line: 837, baseType: !459, size: 128, align: 64, offset: 1728)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "DesiredAccess", scope: !838, file: !1, line: 930, baseType: !868, size: 64, align: 64, offset: 128)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "FullCreateOptions", scope: !838, file: !1, line: 931, baseType: !343, size: 64, align: 64, offset: 192)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "Options", scope: !833, file: !1, line: 1207, baseType: !343, size: 64, align: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "FileAttributes", scope: !833, file: !1, line: 1208, baseType: !359, size: 16, align: 16, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ShareAccess", scope: !833, file: !1, line: 1209, baseType: !359, size: 16, align: 16, offset: 144)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "EaLength", scope: !833, file: !1, line: 1210, baseType: !343, size: 64, align: 64, offset: 160)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "Read", scope: !830, file: !1, line: 1337, baseType: !921, size: 256, align: 32)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Read_57", file: !1, line: 1212, size: 256, align: 32, elements: !922)
!922 = !{!923, !924, !925}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !921, file: !1, line: 1213, baseType: !343, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "Key", scope: !921, file: !1, line: 1214, baseType: !343, size: 64, align: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ByteOffset", scope: !921, file: !1, line: 1215, baseType: !393, size: 128, align: 64, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "Write", scope: !830, file: !1, line: 1338, baseType: !927, size: 256, align: 32)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Write_58", file: !1, line: 1217, size: 256, align: 32, elements: !928)
!928 = !{!929, !930, !931}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !927, file: !1, line: 1218, baseType: !343, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "Key", scope: !927, file: !1, line: 1219, baseType: !343, size: 64, align: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ByteOffset", scope: !927, file: !1, line: 1220, baseType: !393, size: 128, align: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "QueryFile", scope: !830, file: !1, line: 1339, baseType: !933, size: 96, align: 32)
!933 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryFile_59", file: !1, line: 1222, size: 96, align: 32, elements: !934)
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !933, file: !1, line: 1223, baseType: !343, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "FileInformationClass", scope: !933, file: !1, line: 1224, baseType: !937, size: 32, align: 32, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE_INFORMATION_CLASS", file: !1, line: 270, baseType: !76)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "SetFile", scope: !830, file: !1, line: 1340, baseType: !939, size: 224, align: 32)
!939 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_SetFile_60", file: !1, line: 1235, size: 224, align: 32, elements: !940)
!940 = !{!941, !942, !943, !945}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !939, file: !1, line: 1236, baseType: !343, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "FileInformationClass", scope: !939, file: !1, line: 1237, baseType: !937, size: 32, align: 32, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "FileObject", scope: !939, file: !1, line: 1238, baseType: !944, size: 64, align: 64, offset: 96)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFILE_OBJECT", file: !1, line: 1063, baseType: !481)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField19", scope: !939, file: !1, line: 1239, baseType: !946, size: 64, align: 32, offset: 160)
!946 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_61", file: !1, line: 1230, size: 64, align: 32, elements: !947)
!947 = !{!948, !953, !954}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField18", scope: !946, file: !1, line: 1231, baseType: !949, size: 16, align: 8)
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct____missing_field_name_62", file: !1, line: 1226, size: 16, align: 8, elements: !950)
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ReplaceIfExists", scope: !949, file: !1, line: 1227, baseType: !378, size: 8, align: 8)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "AdvanceOnly", scope: !949, file: !1, line: 1228, baseType: !378, size: 8, align: 8, offset: 8)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !946, file: !1, line: 1232, baseType: !343, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteHandle", scope: !946, file: !1, line: 1233, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "HANDLE", file: !1, line: 33, baseType: !335)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "QueryVolume", scope: !830, file: !1, line: 1341, baseType: !957, size: 96, align: 32)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryVolume_63", file: !1, line: 1241, size: 96, align: 32, elements: !958)
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !957, file: !1, line: 1242, baseType: !343, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "FsInformationClass", scope: !957, file: !1, line: 1243, baseType: !961, size: 32, align: 32, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "FS_INFORMATION_CLASS", file: !1, line: 308, baseType: !115)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceIoControl", scope: !830, file: !1, line: 1342, baseType: !963, size: 256, align: 32)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_DeviceIoControl_64", file: !1, line: 1245, size: 256, align: 32, elements: !964)
!964 = !{!965, !966, !967, !968}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "OutputBufferLength", scope: !963, file: !1, line: 1246, baseType: !343, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "InputBufferLength", scope: !963, file: !1, line: 1247, baseType: !343, size: 64, align: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "IoControlCode", scope: !963, file: !1, line: 1248, baseType: !343, size: 64, align: 64, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "Type3InputBuffer", scope: !963, file: !1, line: 1249, baseType: !443, size: 64, align: 64, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "QuerySecurity", scope: !830, file: !1, line: 1343, baseType: !970, size: 128, align: 32)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QuerySecurity_65", file: !1, line: 1251, size: 128, align: 32, elements: !971)
!971 = !{!972, !974}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityInformation", scope: !970, file: !1, line: 1252, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECURITY_INFORMATION", file: !1, line: 204, baseType: !343)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !970, file: !1, line: 1253, baseType: !343, size: 64, align: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "SetSecurity", scope: !830, file: !1, line: 1344, baseType: !976, size: 128, align: 32)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_SetSecurity_66", file: !1, line: 1255, size: 128, align: 32, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityInformation", scope: !976, file: !1, line: 1256, baseType: !973, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityDescriptor", scope: !976, file: !1, line: 1257, baseType: !881, size: 64, align: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "MountVolume", scope: !830, file: !1, line: 1345, baseType: !981, size: 128, align: 32)
!981 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_MountVolume_67", file: !1, line: 1259, size: 128, align: 32, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "Vpb", scope: !981, file: !1, line: 1260, baseType: !488, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !981, file: !1, line: 1261, baseType: !425, size: 64, align: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "VerifyVolume", scope: !830, file: !1, line: 1346, baseType: !986, size: 128, align: 32)
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_VerifyVolume_68", file: !1, line: 1263, size: 128, align: 32, elements: !987)
!987 = !{!988, !989}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "Vpb", scope: !986, file: !1, line: 1264, baseType: !488, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !986, file: !1, line: 1265, baseType: !425, size: 64, align: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "Scsi", scope: !830, file: !1, line: 1347, baseType: !991, size: 64, align: 32)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Scsi_69", file: !1, line: 1267, size: 64, align: 32, elements: !992)
!992 = !{!993}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "Srb", scope: !991, file: !1, line: 1268, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SCSI_REQUEST_BLOCK", file: !1, line: 847, flags: DIFlagFwdDecl)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "QueryDeviceRelations", scope: !830, file: !1, line: 1348, baseType: !997, size: 32, align: 32)
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryDeviceRelations_70", file: !1, line: 1270, size: 32, align: 32, elements: !998)
!998 = !{!999}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !997, file: !1, line: 1271, baseType: !1000, size: 32, align: 32)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEVICE_RELATION_TYPE", file: !1, line: 1138, baseType: !126)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "QueryInterface", scope: !830, file: !1, line: 1349, baseType: !1002, size: 224, align: 32)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryInterface_71", file: !1, line: 1273, size: 224, align: 32, elements: !1003)
!1003 = !{!1004, !1015, !1016, !1017, !1030}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceType", scope: !1002, file: !1, line: 1274, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !1, line: 105, baseType: !1008)
!1008 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GUID", file: !1, line: 99, size: 192, align: 64, elements: !1009)
!1009 = !{!1010, !1011, !1012, !1013}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !1008, file: !1, line: 100, baseType: !344, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !1008, file: !1, line: 101, baseType: !360, size: 16, align: 16, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !1008, file: !1, line: 102, baseType: !360, size: 16, align: 16, offset: 80)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !1008, file: !1, line: 103, baseType: !1014, size: 64, align: 8, offset: 96)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 64, align: 8, elements: !373)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !1002, file: !1, line: 1275, baseType: !359, size: 16, align: 16, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !1002, file: !1, line: 1276, baseType: !359, size: 16, align: 16, offset: 80)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "Interface", scope: !1002, file: !1, line: 1277, baseType: !1018, size: 64, align: 64, offset: 96)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "PINTERFACE", file: !1, line: 1153, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DICompositeType(tag: DW_TAG_structure_type, name: "_INTERFACE", file: !1, line: 1146, size: 256, align: 64, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1029}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !1020, file: !1, line: 1147, baseType: !359, size: 16, align: 16)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !1020, file: !1, line: 1148, baseType: !359, size: 16, align: 16, offset: 16)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "Context", scope: !1020, file: !1, line: 1149, baseType: !443, size: 64, align: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceReference", scope: !1020, file: !1, line: 1150, baseType: !1026, size: 64, align: 64, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{null, !443}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceDereference", scope: !1020, file: !1, line: 1151, baseType: !1026, size: 64, align: 64, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceSpecificData", scope: !1002, file: !1, line: 1278, baseType: !443, size: 64, align: 64, offset: 160)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceCapabilities", scope: !830, file: !1, line: 1350, baseType: !1032, size: 64, align: 32)
!1032 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_DeviceCapabilities_72", file: !1, line: 1280, size: 64, align: 32, elements: !1033)
!1033 = !{!1034}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "Capabilities", scope: !1032, file: !1, line: 1281, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "PDEVICE_CAPABILITIES", file: !1, line: 1184, baseType: !1036)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DEVICE_CAPABILITIES", file: !1, line: 1154, size: 704, align: 64, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1066, !1068, !1069, !1070, !1071}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !1037, file: !1, line: 1155, baseType: !359, size: 16, align: 16)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !1037, file: !1, line: 1156, baseType: !359, size: 16, align: 16, offset: 16)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceD1", scope: !1037, file: !1, line: 1157, baseType: !343, size: 1, align: 64, offset: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceD2", scope: !1037, file: !1, line: 1158, baseType: !343, size: 1, align: 64, offset: 33)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "LockSupported", scope: !1037, file: !1, line: 1159, baseType: !343, size: 1, align: 64, offset: 34)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "EjectSupported", scope: !1037, file: !1, line: 1160, baseType: !343, size: 1, align: 64, offset: 35)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "Removable", scope: !1037, file: !1, line: 1161, baseType: !343, size: 1, align: 64, offset: 36)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "DockDevice", scope: !1037, file: !1, line: 1162, baseType: !343, size: 1, align: 64, offset: 37)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "UniqueID", scope: !1037, file: !1, line: 1163, baseType: !343, size: 1, align: 64, offset: 38)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "SilentInstall", scope: !1037, file: !1, line: 1164, baseType: !343, size: 1, align: 64, offset: 39)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "RawDeviceOK", scope: !1037, file: !1, line: 1165, baseType: !343, size: 1, align: 64, offset: 40)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "SurpriseRemovalOK", scope: !1037, file: !1, line: 1166, baseType: !343, size: 1, align: 64, offset: 41)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "WakeFromD0", scope: !1037, file: !1, line: 1167, baseType: !343, size: 1, align: 64, offset: 42)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "WakeFromD1", scope: !1037, file: !1, line: 1168, baseType: !343, size: 1, align: 64, offset: 43)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "WakeFromD2", scope: !1037, file: !1, line: 1169, baseType: !343, size: 1, align: 64, offset: 44)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "WakeFromD3", scope: !1037, file: !1, line: 1170, baseType: !343, size: 1, align: 64, offset: 45)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "HardwareDisabled", scope: !1037, file: !1, line: 1171, baseType: !343, size: 1, align: 64, offset: 46)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "NonDynamic", scope: !1037, file: !1, line: 1172, baseType: !343, size: 1, align: 64, offset: 47)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "WarmEjectSupported", scope: !1037, file: !1, line: 1173, baseType: !343, size: 1, align: 64, offset: 48)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !1037, file: !1, line: 1174, baseType: !343, size: 15, align: 64, offset: 49)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "Address", scope: !1037, file: !1, line: 1175, baseType: !343, size: 64, align: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "UINumber", scope: !1037, file: !1, line: 1176, baseType: !343, size: 64, align: 64, offset: 128)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceState", scope: !1037, file: !1, line: 1177, baseType: !1062, size: 224, align: 32, offset: 192)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1063, size: 224, align: 32, elements: !1064)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEVICE_POWER_STATE", file: !1, line: 376, baseType: !133)
!1064 = !{!1065}
!1065 = !DISubrange(count: 7)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "SystemWake", scope: !1037, file: !1, line: 1178, baseType: !1067, size: 32, align: 32, offset: 416)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSTEM_POWER_STATE", file: !1, line: 356, baseType: !141)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceWake", scope: !1037, file: !1, line: 1179, baseType: !1063, size: 32, align: 32, offset: 448)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "D1Latency", scope: !1037, file: !1, line: 1180, baseType: !343, size: 64, align: 64, offset: 512)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "D2Latency", scope: !1037, file: !1, line: 1181, baseType: !343, size: 64, align: 64, offset: 576)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "D3Latency", scope: !1037, file: !1, line: 1182, baseType: !343, size: 64, align: 64, offset: 640)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "FilterResourceRequirements", scope: !830, file: !1, line: 1351, baseType: !1073, size: 64, align: 32)
!1073 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_FilterResourceRequirements_73", file: !1, line: 1283, size: 64, align: 32, elements: !1074)
!1074 = !{!1075}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "IoResourceRequirementList", scope: !1073, file: !1, line: 1284, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIO_RESOURCE_REQUIREMENTS_LIST", file: !1, line: 611, baseType: !1077)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_RESOURCE_REQUIREMENTS_LIST", file: !1, line: 602, size: 1088, align: 64, elements: !1079)
!1079 = !{!1080, !1081, !1083, !1084, !1085, !1087, !1088}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ListSize", scope: !1078, file: !1, line: 603, baseType: !343, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceType", scope: !1078, file: !1, line: 604, baseType: !1082, size: 32, align: 32, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERFACE_TYPE", file: !1, line: 329, baseType: !151)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "BusNumber", scope: !1078, file: !1, line: 605, baseType: !343, size: 64, align: 64, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "SlotNumber", scope: !1078, file: !1, line: 606, baseType: !343, size: 64, align: 64, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !1078, file: !1, line: 607, baseType: !1086, size: 192, align: 64, offset: 256)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 192, align: 64, elements: !899)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "AlternativeLists", scope: !1078, file: !1, line: 608, baseType: !343, size: 64, align: 64, offset: 448)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "List", scope: !1078, file: !1, line: 609, baseType: !1089, size: 576, align: 64, offset: 512)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1090, size: 576, align: 64, elements: !909)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "IO_RESOURCE_LIST", file: !1, line: 601, baseType: !1091)
!1091 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_RESOURCE_LIST", file: !1, line: 595, size: 576, align: 64, elements: !1092)
!1092 = !{!1093, !1094, !1095, !1096}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !1091, file: !1, line: 596, baseType: !359, size: 16, align: 16)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !1091, file: !1, line: 597, baseType: !359, size: 16, align: 16, offset: 16)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !1091, file: !1, line: 598, baseType: !343, size: 64, align: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptors", scope: !1091, file: !1, line: 599, baseType: !1097, size: 448, align: 64, offset: 128)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1098, size: 448, align: 64, elements: !909)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "IO_RESOURCE_DESCRIPTOR", file: !1, line: 594, baseType: !1099)
!1099 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_RESOURCE_DESCRIPTOR", file: !1, line: 585, size: 448, align: 64, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1104, !1105, !1106, !1107}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "Option", scope: !1099, file: !1, line: 586, baseType: !379, size: 8, align: 8)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !1099, file: !1, line: 587, baseType: !379, size: 8, align: 8, offset: 8)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "ShareDisposition", scope: !1099, file: !1, line: 588, baseType: !379, size: 8, align: 8, offset: 16)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "Spare1", scope: !1099, file: !1, line: 589, baseType: !379, size: 8, align: 8, offset: 24)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !1099, file: !1, line: 590, baseType: !359, size: 16, align: 16, offset: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "Spare2", scope: !1099, file: !1, line: 591, baseType: !359, size: 16, align: 16, offset: 48)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1099, file: !1, line: 592, baseType: !1108, size: 384, align: 64, offset: 64)
!1108 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_u_24", file: !1, line: 573, size: 384, align: 64, elements: !1109)
!1109 = !{!1110, !1118, !1125, !1130, !1135, !1142, !1146, !1153, !1158, !1166}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "Port", scope: !1108, file: !1, line: 574, baseType: !1111, size: 384, align: 64)
!1111 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Port_25", file: !1, line: 524, size: 384, align: 64, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1117}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !1111, file: !1, line: 525, baseType: !343, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "Alignment", scope: !1111, file: !1, line: 526, baseType: !343, size: 64, align: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumAddress", scope: !1111, file: !1, line: 527, baseType: !1116, size: 128, align: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PHYSICAL_ADDRESS", file: !1, line: 60, baseType: !393)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumAddress", scope: !1111, file: !1, line: 528, baseType: !1116, size: 128, align: 64, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "Memory", scope: !1108, file: !1, line: 575, baseType: !1119, size: 384, align: 64)
!1119 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Memory_26", file: !1, line: 530, size: 384, align: 64, elements: !1120)
!1120 = !{!1121, !1122, !1123, !1124}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !1119, file: !1, line: 531, baseType: !343, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "Alignment", scope: !1119, file: !1, line: 532, baseType: !343, size: 64, align: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumAddress", scope: !1119, file: !1, line: 533, baseType: !1116, size: 128, align: 64, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumAddress", scope: !1119, file: !1, line: 534, baseType: !1116, size: 128, align: 64, offset: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "Interrupt", scope: !1108, file: !1, line: 576, baseType: !1126, size: 128, align: 64)
!1126 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Interrupt_27", file: !1, line: 536, size: 128, align: 64, elements: !1127)
!1127 = !{!1128, !1129}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumVector", scope: !1126, file: !1, line: 537, baseType: !343, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumVector", scope: !1126, file: !1, line: 538, baseType: !343, size: 64, align: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "Dma", scope: !1108, file: !1, line: 577, baseType: !1131, size: 128, align: 64)
!1131 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Dma_28", file: !1, line: 540, size: 128, align: 64, elements: !1132)
!1132 = !{!1133, !1134}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumChannel", scope: !1131, file: !1, line: 541, baseType: !343, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumChannel", scope: !1131, file: !1, line: 542, baseType: !343, size: 64, align: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "Generic", scope: !1108, file: !1, line: 578, baseType: !1136, size: 384, align: 64)
!1136 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Generic_29", file: !1, line: 544, size: 384, align: 64, elements: !1137)
!1137 = !{!1138, !1139, !1140, !1141}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !1136, file: !1, line: 545, baseType: !343, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "Alignment", scope: !1136, file: !1, line: 546, baseType: !343, size: 64, align: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumAddress", scope: !1136, file: !1, line: 547, baseType: !1116, size: 128, align: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumAddress", scope: !1136, file: !1, line: 548, baseType: !1116, size: 128, align: 64, offset: 256)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "DevicePrivate", scope: !1108, file: !1, line: 579, baseType: !1143, size: 192, align: 64)
