; ModuleID = '<stdin>'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.11.0"

%struct._DEVICE_OBJECT = type { i16, i16, i64, %struct._DRIVER_OBJECT*, %struct._DEVICE_OBJECT*, %struct._DEVICE_OBJECT*, %struct._IRP*, %struct._IO_TIMER*, i64, i64, %struct._VPB*, i8*, i64, i8, %union.__anonunion_Queue_43, i64, %struct._KDEVICE_QUEUE, %struct._KDPC, i64, i8*, %struct._KEVENT, i16, i16, %struct._DEVOBJ_EXTENSION*, i8* }
%struct._DRIVER_OBJECT = type { i16, i16, %struct._DEVICE_OBJECT*, i64, i8*, i64, i8*, %struct._DRIVER_EXTENSION*, %struct._UNICODE_STRING, %struct._UNICODE_STRING*, %struct._FAST_IO_DISPATCH*, i64 (%struct._DRIVER_OBJECT*, %struct._UNICODE_STRING*)*, void (%struct._DEVICE_OBJECT*, %struct._IRP*)*, void (%struct._DRIVER_OBJECT*)*, [28 x i64 (%struct._DEVICE_OBJECT*, %struct._IRP*)*] }
%struct._DRIVER_EXTENSION = type { %struct._DRIVER_OBJECT*, i64 (%struct._DRIVER_OBJECT*, %struct._DEVICE_OBJECT*)*, i64, %struct._UNICODE_STRING }
%struct._UNICODE_STRING = type { i16, i16, i16* }

!181 = !DIEnumerator(name: "DiskController", value: 13)
!182 = !DIEnumerator(name: "TapeController", value: 14)
!183 = !DIEnumerator(name: "CdromController", value: 15)
!184 = !DIEnumerator(name: "WormController", value: 16)
!185 = !DIEnumerator(name: "SerialController", value: 17)
!186 = !DIEnumerator(name: "NetworkController", value: 18)
!187 = !DIEnumerator(name: "DisplayController", value: 19)
!188 = !DIEnumerator(name: "ParallelController", value: 20)
!189 = !DIEnumerator(name: "PointerController", value: 21)
!190 = !DIEnumerator(name: "KeyboardController", value: 22)
!191 = !DIEnumerator(name: "AudioController", value: 23)
!192 = !DIEnumerator(name: "OtherController", value: 24)
!193 = !DIEnumerator(name: "DiskPeripheral", value: 25)
!194 = !DIEnumerator(name: "FloppyDiskPeripheral", value: 26)
!195 = !DIEnumerator(name: "TapePeripheral", value: 27)
!196 = !DIEnumerator(name: "ModemPeripheral", value: 28)
!197 = !DIEnumerator(name: "MonitorPeripheral", value: 29)
!198 = !DIEnumerator(name: "PrinterPeripheral", value: 30)
!199 = !DIEnumerator(name: "PointerPeripheral", value: 31)
!200 = !DIEnumerator(name: "KeyboardPeripheral", value: 32)
!201 = !DIEnumerator(name: "TerminalPeripheral", value: 33)
!202 = !DIEnumerator(name: "OtherPeripheral", value: 34)
!203 = !DIEnumerator(name: "LinePeripheral", value: 35)
!204 = !DIEnumerator(name: "NetworkPeripheral", value: 36)
!205 = !DIEnumerator(name: "SystemMemory", value: 37)
!206 = !DIEnumerator(name: "DockingInformation", value: 38)
!207 = !DIEnumerator(name: "RealModeIrqRoutingTable", value: 39)
!208 = !DIEnumerator(name: "MaximumType", value: 40)
!209 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_EVENT_TYPE", file: !1, line: 58, size: 32, align: 32, elements: !210)
!210 = !{!211, !212}
!211 = !DIEnumerator(name: "NotificationEvent", value: 0)
!212 = !DIEnumerator(name: "SynchronizationEvent", value: 1)
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_KWAIT_REASON", file: !1, line: 603, size: 32, align: 32, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242}
!215 = !DIEnumerator(name: "Executive", value: 0)
!216 = !DIEnumerator(name: "FreePage", value: 1)
!217 = !DIEnumerator(name: "PageIn", value: 2)
!218 = !DIEnumerator(name: "PoolAllocation", value: 3)
!219 = !DIEnumerator(name: "DelayExecution", value: 4)
!220 = !DIEnumerator(name: "Suspended", value: 5)
!221 = !DIEnumerator(name: "UserRequest", value: 6)
!222 = !DIEnumerator(name: "WrExecutive", value: 7)
!223 = !DIEnumerator(name: "WrFreePage", value: 8)
!224 = !DIEnumerator(name: "WrPageIn", value: 9)
!225 = !DIEnumerator(name: "WrPoolAllocation", value: 10)
!226 = !DIEnumerator(name: "WrDelayExecution", value: 11)
!227 = !DIEnumerator(name: "WrSuspended", value: 12)
!228 = !DIEnumerator(name: "WrUserRequest", value: 13)
!229 = !DIEnumerator(name: "WrEventPair", value: 14)
!230 = !DIEnumerator(name: "WrQueue", value: 15)
!231 = !DIEnumerator(name: "WrLpcReceive", value: 16)
!232 = !DIEnumerator(name: "WrLpcReply", value: 17)
!233 = !DIEnumerator(name: "WrVirtualMemory", value: 18)
!234 = !DIEnumerator(name: "WrPageOut", value: 19)
!235 = !DIEnumerator(name: "WrRendezvous", value: 20)
!236 = !DIEnumerator(name: "Spare2", value: 21)
!237 = !DIEnumerator(name: "Spare3", value: 22)
!238 = !DIEnumerator(name: "Spare4", value: 23)
!239 = !DIEnumerator(name: "Spare5", value: 24)
!240 = !DIEnumerator(name: "Spare6", value: 25)
!241 = !DIEnumerator(name: "WrKernel", value: 26)
!242 = !DIEnumerator(name: "MaximumWaitReason", value: 27)
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_MEMORY_CACHING_TYPE", file: !1, line: 669, size: 32, align: 32, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251}
!245 = !DIEnumerator(name: "MmNonCached", value: 0)
!246 = !DIEnumerator(name: "MmCached", value: 1)
!247 = !DIEnumerator(name: "MmWriteCombined", value: 2)
!248 = !DIEnumerator(name: "MmHardwareCoherentCached", value: 3)
!249 = !DIEnumerator(name: "MmNonCachedUnordered", value: 4)
!250 = !DIEnumerator(name: "MmUSWCCached", value: 5)
!251 = !DIEnumerator(name: "MmMaximumCacheType", value: 6)
!252 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_MM_PAGE_PRIORITY", file: !1, line: 734, size: 32, align: 32, elements: !253)
!253 = !{!254, !255, !256}
!254 = !DIEnumerator(name: "LowPagePriority", value: 0)
!255 = !DIEnumerator(name: "NormalPagePriority", value: 16)
!256 = !DIEnumerator(name: "HighPagePriority", value: 32)
!257 = !{!258, !548, !1397, !287, !625, !1398, !283, !1399, !1400, !1350, !1364, !274, !1409, !1411, !300, !1414, !329}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DEVICE_EXTENSION", file: !1, line: 1385, size: 832, align: 64, elements: !260)
!260 = !{!261, !1339, !1340, !1341, !1342, !1348, !1349, !1363, !1387, !1391, !1392, !1393, !1394, !1395, !1396}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Self", scope: !259, file: !1, line: 1386, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PDEVICE_OBJECT", file: !1, line: 928, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DEVICE_OBJECT", file: !1, line: 900, size: 2944, align: 64, elements: !265)
!265 = !{!266, !269, !272, !275, !1264, !1265, !1266, !1267, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1314, !1315, !1324, !1326, !1327, !1328, !1329, !1330, !1331, !1338}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !264, file: !1, line: 901, baseType: !267, size: 16, align: 16)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "CSHORT", file: !1, line: 33, baseType: !268)
!268 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !264, file: !1, line: 902, baseType: !270, size: 16, align: 16, offset: 16)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "USHORT", file: !1, line: 26, baseType: !271)
!271 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ReferenceCount", scope: !264, file: !1, line: 903, baseType: !273, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "LONG", file: !1, line: 19, baseType: !274)
!274 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "DriverObject", scope: !264, file: !1, line: 904, baseType: !276, size: 64, align: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DRIVER_OBJECT", file: !1, line: 941, size: 2688, align: 64, elements: !278)
!278 = !{!279, !280, !281, !282, !285, !288, !289, !290, !313, !314, !317, !1247, !1251, !1252, !1256}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !277, file: !1, line: 942, baseType: !267, size: 16, align: 16)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !277, file: !1, line: 943, baseType: !267, size: 16, align: 16, offset: 16)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !277, file: !1, line: 944, baseType: !262, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !277, file: !1, line: 945, baseType: !283, size: 64, align: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "ULONG", file: !1, line: 27, baseType: !284)
!284 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "DriverStart", scope: !277, file: !1, line: 946, baseType: !286, size: 64, align: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PVOID", file: !1, line: 16, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "DriverSize", scope: !277, file: !1, line: 947, baseType: !283, size: 64, align: 64, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "DriverSection", scope: !277, file: !1, line: 948, baseType: !286, size: 64, align: 64, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "DriverExtension", scope: !277, file: !1, line: 949, baseType: !291, size: 64, align: 64, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "PDRIVER_EXTENSION", file: !1, line: 940, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DRIVER_EXTENSION", file: !1, line: 934, size: 320, align: 64, elements: !294)
!294 = !{!295, !296, !301, !302}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "DriverObject", scope: !293, file: !1, line: 935, baseType: !276, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "AddDevice", scope: !293, file: !1, line: 936, baseType: !297, size: 64, align: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!300, !276, !263}
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "NTSTATUS", file: !1, line: 35, baseType: !273)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !293, file: !1, line: 937, baseType: !283, size: 64, align: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ServiceKeyName", scope: !293, file: !1, line: 938, baseType: !303, size: 128, align: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "UNICODE_STRING", file: !1, line: 77, baseType: !304)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "_UNICODE_STRING", file: !1, line: 72, size: 128, align: 64, elements: !305)
!305 = !{!306, !307, !308}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !304, file: !1, line: 73, baseType: !270, size: 16, align: 16)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumLength", scope: !304, file: !1, line: 74, baseType: !270, size: 16, align: 16, offset: 16)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !304, file: !1, line: 75, baseType: !309, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWSTR", file: !1, line: 21, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "WCHAR", file: !1, line: 20, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !1, line: 12, baseType: !271)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "DriverName", scope: !277, file: !1, line: 950, baseType: !303, size: 128, align: 64, offset: 448)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "HardwareDatabase", scope: !277, file: !1, line: 951, baseType: !315, size: 64, align: 64, offset: 576)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PUNICODE_STRING", file: !1, line: 78, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoDispatch", scope: !277, file: !1, line: 952, baseType: !318, size: 64, align: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFAST_IO_DISPATCH", file: !1, line: 858, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FAST_IO_DISPATCH", file: !1, line: 789, size: 1792, align: 64, elements: !321)
!321 = !{!322, !323, !438, !442, !443, !456, !469, !476, !480, !484, !488, !492, !496, !497, !501, !515, !564, !581, !585, !586, !590, !596, !597, !598, !599, !1238, !1242, !1246}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfFastIoDispatch", scope: !320, file: !1, line: 790, baseType: !283, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoCheckIfPossible", scope: !320, file: !1, line: 791, baseType: !324, size: 64, align: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!327, !330, !425, !283, !327, !283, !327, !427, !263}
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !1, line: 79, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "UCHAR", file: !1, line: 25, baseType: !329)
!329 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE_OBJECT", file: !1, line: 972, size: 1728, align: 64, elements: !332)
!332 = !{!333, !334, !335, !336, !353, !354, !355, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !394, !395, !396, !397, !417, !418}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !331, file: !1, line: 973, baseType: !267, size: 16, align: 16)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !331, file: !1, line: 974, baseType: !267, size: 16, align: 16, offset: 16)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !331, file: !1, line: 975, baseType: !262, size: 64, align: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Vpb", scope: !331, file: !1, line: 976, baseType: !337, size: 64, align: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PVPB", file: !1, line: 883, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "_VPB", file: !1, line: 872, size: 832, align: 64, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346, !347, !348, !349}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !339, file: !1, line: 873, baseType: !267, size: 16, align: 16)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !339, file: !1, line: 874, baseType: !267, size: 16, align: 16, offset: 16)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !339, file: !1, line: 875, baseType: !270, size: 16, align: 16, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "VolumeLabelLength", scope: !339, file: !1, line: 876, baseType: !270, size: 16, align: 16, offset: 48)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !339, file: !1, line: 877, baseType: !263, size: 64, align: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "RealDevice", scope: !339, file: !1, line: 878, baseType: !263, size: 64, align: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", scope: !339, file: !1, line: 879, baseType: !283, size: 64, align: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ReferenceCount", scope: !339, file: !1, line: 880, baseType: !283, size: 64, align: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "VolumeLabel", scope: !339, file: !1, line: 881, baseType: !350, size: 512, align: 16, offset: 320)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 512, align: 16, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "FsContext", scope: !331, file: !1, line: 977, baseType: !286, size: 64, align: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "FsContext2", scope: !331, file: !1, line: 978, baseType: !286, size: 64, align: 64, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "SectionObjectPointer", scope: !331, file: !1, line: 979, baseType: !356, size: 64, align: 64, offset: 320)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSECTION_OBJECT_POINTERS", file: !1, line: 966, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECTION_OBJECT_POINTERS", file: !1, line: 965, baseType: !359)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SECTION_OBJECT_POINTERS", file: !1, line: 960, size: 192, align: 64, elements: !360)
!360 = !{!361, !362, !363}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "DataSectionObject", scope: !359, file: !1, line: 961, baseType: !286, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "SharedCacheMap", scope: !359, file: !1, line: 962, baseType: !286, size: 64, align: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ImageSectionObject", scope: !359, file: !1, line: 963, baseType: !286, size: 64, align: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateCacheMap", scope: !331, file: !1, line: 980, baseType: !286, size: 64, align: 64, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "FinalStatus", scope: !331, file: !1, line: 981, baseType: !300, size: 64, align: 64, offset: 448)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "RelatedFileObject", scope: !331, file: !1, line: 982, baseType: !330, size: 64, align: 64, offset: 512)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "LockOperation", scope: !331, file: !1, line: 983, baseType: !327, size: 8, align: 8, offset: 576)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "DeletePending", scope: !331, file: !1, line: 984, baseType: !327, size: 8, align: 8, offset: 584)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ReadAccess", scope: !331, file: !1, line: 985, baseType: !327, size: 8, align: 8, offset: 592)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "WriteAccess", scope: !331, file: !1, line: 986, baseType: !327, size: 8, align: 8, offset: 600)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteAccess", scope: !331, file: !1, line: 987, baseType: !327, size: 8, align: 8, offset: 608)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "SharedRead", scope: !331, file: !1, line: 988, baseType: !327, size: 8, align: 8, offset: 616)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "SharedWrite", scope: !331, file: !1, line: 989, baseType: !327, size: 8, align: 8, offset: 624)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "SharedDelete", scope: !331, file: !1, line: 990, baseType: !327, size: 8, align: 8, offset: 632)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !331, file: !1, line: 991, baseType: !283, size: 64, align: 64, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "FileName", scope: !331, file: !1, line: 992, baseType: !303, size: 128, align: 64, offset: 704)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentByteOffset", scope: !331, file: !1, line: 993, baseType: !378, size: 128, align: 64, offset: 832)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "LARGE_INTEGER", file: !1, line: 50, baseType: !379)
!379 = !DICompositeType(tag: DW_TAG_union_type, name: "_LARGE_INTEGER", file: !1, line: 45, size: 128, align: 64, elements: !380)
!380 = !{!381, !386, !391}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField1", scope: !379, file: !1, line: 46, baseType: !382, size: 128, align: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct____missing_field_name_1", file: !1, line: 37, size: 128, align: 64, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "LowPart", scope: !382, file: !1, line: 38, baseType: !283, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "HighPart", scope: !382, file: !1, line: 39, baseType: !273, size: 64, align: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !379, file: !1, line: 47, baseType: !387, size: 128, align: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_u_2", file: !1, line: 41, size: 128, align: 64, elements: !388)
!388 = !{!389, !390}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "LowPart", scope: !387, file: !1, line: 42, baseType: !283, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "HighPart", scope: !387, file: !1, line: 43, baseType: !273, size: 64, align: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "QuadPart", scope: !379, file: !1, line: 48, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "LONGLONG", file: !1, line: 36, baseType: !393)
!393 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Waiters", scope: !331, file: !1, line: 994, baseType: !283, size: 64, align: 64, offset: 960)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Busy", scope: !331, file: !1, line: 995, baseType: !283, size: 64, align: 64, offset: 1024)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "LastLock", scope: !331, file: !1, line: 996, baseType: !286, size: 64, align: 64, offset: 1088)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", scope: !331, file: !1, line: 997, baseType: !398, size: 256, align: 64, offset: 1152)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "KEVENT", file: !1, line: 660, baseType: !399)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "_KEVENT", file: !1, line: 657, size: 256, align: 64, elements: !400)
!400 = !{!401}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !399, file: !1, line: 658, baseType: !402, size: 256, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "DISPATCHER_HEADER", file: !1, line: 642, baseType: !403)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DISPATCHER_HEADER", file: !1, line: 634, size: 256, align: 64, elements: !404)
!404 = !{!405, !406, !407, !408, !409, !410}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !403, file: !1, line: 635, baseType: !328, size: 8, align: 8)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Absolute", scope: !403, file: !1, line: 636, baseType: !328, size: 8, align: 8, offset: 8)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !403, file: !1, line: 637, baseType: !328, size: 8, align: 8, offset: 16)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Inserted", scope: !403, file: !1, line: 638, baseType: !328, size: 8, align: 8, offset: 24)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "SignalState", scope: !403, file: !1, line: 639, baseType: !273, size: 64, align: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "WaitListHead", scope: !403, file: !1, line: 640, baseType: !411, size: 128, align: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIST_ENTRY", file: !1, line: 85, baseType: !412)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LIST_ENTRY", file: !1, line: 81, size: 128, align: 64, elements: !413)
!413 = !{!414, !416}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Flink", scope: !412, file: !1, line: 82, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Blink", scope: !412, file: !1, line: 83, baseType: !415, size: 64, align: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Event", scope: !331, file: !1, line: 998, baseType: !398, size: 256, align: 64, offset: 1408)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "CompletionContext", scope: !331, file: !1, line: 999, baseType: !419, size: 64, align: 64, offset: 1664)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIO_COMPLETION_CONTEXT", file: !1, line: 971, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_COMPLETION_CONTEXT", file: !1, line: 967, size: 128, align: 64, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Port", scope: !421, file: !1, line: 968, baseType: !286, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Key", scope: !421, file: !1, line: 969, baseType: !286, size: 64, align: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PLARGE_INTEGER", file: !1, line: 51, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIO_STATUS_BLOCK", file: !1, line: 222, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_STATUS_BLOCK", file: !1, line: 217, size: 128, align: 64, elements: !430)
!430 = !{!431, !436}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField4", scope: !429, file: !1, line: 218, baseType: !432, size: 64, align: 64)
!432 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_6", file: !1, line: 213, size: 64, align: 64, elements: !433)
!433 = !{!434, !435}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !432, file: !1, line: 214, baseType: !300, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !432, file: !1, line: 215, baseType: !286, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Information", scope: !429, file: !1, line: 219, baseType: !437, size: 64, align: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "ULONG_PTR", file: !1, line: 13, baseType: !284)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoRead", scope: !320, file: !1, line: 795, baseType: !439, size: 64, align: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!327, !330, !425, !283, !327, !283, !286, !427, !263}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoWrite", scope: !320, file: !1, line: 798, baseType: !439, size: 64, align: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoQueryBasicInfo", scope: !320, file: !1, line: 801, baseType: !444, size: 64, align: 64, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!327, !330, !327, !447, !427, !263}
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFILE_BASIC_INFORMATION", file: !1, line: 270, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE_BASIC_INFORMATION", file: !1, line: 263, size: 576, align: 64, elements: !450)
!450 = !{!451, !452, !453, !454, !455}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "CreationTime", scope: !449, file: !1, line: 264, baseType: !378, size: 128, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessTime", scope: !449, file: !1, line: 265, baseType: !378, size: 128, align: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "LastWriteTime", scope: !449, file: !1, line: 266, baseType: !378, size: 128, align: 64, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ChangeTime", scope: !449, file: !1, line: 267, baseType: !378, size: 128, align: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "FileAttributes", scope: !449, file: !1, line: 268, baseType: !283, size: 64, align: 64, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoQueryStandardInfo", scope: !320, file: !1, line: 804, baseType: !457, size: 64, align: 64, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!327, !330, !327, !460, !427, !263}
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFILE_STANDARD_INFORMATION", file: !1, line: 278, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE_STANDARD_INFORMATION", file: !1, line: 271, size: 384, align: 64, elements: !463)
!463 = !{!464, !465, !466, !467, !468}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationSize", scope: !462, file: !1, line: 272, baseType: !378, size: 128, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "EndOfFile", scope: !462, file: !1, line: 273, baseType: !378, size: 128, align: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfLinks", scope: !462, file: !1, line: 274, baseType: !283, size: 64, align: 64, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "DeletePending", scope: !462, file: !1, line: 275, baseType: !327, size: 8, align: 8, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Directory", scope: !462, file: !1, line: 276, baseType: !327, size: 8, align: 8, offset: 328)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoLock", scope: !320, file: !1, line: 807, baseType: !470, size: 64, align: 64, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!327, !330, !425, !425, !473, !283, !327, !327, !427, !263}
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PEPROCESS", file: !1, line: 111, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, align: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "_EPROCESS", file: !1, line: 110, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoUnlockSingle", scope: !320, file: !1, line: 811, baseType: !477, size: 64, align: 64, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!327, !330, !425, !425, !473, !283, !427, !263}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoUnlockAll", scope: !320, file: !1, line: 814, baseType: !481, size: 64, align: 64, offset: 512)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!327, !330, !473, !427, !263}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoUnlockAllByKey", scope: !320, file: !1, line: 816, baseType: !485, size: 64, align: 64, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!327, !330, !286, !283, !427, !263}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoDeviceControl", scope: !320, file: !1, line: 818, baseType: !489, size: 64, align: 64, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!327, !330, !327, !286, !283, !286, !283, !283, !427, !263}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "AcquireFileForNtCreateSection", scope: !320, file: !1, line: 822, baseType: !493, size: 64, align: 64, offset: 704)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !330}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ReleaseFileForNtCreateSection", scope: !320, file: !1, line: 823, baseType: !493, size: 64, align: 64, offset: 768)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoDetachDevice", scope: !320, file: !1, line: 824, baseType: !498, size: 64, align: 64, offset: 832)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !263, !263}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoQueryNetworkOpenInfo", scope: !320, file: !1, line: 825, baseType: !502, size: 64, align: 64, offset: 896)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64, align: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!327, !330, !327, !505, !428, !263}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE_NETWORK_OPEN_INFORMATION", file: !1, line: 279, size: 832, align: 64, elements: !507)
!507 = !{!508, !509, !510, !511, !512, !513, !514}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "CreationTime", scope: !506, file: !1, line: 280, baseType: !378, size: 128, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessTime", scope: !506, file: !1, line: 281, baseType: !378, size: 128, align: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "LastWriteTime", scope: !506, file: !1, line: 282, baseType: !378, size: 128, align: 64, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ChangeTime", scope: !506, file: !1, line: 283, baseType: !378, size: 128, align: 64, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationSize", scope: !506, file: !1, line: 284, baseType: !378, size: 128, align: 64, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "EndOfFile", scope: !506, file: !1, line: 285, baseType: !378, size: 128, align: 64, offset: 640)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "FileAttributes", scope: !506, file: !1, line: 286, baseType: !283, size: 64, align: 64, offset: 768)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "AcquireForModWrite", scope: !320, file: !1, line: 828, baseType: !516, size: 64, align: 64, offset: 960)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!300, !330, !425, !519, !263}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ERESOURCE", file: !1, line: 720, size: 896, align: 64, elements: !522)
!522 = !{!523, !524, !536, !538, !539, !546, !549, !554, !555, !556, !557, !562}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "SystemResourcesList", scope: !521, file: !1, line: 721, baseType: !411, size: 128, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "OwnerTable", scope: !521, file: !1, line: 722, baseType: !525, size: 64, align: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWNER_ENTRY", file: !1, line: 715, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "_OWNER_ENTRY", file: !1, line: 710, size: 128, align: 64, elements: !528)
!528 = !{!529, !531}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "OwnerThread", scope: !527, file: !1, line: 711, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "ERESOURCE_THREAD", file: !1, line: 705, baseType: !437)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField10", scope: !527, file: !1, line: 712, baseType: !532, size: 64, align: 64, offset: 64)
!532 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_38", file: !1, line: 706, size: 64, align: 64, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "OwnerCount", scope: !532, file: !1, line: 707, baseType: !273, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "TableSize", scope: !532, file: !1, line: 708, baseType: !283, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ActiveCount", scope: !521, file: !1, line: 723, baseType: !537, size: 16, align: 16, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHORT", file: !1, line: 18, baseType: !268)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Flag", scope: !521, file: !1, line: 724, baseType: !270, size: 16, align: 16, offset: 208)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "SharedWaiters", scope: !521, file: !1, line: 725, baseType: !540, size: 64, align: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKSEMAPHORE", file: !1, line: 667, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "_KSEMAPHORE", file: !1, line: 663, size: 320, align: 64, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !542, file: !1, line: 664, baseType: !402, size: 256, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Limit", scope: !542, file: !1, line: 665, baseType: !273, size: 64, align: 64, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ExclusiveWaiters", scope: !521, file: !1, line: 726, baseType: !547, size: 64, align: 64, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKEVENT", file: !1, line: 661, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "OwnerThreads", scope: !521, file: !1, line: 727, baseType: !550, size: 256, align: 64, offset: 384)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 256, align: 64, elements: !552)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "OWNER_ENTRY", file: !1, line: 714, baseType: !527)
!552 = !{!553}
!553 = !DISubrange(count: 2)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ContentionCount", scope: !521, file: !1, line: 728, baseType: !283, size: 64, align: 64, offset: 640)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfSharedWaiters", scope: !521, file: !1, line: 729, baseType: !270, size: 16, align: 16, offset: 704)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfExclusiveWaiters", scope: !521, file: !1, line: 730, baseType: !270, size: 16, align: 16, offset: 720)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField11", scope: !521, file: !1, line: 731, baseType: !558, size: 64, align: 64, offset: 768)
!558 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_39", file: !1, line: 716, size: 64, align: 64, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Address", scope: !558, file: !1, line: 717, baseType: !286, size: 64, align: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "CreatorBackTraceIndex", scope: !558, file: !1, line: 718, baseType: !437, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "SpinLock", scope: !521, file: !1, line: 732, baseType: !563, size: 64, align: 64, offset: 832)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPIN_LOCK", file: !1, line: 199, baseType: !437)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "MdlRead", scope: !320, file: !1, line: 830, baseType: !565, size: 64, align: 64, offset: 1024)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64, align: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!327, !330, !425, !283, !283, !568, !427, !263}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "PMDL", file: !1, line: 165, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64, align: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MDL", file: !1, line: 154, size: 448, align: 64, elements: !572)
!572 = !{!573, !574, !575, !576, !577, !578, !579, !580}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !571, file: !1, line: 155, baseType: !570, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !571, file: !1, line: 156, baseType: !267, size: 16, align: 16, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "MdlFlags", scope: !571, file: !1, line: 157, baseType: !267, size: 16, align: 16, offset: 80)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Process", scope: !571, file: !1, line: 158, baseType: !474, size: 64, align: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "MappedSystemVa", scope: !571, file: !1, line: 159, baseType: !286, size: 64, align: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "StartVa", scope: !571, file: !1, line: 160, baseType: !286, size: 64, align: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ByteCount", scope: !571, file: !1, line: 161, baseType: !283, size: 64, align: 64, offset: 320)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ByteOffset", scope: !571, file: !1, line: 162, baseType: !283, size: 64, align: 64, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "MdlReadComplete", scope: !320, file: !1, line: 833, baseType: !582, size: 64, align: 64, offset: 1088)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64, align: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!327, !330, !569, !263}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "PrepareMdlWrite", scope: !320, file: !1, line: 834, baseType: !565, size: 64, align: 64, offset: 1152)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "MdlWriteComplete", scope: !320, file: !1, line: 837, baseType: !587, size: 64, align: 64, offset: 1216)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!327, !330, !425, !569, !263}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoReadCompressed", scope: !320, file: !1, line: 839, baseType: !591, size: 64, align: 64, offset: 1280)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!327, !330, !425, !283, !283, !286, !568, !427, !594, !283, !263}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64, align: 64)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "_COMPRESSED_DATA_INFO", file: !1, line: 788, flags: DIFlagFwdDecl)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoWriteCompressed", scope: !320, file: !1, line: 843, baseType: !591, size: 64, align: 64, offset: 1344)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "MdlReadCompleteCompressed", scope: !320, file: !1, line: 847, baseType: !582, size: 64, align: 64, offset: 1408)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "MdlWriteCompleteCompressed", scope: !320, file: !1, line: 849, baseType: !587, size: 64, align: 64, offset: 1472)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoQueryOpen", scope: !320, file: !1, line: 851, baseType: !600, size: 64, align: 64, offset: 1536)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!327, !603, !1237, !263}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64, align: 64)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IRP", file: !1, line: 1044, size: 1728, align: 64, elements: !605)
!605 = !{!606, !607, !608, !609, !610, !616, !617, !619, !623, !624, !626, !627, !628, !630, !631, !632, !633, !634, !646, !650, !651}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !604, file: !1, line: 1045, baseType: !267, size: 16, align: 16)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !604, file: !1, line: 1046, baseType: !270, size: 16, align: 16, offset: 16)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "MdlAddress", scope: !604, file: !1, line: 1047, baseType: !569, size: 64, align: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !604, file: !1, line: 1048, baseType: !283, size: 64, align: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "AssociatedIrp", scope: !604, file: !1, line: 1049, baseType: !611, size: 64, align: 64, offset: 192)
!611 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_AssociatedIrp_44", file: !1, line: 1002, size: 64, align: 64, elements: !612)
!612 = !{!613, !614, !615}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "MasterIrp", scope: !611, file: !1, line: 1003, baseType: !603, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "IrpCount", scope: !611, file: !1, line: 1004, baseType: !273, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "SystemBuffer", scope: !611, file: !1, line: 1005, baseType: !286, size: 64, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ThreadListEntry", scope: !604, file: !1, line: 1050, baseType: !411, size: 128, align: 64, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "IoStatus", scope: !604, file: !1, line: 1051, baseType: !618, size: 128, align: 64, offset: 384)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "IO_STATUS_BLOCK", file: !1, line: 221, baseType: !429)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "RequestorMode", scope: !604, file: !1, line: 1052, baseType: !620, size: 8, align: 8, offset: 512)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "KPROCESSOR_MODE", file: !1, line: 116, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCHAR", file: !1, line: 32, baseType: !622)
!622 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "PendingReturned", scope: !604, file: !1, line: 1053, baseType: !327, size: 8, align: 8, offset: 520)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "StackCount", scope: !604, file: !1, line: 1054, baseType: !625, size: 8, align: 8, offset: 528)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR", file: !1, line: 17, baseType: !622)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentLocation", scope: !604, file: !1, line: 1055, baseType: !625, size: 8, align: 8, offset: 536)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", scope: !604, file: !1, line: 1056, baseType: !327, size: 8, align: 8, offset: 544)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "CancelIrql", scope: !604, file: !1, line: 1057, baseType: !629, size: 8, align: 8, offset: 552)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "KIRQL", file: !1, line: 105, baseType: !328)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ApcEnvironment", scope: !604, file: !1, line: 1058, baseType: !621, size: 8, align: 8, offset: 560)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationFlags", scope: !604, file: !1, line: 1059, baseType: !328, size: 8, align: 8, offset: 568)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "UserIosb", scope: !604, file: !1, line: 1060, baseType: !427, size: 64, align: 64, offset: 576)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "UserEvent", scope: !604, file: !1, line: 1061, baseType: !547, size: 64, align: 64, offset: 640)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Overlay", scope: !604, file: !1, line: 1062, baseType: !635, size: 128, align: 64, offset: 704)
!635 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_Overlay_45", file: !1, line: 1012, size: 128, align: 64, elements: !636)
!636 = !{!637, !645}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "AsynchronousParameters", scope: !635, file: !1, line: 1013, baseType: !638, size: 128, align: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_AsynchronousParameters_46", file: !1, line: 1007, size: 128, align: 64, elements: !639)
!639 = !{!640, !644}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "UserApcRoutine", scope: !638, file: !1, line: 1008, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !286, !427, !283}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "UserApcContext", scope: !638, file: !1, line: 1010, baseType: !286, size: 64, align: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationSize", scope: !635, file: !1, line: 1014, baseType: !378, size: 128, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "CancelRoutine", scope: !604, file: !1, line: 1063, baseType: !647, size: 64, align: 64, offset: 832)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !263, !603}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "UserBuffer", scope: !604, file: !1, line: 1064, baseType: !286, size: 64, align: 64, offset: 896)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Tail", scope: !604, file: !1, line: 1065, baseType: !652, size: 768, align: 64, offset: 960)
!652 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_Tail_47", file: !1, line: 1039, size: 768, align: 64, elements: !653)
!653 = !{!654, !1203, !1236}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Overlay", scope: !652, file: !1, line: 1040, baseType: !655, size: 640, align: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Overlay_48", file: !1, line: 1032, size: 640, align: 64, elements: !656)
!656 = !{!657, !674, !678, !681, !1202}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField15", scope: !655, file: !1, line: 1033, baseType: !658, size: 256, align: 64)
!658 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_49", file: !1, line: 1019, size: 256, align: 64, elements: !659)
!659 = !{!660, !667}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceQueueEntry", scope: !658, file: !1, line: 1020, baseType: !661, size: 256, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "KDEVICE_QUEUE_ENTRY", file: !1, line: 656, baseType: !662)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "_KDEVICE_QUEUE_ENTRY", file: !1, line: 651, size: 256, align: 64, elements: !663)
!663 = !{!664, !665, !666}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceListEntry", scope: !662, file: !1, line: 652, baseType: !411, size: 128, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "SortKey", scope: !662, file: !1, line: 653, baseType: !283, size: 64, align: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Inserted", scope: !662, file: !1, line: 654, baseType: !327, size: 8, align: 8, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField14", scope: !658, file: !1, line: 1021, baseType: !668, size: 256, align: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct____missing_field_name_50", file: !1, line: 1016, size: 256, align: 64, elements: !669)
!669 = !{!670}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "DriverContext", scope: !668, file: !1, line: 1017, baseType: !671, size: 256, align: 64)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 256, align: 64, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 4)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Thread", scope: !655, file: !1, line: 1034, baseType: !675, size: 64, align: 64, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "PETHREAD", file: !1, line: 109, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64, align: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ETHREAD", file: !1, line: 108, flags: DIFlagFwdDecl)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "AuxiliaryBuffer", scope: !655, file: !1, line: 1035, baseType: !679, size: 64, align: 64, offset: 320)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCHAR", file: !1, line: 23, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField17", scope: !655, file: !1, line: 1036, baseType: !682, size: 192, align: 64, offset: 384)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct____missing_field_name_51", file: !1, line: 1028, size: 192, align: 64, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ListEntry", scope: !682, file: !1, line: 1029, baseType: !411, size: 128, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField16", scope: !682, file: !1, line: 1030, baseType: !686, size: 64, align: 64, offset: 128)
!686 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_52", file: !1, line: 1024, size: 64, align: 64, elements: !687)
!687 = !{!688, !1201}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentStackLocation", scope: !686, file: !1, line: 1025, baseType: !689, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64, align: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_STACK_LOCATION", file: !1, line: 1302, size: 544, align: 32, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !1193, !1194, !1195, !1200}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "MajorFunction", scope: !690, file: !1, line: 1303, baseType: !328, size: 8, align: 8)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "MinorFunction", scope: !690, file: !1, line: 1304, baseType: !328, size: 8, align: 8, offset: 8)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !690, file: !1, line: 1305, baseType: !328, size: 8, align: 8, offset: 16)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !690, file: !1, line: 1306, baseType: !328, size: 8, align: 8, offset: 24)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Parameters", scope: !690, file: !1, line: 1307, baseType: !697, size: 256, align: 32, offset: 32)
!697 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_Parameters_55", file: !1, line: 1273, size: 256, align: 32, elements: !698)
!698 = !{!699, !787, !793, !799, !805, !823, !829, !836, !842, !847, !852, !857, !863, !868, !900, !941, !1041, !1048, !1052, !1057, !1064, !1072, !1076, !1087, !1101, !1179, !1186}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Create", scope: !697, file: !1, line: 1274, baseType: !700, size: 224, align: 32)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Create_56", file: !1, line: 1143, size: 224, align: 32, elements: !701)
!701 = !{!702, !783, !784, !785, !786}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityContext", scope: !700, file: !1, line: 1144, baseType: !703, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIO_SECURITY_CONTEXT", file: !1, line: 871, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64, align: 64)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_SECURITY_CONTEXT", file: !1, line: 865, size: 256, align: 64, elements: !706)
!706 = !{!707, !718, !781, !782}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityQos", scope: !705, file: !1, line: 866, baseType: !708, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSECURITY_QUALITY_OF_SERVICE", file: !1, line: 196, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SECURITY_QUALITY_OF_SERVICE", file: !1, line: 190, size: 128, align: 64, elements: !711)
!711 = !{!712, !713, !715, !717}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !710, file: !1, line: 191, baseType: !283, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ImpersonationLevel", scope: !710, file: !1, line: 192, baseType: !714, size: 32, align: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECURITY_IMPERSONATION_LEVEL", file: !1, line: 188, baseType: !3)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ContextTrackingMode", scope: !710, file: !1, line: 193, baseType: !716, size: 8, align: 8, offset: 96)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECURITY_CONTEXT_TRACKING_MODE", file: !1, line: 189, baseType: !327)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "EffectiveOnly", scope: !710, file: !1, line: 194, baseType: !327, size: 8, align: 8, offset: 104)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "AccessState", scope: !705, file: !1, line: 867, baseType: !719, size: 64, align: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "PACCESS_STATE", file: !1, line: 777, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64, align: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ACCESS_STATE", file: !1, line: 759, size: 1856, align: 64, elements: !722)
!722 = !{!723, !729, !730, !731, !732, !733, !734, !736, !737, !738, !747, !749, !750, !778, !779, !780}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "OperationID", scope: !721, file: !1, line: 760, baseType: !724, size: 128, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "LUID", file: !1, line: 56, baseType: !725)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LUID", file: !1, line: 52, size: 128, align: 64, elements: !726)
!726 = !{!727, !728}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "LowPart", scope: !725, file: !1, line: 53, baseType: !283, size: 64, align: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "HighPart", scope: !725, file: !1, line: 54, baseType: !273, size: 64, align: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityEvaluated", scope: !721, file: !1, line: 761, baseType: !327, size: 8, align: 8, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "GenerateAudit", scope: !721, file: !1, line: 762, baseType: !327, size: 8, align: 8, offset: 136)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "GenerateOnClose", scope: !721, file: !1, line: 763, baseType: !327, size: 8, align: 8, offset: 144)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "PrivilegesAllocated", scope: !721, file: !1, line: 764, baseType: !327, size: 8, align: 8, offset: 152)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !721, file: !1, line: 765, baseType: !283, size: 64, align: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "RemainingDesiredAccess", scope: !721, file: !1, line: 766, baseType: !735, size: 64, align: 64, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "ACCESS_MASK", file: !1, line: 168, baseType: !283)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "PreviouslyGrantedAccess", scope: !721, file: !1, line: 767, baseType: !735, size: 64, align: 64, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "OriginalDesiredAccess", scope: !721, file: !1, line: 768, baseType: !735, size: 64, align: 64, offset: 384)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectSecurityContext", scope: !721, file: !1, line: 769, baseType: !739, size: 256, align: 64, offset: 448)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECURITY_SUBJECT_CONTEXT", file: !1, line: 748, baseType: !740)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SECURITY_SUBJECT_CONTEXT", file: !1, line: 742, size: 256, align: 64, elements: !741)
!741 = !{!742, !744, !745, !746}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ClientToken", scope: !740, file: !1, line: 743, baseType: !743, size: 64, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "PACCESS_TOKEN", file: !1, line: 166, baseType: !286)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ImpersonationLevel", scope: !740, file: !1, line: 744, baseType: !714, size: 32, align: 32, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "PrimaryToken", scope: !740, file: !1, line: 745, baseType: !743, size: 64, align: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessAuditId", scope: !740, file: !1, line: 746, baseType: !286, size: 64, align: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityDescriptor", scope: !721, file: !1, line: 770, baseType: !748, size: 64, align: 64, offset: 704)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSECURITY_DESCRIPTOR", file: !1, line: 167, baseType: !286)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "AuxData", scope: !721, file: !1, line: 771, baseType: !286, size: 64, align: 64, offset: 768)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Privileges", scope: !721, file: !1, line: 772, baseType: !751, size: 704, align: 64, offset: 832)
!751 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_Privileges_40", file: !1, line: 755, size: 704, align: 64, elements: !752)
!752 = !{!753, !768}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "InitialPrivilegeSet", scope: !751, file: !1, line: 756, baseType: !754, size: 704, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "INITIAL_PRIVILEGE_SET", file: !1, line: 754, baseType: !755)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "_INITIAL_PRIVILEGE_SET", file: !1, line: 749, size: 704, align: 64, elements: !756)
!756 = !{!757, !758, !759}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "PrivilegeCount", scope: !755, file: !1, line: 750, baseType: !283, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !755, file: !1, line: 751, baseType: !283, size: 64, align: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Privilege", scope: !755, file: !1, line: 752, baseType: !760, size: 576, align: 32, offset: 128)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 576, align: 32, elements: !766)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "LUID_AND_ATTRIBUTES", file: !1, line: 174, baseType: !762)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LUID_AND_ATTRIBUTES", file: !1, line: 170, size: 192, align: 32, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Luid", scope: !762, file: !1, line: 171, baseType: !724, size: 128, align: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !762, file: !1, line: 172, baseType: !283, size: 64, align: 64, offset: 128)
!766 = !{!767}
!767 = !DISubrange(count: 3)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "PrivilegeSet", scope: !751, file: !1, line: 757, baseType: !769, size: 320, align: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "PRIVILEGE_SET", file: !1, line: 181, baseType: !770)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PRIVILEGE_SET", file: !1, line: 176, size: 320, align: 64, elements: !771)
!771 = !{!772, !773, !774}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "PrivilegeCount", scope: !770, file: !1, line: 177, baseType: !283, size: 64, align: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !770, file: !1, line: 178, baseType: !283, size: 64, align: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "Privilege", scope: !770, file: !1, line: 179, baseType: !775, size: 192, align: 32, offset: 128)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 192, align: 32, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 1)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "AuditPrivileges", scope: !721, file: !1, line: 773, baseType: !327, size: 8, align: 8, offset: 1536)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ObjectName", scope: !721, file: !1, line: 774, baseType: !303, size: 128, align: 64, offset: 1600)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ObjectTypeName", scope: !721, file: !1, line: 775, baseType: !303, size: 128, align: 64, offset: 1728)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "DesiredAccess", scope: !705, file: !1, line: 868, baseType: !735, size: 64, align: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "FullCreateOptions", scope: !705, file: !1, line: 869, baseType: !283, size: 64, align: 64, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "Options", scope: !700, file: !1, line: 1145, baseType: !283, size: 64, align: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "FileAttributes", scope: !700, file: !1, line: 1146, baseType: !270, size: 16, align: 16, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ShareAccess", scope: !700, file: !1, line: 1147, baseType: !270, size: 16, align: 16, offset: 144)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "EaLength", scope: !700, file: !1, line: 1148, baseType: !283, size: 64, align: 64, offset: 160)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Read", scope: !697, file: !1, line: 1275, baseType: !788, size: 256, align: 32)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Read_57", file: !1, line: 1150, size: 256, align: 32, elements: !789)
!789 = !{!790, !791, !792}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !788, file: !1, line: 1151, baseType: !283, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Key", scope: !788, file: !1, line: 1152, baseType: !283, size: 64, align: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ByteOffset", scope: !788, file: !1, line: 1153, baseType: !378, size: 128, align: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Write", scope: !697, file: !1, line: 1276, baseType: !794, size: 256, align: 32)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Write_58", file: !1, line: 1155, size: 256, align: 32, elements: !795)
!795 = !{!796, !797, !798}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !794, file: !1, line: 1156, baseType: !283, size: 64, align: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Key", scope: !794, file: !1, line: 1157, baseType: !283, size: 64, align: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ByteOffset", scope: !794, file: !1, line: 1158, baseType: !378, size: 128, align: 64, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "QueryFile", scope: !697, file: !1, line: 1277, baseType: !800, size: 96, align: 32)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryFile_59", file: !1, line: 1160, size: 96, align: 32, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !800, file: !1, line: 1161, baseType: !283, size: 64, align: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "FileInformationClass", scope: !800, file: !1, line: 1162, baseType: !804, size: 32, align: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE_INFORMATION_CLASS", file: !1, line: 262, baseType: !9)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "SetFile", scope: !697, file: !1, line: 1278, baseType: !806, size: 224, align: 32)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_SetFile_60", file: !1, line: 1173, size: 224, align: 32, elements: !807)
!807 = !{!808, !809, !810, !812}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !806, file: !1, line: 1174, baseType: !283, size: 64, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "FileInformationClass", scope: !806, file: !1, line: 1175, baseType: !804, size: 32, align: 32, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "FileObject", scope: !806, file: !1, line: 1176, baseType: !811, size: 64, align: 64, offset: 96)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFILE_OBJECT", file: !1, line: 1001, baseType: !330)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField19", scope: !806, file: !1, line: 1177, baseType: !813, size: 64, align: 32, offset: 160)
!813 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_61", file: !1, line: 1168, size: 64, align: 32, elements: !814)
!814 = !{!815, !820, !821}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField18", scope: !813, file: !1, line: 1169, baseType: !816, size: 16, align: 8)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct____missing_field_name_62", file: !1, line: 1164, size: 16, align: 8, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ReplaceIfExists", scope: !816, file: !1, line: 1165, baseType: !327, size: 8, align: 8)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "AdvanceOnly", scope: !816, file: !1, line: 1166, baseType: !327, size: 8, align: 8, offset: 8)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !813, file: !1, line: 1170, baseType: !283, size: 64, align: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteHandle", scope: !813, file: !1, line: 1171, baseType: !822, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "HANDLE", file: !1, line: 30, baseType: !287)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "QueryVolume", scope: !697, file: !1, line: 1279, baseType: !824, size: 96, align: 32)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryVolume_63", file: !1, line: 1179, size: 96, align: 32, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !824, file: !1, line: 1180, baseType: !283, size: 64, align: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "FsInformationClass", scope: !824, file: !1, line: 1181, baseType: !828, size: 32, align: 32, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "FS_INFORMATION_CLASS", file: !1, line: 300, baseType: !48)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceIoControl", scope: !697, file: !1, line: 1280, baseType: !830, size: 256, align: 32)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_DeviceIoControl_64", file: !1, line: 1183, size: 256, align: 32, elements: !831)
!831 = !{!832, !833, !834, !835}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "OutputBufferLength", scope: !830, file: !1, line: 1184, baseType: !283, size: 64, align: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "InputBufferLength", scope: !830, file: !1, line: 1185, baseType: !283, size: 64, align: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "IoControlCode", scope: !830, file: !1, line: 1186, baseType: !283, size: 64, align: 64, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "Type3InputBuffer", scope: !830, file: !1, line: 1187, baseType: !286, size: 64, align: 64, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "QuerySecurity", scope: !697, file: !1, line: 1281, baseType: !837, size: 128, align: 32)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QuerySecurity_65", file: !1, line: 1189, size: 128, align: 32, elements: !838)
!838 = !{!839, !841}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityInformation", scope: !837, file: !1, line: 1190, baseType: !840, size: 64, align: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECURITY_INFORMATION", file: !1, line: 197, baseType: !283)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !837, file: !1, line: 1191, baseType: !283, size: 64, align: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "SetSecurity", scope: !697, file: !1, line: 1282, baseType: !843, size: 128, align: 32)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_SetSecurity_66", file: !1, line: 1193, size: 128, align: 32, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityInformation", scope: !843, file: !1, line: 1194, baseType: !840, size: 64, align: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityDescriptor", scope: !843, file: !1, line: 1195, baseType: !748, size: 64, align: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "MountVolume", scope: !697, file: !1, line: 1283, baseType: !848, size: 128, align: 32)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_MountVolume_67", file: !1, line: 1197, size: 128, align: 32, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "Vpb", scope: !848, file: !1, line: 1198, baseType: !337, size: 64, align: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !848, file: !1, line: 1199, baseType: !262, size: 64, align: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "VerifyVolume", scope: !697, file: !1, line: 1284, baseType: !853, size: 128, align: 32)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_VerifyVolume_68", file: !1, line: 1201, size: 128, align: 32, elements: !854)
!854 = !{!855, !856}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Vpb", scope: !853, file: !1, line: 1202, baseType: !337, size: 64, align: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !853, file: !1, line: 1203, baseType: !262, size: 64, align: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "Scsi", scope: !697, file: !1, line: 1285, baseType: !858, size: 64, align: 32)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Scsi_69", file: !1, line: 1205, size: 64, align: 32, elements: !859)
!859 = !{!860}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "Srb", scope: !858, file: !1, line: 1206, baseType: !861, size: 64, align: 64)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64, align: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SCSI_REQUEST_BLOCK", file: !1, line: 785, flags: DIFlagFwdDecl)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "QueryDeviceRelations", scope: !697, file: !1, line: 1286, baseType: !864, size: 32, align: 32)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryDeviceRelations_70", file: !1, line: 1208, size: 32, align: 32, elements: !865)
!865 = !{!866}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !864, file: !1, line: 1209, baseType: !867, size: 32, align: 32)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEVICE_RELATION_TYPE", file: !1, line: 1076, baseType: !59)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "QueryInterface", scope: !697, file: !1, line: 1287, baseType: !869, size: 224, align: 32)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryInterface_71", file: !1, line: 1211, size: 224, align: 32, elements: !870)
!870 = !{!871, !884, !885, !886, !899}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceType", scope: !869, file: !1, line: 1212, baseType: !872, size: 64, align: 64)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64, align: 64)
!873 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !1, line: 103, baseType: !875)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GUID", file: !1, line: 97, size: 192, align: 64, elements: !876)
!876 = !{!877, !878, !879, !880}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !875, file: !1, line: 98, baseType: !284, size: 64, align: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !875, file: !1, line: 99, baseType: !271, size: 16, align: 16, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !875, file: !1, line: 100, baseType: !271, size: 16, align: 16, offset: 80)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !875, file: !1, line: 101, baseType: !881, size: 64, align: 8, offset: 96)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 64, align: 8, elements: !882)
!882 = !{!883}
!883 = !DISubrange(count: 8)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !869, file: !1, line: 1213, baseType: !270, size: 16, align: 16, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !869, file: !1, line: 1214, baseType: !270, size: 16, align: 16, offset: 80)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "Interface", scope: !869, file: !1, line: 1215, baseType: !887, size: 64, align: 64, offset: 96)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "PINTERFACE", file: !1, line: 1091, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64, align: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "_INTERFACE", file: !1, line: 1084, size: 256, align: 64, elements: !890)
!890 = !{!891, !892, !893, !894, !898}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !889, file: !1, line: 1085, baseType: !270, size: 16, align: 16)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !889, file: !1, line: 1086, baseType: !270, size: 16, align: 16, offset: 16)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "Context", scope: !889, file: !1, line: 1087, baseType: !286, size: 64, align: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceReference", scope: !889, file: !1, line: 1088, baseType: !895, size: 64, align: 64, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64, align: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{null, !286}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceDereference", scope: !889, file: !1, line: 1089, baseType: !895, size: 64, align: 64, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceSpecificData", scope: !869, file: !1, line: 1216, baseType: !286, size: 64, align: 64, offset: 160)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceCapabilities", scope: !697, file: !1, line: 1288, baseType: !901, size: 64, align: 32)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_DeviceCapabilities_72", file: !1, line: 1218, size: 64, align: 32, elements: !902)
!902 = !{!903}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "Capabilities", scope: !901, file: !1, line: 1219, baseType: !904, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "PDEVICE_CAPABILITIES", file: !1, line: 1122, baseType: !905)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64, align: 64)
!906 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DEVICE_CAPABILITIES", file: !1, line: 1092, size: 704, align: 64, elements: !907)
!907 = !{!908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !935, !937, !938, !939, !940}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !906, file: !1, line: 1093, baseType: !270, size: 16, align: 16)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !906, file: !1, line: 1094, baseType: !270, size: 16, align: 16, offset: 16)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceD1", scope: !906, file: !1, line: 1095, baseType: !283, size: 1, align: 64, offset: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceD2", scope: !906, file: !1, line: 1096, baseType: !283, size: 1, align: 64, offset: 33)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "LockSupported", scope: !906, file: !1, line: 1097, baseType: !283, size: 1, align: 64, offset: 34)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "EjectSupported", scope: !906, file: !1, line: 1098, baseType: !283, size: 1, align: 64, offset: 35)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "Removable", scope: !906, file: !1, line: 1099, baseType: !283, size: 1, align: 64, offset: 36)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "DockDevice", scope: !906, file: !1, line: 1100, baseType: !283, size: 1, align: 64, offset: 37)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "UniqueID", scope: !906, file: !1, line: 1101, baseType: !283, size: 1, align: 64, offset: 38)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "SilentInstall", scope: !906, file: !1, line: 1102, baseType: !283, size: 1, align: 64, offset: 39)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "RawDeviceOK", scope: !906, file: !1, line: 1103, baseType: !283, size: 1, align: 64, offset: 40)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "SurpriseRemovalOK", scope: !906, file: !1, line: 1104, baseType: !283, size: 1, align: 64, offset: 41)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "WakeFromD0", scope: !906, file: !1, line: 1105, baseType: !283, size: 1, align: 64, offset: 42)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "WakeFromD1", scope: !906, file: !1, line: 1106, baseType: !283, size: 1, align: 64, offset: 43)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "WakeFromD2", scope: !906, file: !1, line: 1107, baseType: !283, size: 1, align: 64, offset: 44)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "WakeFromD3", scope: !906, file: !1, line: 1108, baseType: !283, size: 1, align: 64, offset: 45)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "HardwareDisabled", scope: !906, file: !1, line: 1109, baseType: !283, size: 1, align: 64, offset: 46)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "NonDynamic", scope: !906, file: !1, line: 1110, baseType: !283, size: 1, align: 64, offset: 47)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "WarmEjectSupported", scope: !906, file: !1, line: 1111, baseType: !283, size: 1, align: 64, offset: 48)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !906, file: !1, line: 1112, baseType: !283, size: 15, align: 64, offset: 49)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "Address", scope: !906, file: !1, line: 1113, baseType: !283, size: 64, align: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "UINumber", scope: !906, file: !1, line: 1114, baseType: !283, size: 64, align: 64, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceState", scope: !906, file: !1, line: 1115, baseType: !931, size: 224, align: 32, offset: 192)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 224, align: 32, elements: !933)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEVICE_POWER_STATE", file: !1, line: 384, baseType: !66)
!933 = !{!934}
!934 = !DISubrange(count: 7)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "SystemWake", scope: !906, file: !1, line: 1116, baseType: !936, size: 32, align: 32, offset: 416)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSTEM_POWER_STATE", file: !1, line: 364, baseType: !74)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceWake", scope: !906, file: !1, line: 1117, baseType: !932, size: 32, align: 32, offset: 448)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "D1Latency", scope: !906, file: !1, line: 1118, baseType: !283, size: 64, align: 64, offset: 512)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "D2Latency", scope: !906, file: !1, line: 1119, baseType: !283, size: 64, align: 64, offset: 576)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "D3Latency", scope: !906, file: !1, line: 1120, baseType: !283, size: 64, align: 64, offset: 640)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "FilterResourceRequirements", scope: !697, file: !1, line: 1289, baseType: !942, size: 64, align: 32)
!942 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_FilterResourceRequirements_73", file: !1, line: 1221, size: 64, align: 32, elements: !943)
!943 = !{!944}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "IoResourceRequirementList", scope: !942, file: !1, line: 1222, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIO_RESOURCE_REQUIREMENTS_LIST", file: !1, line: 557, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_RESOURCE_REQUIREMENTS_LIST", file: !1, line: 548, size: 1088, align: 64, elements: !948)
!948 = !{!949, !950, !952, !953, !954, !956, !957}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ListSize", scope: !947, file: !1, line: 549, baseType: !283, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceType", scope: !947, file: !1, line: 550, baseType: !951, size: 32, align: 32, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERFACE_TYPE", file: !1, line: 321, baseType: !84)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "BusNumber", scope: !947, file: !1, line: 551, baseType: !283, size: 64, align: 64, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "SlotNumber", scope: !947, file: !1, line: 552, baseType: !283, size: 64, align: 64, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !947, file: !1, line: 553, baseType: !955, size: 192, align: 64, offset: 256)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 192, align: 64, elements: !766)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "AlternativeLists", scope: !947, file: !1, line: 554, baseType: !283, size: 64, align: 64, offset: 448)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "List", scope: !947, file: !1, line: 555, baseType: !958, size: 576, align: 64, offset: 512)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 576, align: 64, elements: !776)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "IO_RESOURCE_LIST", file: !1, line: 547, baseType: !960)
!960 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_RESOURCE_LIST", file: !1, line: 541, size: 576, align: 64, elements: !961)
!961 = !{!962, !963, !964, !965}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !960, file: !1, line: 542, baseType: !270, size: 16, align: 16)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !960, file: !1, line: 543, baseType: !270, size: 16, align: 16, offset: 16)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !960, file: !1, line: 544, baseType: !283, size: 64, align: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptors", scope: !960, file: !1, line: 545, baseType: !966, size: 448, align: 64, offset: 128)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 448, align: 64, elements: !776)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "IO_RESOURCE_DESCRIPTOR", file: !1, line: 540, baseType: !968)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_RESOURCE_DESCRIPTOR", file: !1, line: 531, size: 448, align: 64, elements: !969)
!969 = !{!970, !971, !972, !973, !974, !975, !976}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Option", scope: !968, file: !1, line: 532, baseType: !328, size: 8, align: 8)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !968, file: !1, line: 533, baseType: !328, size: 8, align: 8, offset: 8)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ShareDisposition", scope: !968, file: !1, line: 534, baseType: !328, size: 8, align: 8, offset: 16)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "Spare1", scope: !968, file: !1, line: 535, baseType: !328, size: 8, align: 8, offset: 24)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !968, file: !1, line: 536, baseType: !270, size: 16, align: 16, offset: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "Spare2", scope: !968, file: !1, line: 537, baseType: !270, size: 16, align: 16, offset: 48)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !968, file: !1, line: 538, baseType: !977, size: 384, align: 64, offset: 64)
!977 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_u_24", file: !1, line: 519, size: 384, align: 64, elements: !978)
!978 = !{!979, !987, !994, !999, !1004, !1011, !1015, !1022, !1027, !1035}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "Port", scope: !977, file: !1, line: 520, baseType: !980, size: 384, align: 64)
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Port_25", file: !1, line: 470, size: 384, align: 64, elements: !981)
!981 = !{!982, !983, !984, !986}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !980, file: !1, line: 471, baseType: !283, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "Alignment", scope: !980, file: !1, line: 472, baseType: !283, size: 64, align: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumAddress", scope: !980, file: !1, line: 473, baseType: !985, size: 128, align: 64, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "PHYSICAL_ADDRESS", file: !1, line: 57, baseType: !378)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumAddress", scope: !980, file: !1, line: 474, baseType: !985, size: 128, align: 64, offset: 256)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "Memory", scope: !977, file: !1, line: 521, baseType: !988, size: 384, align: 64)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Memory_26", file: !1, line: 476, size: 384, align: 64, elements: !989)
!989 = !{!990, !991, !992, !993}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !988, file: !1, line: 477, baseType: !283, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "Alignment", scope: !988, file: !1, line: 478, baseType: !283, size: 64, align: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumAddress", scope: !988, file: !1, line: 479, baseType: !985, size: 128, align: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumAddress", scope: !988, file: !1, line: 480, baseType: !985, size: 128, align: 64, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "Interrupt", scope: !977, file: !1, line: 522, baseType: !995, size: 128, align: 64)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Interrupt_27", file: !1, line: 482, size: 128, align: 64, elements: !996)
!996 = !{!997, !998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumVector", scope: !995, file: !1, line: 483, baseType: !283, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumVector", scope: !995, file: !1, line: 484, baseType: !283, size: 64, align: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "Dma", scope: !977, file: !1, line: 523, baseType: !1000, size: 128, align: 64)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Dma_28", file: !1, line: 486, size: 128, align: 64, elements: !1001)
!1001 = !{!1002, !1003}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumChannel", scope: !1000, file: !1, line: 487, baseType: !283, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumChannel", scope: !1000, file: !1, line: 488, baseType: !283, size: 64, align: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "Generic", scope: !977, file: !1, line: 524, baseType: !1005, size: 384, align: 64)
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Generic_29", file: !1, line: 490, size: 384, align: 64, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1010}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !1005, file: !1, line: 491, baseType: !283, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "Alignment", scope: !1005, file: !1, line: 492, baseType: !283, size: 64, align: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumAddress", scope: !1005, file: !1, line: 493, baseType: !985, size: 128, align: 64, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumAddress", scope: !1005, file: !1, line: 494, baseType: !985, size: 128, align: 64, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "DevicePrivate", scope: !977, file: !1, line: 525, baseType: !1012, size: 192, align: 64)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_DevicePrivate_30", file: !1, line: 496, size: 192, align: 64, elements: !1013)
!1013 = !{!1014}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !1012, file: !1, line: 497, baseType: !955, size: 192, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "BusNumber", scope: !977, file: !1, line: 526, baseType: !1016, size: 256, align: 64)
!1016 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_BusNumber_31", file: !1, line: 499, size: 256, align: 64, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !1016, file: !1, line: 500, baseType: !283, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "MinBusNumber", scope: !1016, file: !1, line: 501, baseType: !283, size: 64, align: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "MaxBusNumber", scope: !1016, file: !1, line: 502, baseType: !283, size: 64, align: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !1016, file: !1, line: 503, baseType: !283, size: 64, align: 64, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "AssignedResource", scope: !977, file: !1, line: 527, baseType: !1023, size: 64, align: 64)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_AssignedResource_32", file: !1, line: 505, size: 64, align: 64, elements: !1024)
!1024 = !{!1025}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "AssignedResource", scope: !1023, file: !1, line: 506, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "PASSIGNED_RESOURCE", file: !1, line: 395, baseType: !286)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "SubAllocateFrom", scope: !977, file: !1, line: 528, baseType: !1028, size: 256, align: 64)
!1028 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_SubAllocateFrom_33", file: !1, line: 508, size: 256, align: 64, elements: !1029)
!1029 = !{!1030, !1031, !1033, !1034}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !1028, file: !1, line: 509, baseType: !328, size: 8, align: 8)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !1028, file: !1, line: 510, baseType: !1032, size: 24, align: 8, offset: 8)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 24, align: 8, elements: !766)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "AssignedResource", scope: !1028, file: !1, line: 511, baseType: !1026, size: 64, align: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "Transformation", scope: !1028, file: !1, line: 512, baseType: !985, size: 128, align: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigData", scope: !977, file: !1, line: 529, baseType: !1036, size: 192, align: 64)
!1036 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_ConfigData_34", file: !1, line: 514, size: 192, align: 64, elements: !1037)
!1037 = !{!1038, !1039, !1040}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "Priority", scope: !1036, file: !1, line: 515, baseType: !283, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !1036, file: !1, line: 516, baseType: !283, size: 64, align: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !1036, file: !1, line: 517, baseType: !283, size: 64, align: 64, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "ReadWriteConfig", scope: !697, file: !1, line: 1290, baseType: !1042, size: 256, align: 32)
!1042 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_ReadWriteConfig_74", file: !1, line: 1224, size: 256, align: 32, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "WhichSpace", scope: !1042, file: !1, line: 1225, baseType: !283, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !1042, file: !1, line: 1226, baseType: !286, size: 64, align: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !1042, file: !1, line: 1227, baseType: !283, size: 64, align: 64, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !1042, file: !1, line: 1228, baseType: !283, size: 64, align: 64, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "SetLock", scope: !697, file: !1, line: 1291, baseType: !1049, size: 8, align: 8)
!1049 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_SetLock_75", file: !1, line: 1230, size: 8, align: 8, elements: !1050)
!1050 = !{!1051}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", scope: !1049, file: !1, line: 1231, baseType: !327, size: 8, align: 8)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "QueryId", scope: !697, file: !1, line: 1292, baseType: !1053, size: 32, align: 32)
!1053 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryId_76", file: !1, line: 1233, size: 32, align: 32, elements: !1054)
!1054 = !{!1055}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "IdType", scope: !1053, file: !1, line: 1234, baseType: !1056, size: 32, align: 32)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUS_QUERY_ID_TYPE", file: !1, line: 1136, baseType: !104)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "QueryDeviceText", scope: !697, file: !1, line: 1293, baseType: !1058, size: 96, align: 32)
!1058 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryDeviceText_77", file: !1, line: 1236, size: 96, align: 32, elements: !1059)
!1059 = !{!1060, !1062}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceTextType", scope: !1058, file: !1, line: 1237, baseType: !1061, size: 32, align: 32)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEVICE_TEXT_TYPE", file: !1, line: 1141, baseType: !111)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "LocaleId", scope: !1058, file: !1, line: 1238, baseType: !1063, size: 64, align: 64, offset: 32)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "LCID", file: !1, line: 34, baseType: !283)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "UsageNotification", scope: !697, file: !1, line: 1294, baseType: !1065, size: 64, align: 32)
!1065 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_UsageNotification_78", file: !1, line: 1240, size: 64, align: 32, elements: !1066)
!1066 = !{!1067, !1068, !1070}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "InPath", scope: !1065, file: !1, line: 1241, baseType: !327, size: 8, align: 8)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !1065, file: !1, line: 1242, baseType: !1069, size: 24, align: 8, offset: 8)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 24, align: 8, elements: !766)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !1065, file: !1, line: 1243, baseType: !1071, size: 32, align: 32, offset: 32)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEVICE_USAGE_NOTIFICATION_TYPE", file: !1, line: 1083, baseType: !115)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "WaitWake", scope: !697, file: !1, line: 1295, baseType: !1073, size: 32, align: 32)
!1073 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_WaitWake_79", file: !1, line: 1245, size: 32, align: 32, elements: !1074)
!1074 = !{!1075}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "PowerState", scope: !1073, file: !1, line: 1246, baseType: !936, size: 32, align: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "PowerSequence", scope: !697, file: !1, line: 1296, baseType: !1077, size: 64, align: 32)
