; ModuleID = '<stdin>'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct._UNICODE_STRING = type { i16, i16, i16* }
%struct._FAST_MUTEX = type { i64, %struct._KTHREAD*, i64, %struct._KEVENT, i64 }
%struct._KTHREAD = type opaque
%struct._KEVENT = type { %struct._DISPATCHER_HEADER }
%struct._DISPATCHER_HEADER = type { i8, i8, i8, i8, i64, %struct._LIST_ENTRY }
%struct._LIST_ENTRY = type { %struct._LIST_ENTRY*, %struct._LIST_ENTRY* }
%struct._GUID = type { i64, i16, i16, [8 x i8] }
%union._LARGE_INTEGER = type { %struct.__anonstruct____missing_field_name_1 }
%struct.__anonstruct____missing_field_name_1 = type { i64, i64 }
%struct._DEVICE_OBJECT = type { i16, i16, i64, %struct._DRIVER_OBJECT*, %struct._DEVICE_OBJECT*, %struct._DEVICE_OBJECT*, %struct._IRP*, %struct._IO_TIMER*, i64, i64, %struct._VPB*, i8*, i64, i8, %union.__anonunion_Queue_43, i64, %struct._KDEVICE_QUEUE, %struct._KDPC, i64, i8*, %struct._KEVENT, i16, i16, %struct._DEVOBJ_EXTENSION*, i8* }
%struct._DRIVER_OBJECT = type { i16, i16, %struct._DEVICE_OBJECT*, i64, i8*, i64, i8*, %struct._DRIVER_EXTENSION*, %struct._UNICODE_STRING, %struct._UNICODE_STRING*, %struct._FAST_IO_DISPATCH*, i64 (%struct._DRIVER_OBJECT*, %struct._UNICODE_STRING*)*, void (%struct._DEVICE_OBJECT*, %struct._IRP*)*, void (%struct._DRIVER_OBJECT*)*, [28 x {}*] }

!186 = !DIEnumerator(name: "PrimaryIcache", value: 3)
!187 = !DIEnumerator(name: "PrimaryDcache", value: 4)
!188 = !DIEnumerator(name: "SecondaryIcache", value: 5)
!189 = !DIEnumerator(name: "SecondaryDcache", value: 6)
!190 = !DIEnumerator(name: "SecondaryCache", value: 7)
!191 = !DIEnumerator(name: "EisaAdapter", value: 8)
!192 = !DIEnumerator(name: "TcAdapter", value: 9)
!193 = !DIEnumerator(name: "ScsiAdapter", value: 10)
!194 = !DIEnumerator(name: "DtiAdapter", value: 11)
!195 = !DIEnumerator(name: "MultiFunctionAdapter", value: 12)
!196 = !DIEnumerator(name: "DiskController", value: 13)
!197 = !DIEnumerator(name: "TapeController", value: 14)
!198 = !DIEnumerator(name: "CdromController", value: 15)
!199 = !DIEnumerator(name: "WormController", value: 16)
!200 = !DIEnumerator(name: "SerialController", value: 17)
!201 = !DIEnumerator(name: "NetworkController", value: 18)
!202 = !DIEnumerator(name: "DisplayController", value: 19)
!203 = !DIEnumerator(name: "ParallelController", value: 20)
!204 = !DIEnumerator(name: "PointerController", value: 21)
!205 = !DIEnumerator(name: "KeyboardController", value: 22)
!206 = !DIEnumerator(name: "AudioController", value: 23)
!207 = !DIEnumerator(name: "OtherController", value: 24)
!208 = !DIEnumerator(name: "DiskPeripheral", value: 25)
!209 = !DIEnumerator(name: "FloppyDiskPeripheral", value: 26)
!210 = !DIEnumerator(name: "TapePeripheral", value: 27)
!211 = !DIEnumerator(name: "ModemPeripheral", value: 28)
!212 = !DIEnumerator(name: "MonitorPeripheral", value: 29)
!213 = !DIEnumerator(name: "PrinterPeripheral", value: 30)
!214 = !DIEnumerator(name: "PointerPeripheral", value: 31)
!215 = !DIEnumerator(name: "KeyboardPeripheral", value: 32)
!216 = !DIEnumerator(name: "TerminalPeripheral", value: 33)
!217 = !DIEnumerator(name: "OtherPeripheral", value: 34)
!218 = !DIEnumerator(name: "LinePeripheral", value: 35)
!219 = !DIEnumerator(name: "NetworkPeripheral", value: 36)
!220 = !DIEnumerator(name: "SystemMemory", value: 37)
!221 = !DIEnumerator(name: "DockingInformation", value: 38)
!222 = !DIEnumerator(name: "RealModeIrqRoutingTable", value: 39)
!223 = !DIEnumerator(name: "MaximumType", value: 40)
!224 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_EVENT_TYPE", file: !1, line: 59, size: 32, align: 32, elements: !225)
!225 = !{!226, !227}
!226 = !DIEnumerator(name: "NotificationEvent", value: 0)
!227 = !DIEnumerator(name: "SynchronizationEvent", value: 1)
!228 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_KWAIT_REASON", file: !1, line: 676, size: 32, align: 32, elements: !229)
!229 = !{!230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257}
!230 = !DIEnumerator(name: "Executive", value: 0)
!231 = !DIEnumerator(name: "FreePage", value: 1)
!232 = !DIEnumerator(name: "PageIn", value: 2)
!233 = !DIEnumerator(name: "PoolAllocation", value: 3)
!234 = !DIEnumerator(name: "DelayExecution", value: 4)
!235 = !DIEnumerator(name: "Suspended", value: 5)
!236 = !DIEnumerator(name: "UserRequest", value: 6)
!237 = !DIEnumerator(name: "WrExecutive", value: 7)
!238 = !DIEnumerator(name: "WrFreePage", value: 8)
!239 = !DIEnumerator(name: "WrPageIn", value: 9)
!240 = !DIEnumerator(name: "WrPoolAllocation", value: 10)
!241 = !DIEnumerator(name: "WrDelayExecution", value: 11)
!242 = !DIEnumerator(name: "WrSuspended", value: 12)
!243 = !DIEnumerator(name: "WrUserRequest", value: 13)
!244 = !DIEnumerator(name: "WrEventPair", value: 14)
!245 = !DIEnumerator(name: "WrQueue", value: 15)
!246 = !DIEnumerator(name: "WrLpcReceive", value: 16)
!247 = !DIEnumerator(name: "WrLpcReply", value: 17)
!248 = !DIEnumerator(name: "WrVirtualMemory", value: 18)
!249 = !DIEnumerator(name: "WrPageOut", value: 19)
!250 = !DIEnumerator(name: "WrRendezvous", value: 20)
!251 = !DIEnumerator(name: "Spare2", value: 21)
!252 = !DIEnumerator(name: "Spare3", value: 22)
!253 = !DIEnumerator(name: "Spare4", value: 23)
!254 = !DIEnumerator(name: "Spare5", value: 24)
!255 = !DIEnumerator(name: "Spare6", value: 25)
!256 = !DIEnumerator(name: "WrKernel", value: 26)
!257 = !DIEnumerator(name: "MaximumWaitReason", value: 27)
!258 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_MEMORY_CACHING_TYPE", file: !1, line: 742, size: 32, align: 32, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !266}
!260 = !DIEnumerator(name: "MmNonCached", value: 0)
!261 = !DIEnumerator(name: "MmCached", value: 1)
!262 = !DIEnumerator(name: "MmWriteCombined", value: 2)
!263 = !DIEnumerator(name: "MmHardwareCoherentCached", value: 3)
!264 = !DIEnumerator(name: "MmNonCachedUnordered", value: 4)
!265 = !DIEnumerator(name: "MmUSWCCached", value: 5)
!266 = !DIEnumerator(name: "MmMaximumCacheType", value: 6)
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_MM_PAGE_PRIORITY", file: !1, line: 808, size: 32, align: 32, elements: !268)
!268 = !{!269, !270, !271}
!269 = !DIEnumerator(name: "LowPagePriority", value: 0)
!270 = !DIEnumerator(name: "NormalPagePriority", value: 16)
!271 = !DIEnumerator(name: "HighPagePriority", value: 32)
!272 = !{!273, !274, !387, !388, !370, !391, !291, !392, !393, !283, !417, !282, !1376, !290, !1381, !1141, !1382, !1063, !316, !389, !1427, !279, !1429, !1436, !1434, !1259, !772, !323, !1608, !452}
!273 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_RESOURCE_LIST", file: !1, line: 608, size: 576, align: 64, elements: !276)
!276 = !{!277, !280, !281, !284}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !275, file: !1, line: 609, baseType: !278, size: 16, align: 16)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "USHORT", file: !1, line: 27, baseType: !279)
!279 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !275, file: !1, line: 610, baseType: !278, size: 16, align: 16, offset: 16)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !275, file: !1, line: 611, baseType: !282, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "ULONG", file: !1, line: 28, baseType: !283)
!283 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptors", scope: !275, file: !1, line: 612, baseType: !285, size: 448, align: 64, offset: 128)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 448, align: 64, elements: !385)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "IO_RESOURCE_DESCRIPTOR", file: !1, line: 606, baseType: !287)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_RESOURCE_DESCRIPTOR", file: !1, line: 597, size: 448, align: 64, elements: !288)
!288 = !{!289, !292, !293, !294, !295, !296, !297}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Option", scope: !287, file: !1, line: 598, baseType: !290, size: 8, align: 8)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "UCHAR", file: !1, line: 26, baseType: !291)
!291 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !287, file: !1, line: 599, baseType: !290, size: 8, align: 8, offset: 8)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ShareDisposition", scope: !287, file: !1, line: 600, baseType: !290, size: 8, align: 8, offset: 16)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Spare1", scope: !287, file: !1, line: 601, baseType: !290, size: 8, align: 8, offset: 24)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !287, file: !1, line: 602, baseType: !278, size: 16, align: 16, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Spare2", scope: !287, file: !1, line: 603, baseType: !278, size: 16, align: 16, offset: 48)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !287, file: !1, line: 604, baseType: !298, size: 384, align: 64, offset: 64)
!298 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_u_24", file: !1, line: 585, size: 384, align: 64, elements: !299)
!299 = !{!300, !326, !333, !338, !343, !350, !357, !364, !371, !379}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Port", scope: !298, file: !1, line: 586, baseType: !301, size: 384, align: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Port_25", file: !1, line: 536, size: 384, align: 64, elements: !302)
!302 = !{!303, !304, !305, !325}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !301, file: !1, line: 537, baseType: !282, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Alignment", scope: !301, file: !1, line: 538, baseType: !282, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumAddress", scope: !301, file: !1, line: 539, baseType: !306, size: 128, align: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PHYSICAL_ADDRESS", file: !1, line: 58, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "LARGE_INTEGER", file: !1, line: 51, baseType: !308)
!308 = !DICompositeType(tag: DW_TAG_union_type, name: "_LARGE_INTEGER", file: !1, line: 46, size: 128, align: 64, elements: !309)
!309 = !{!310, !317, !322}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField1", scope: !308, file: !1, line: 47, baseType: !311, size: 128, align: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct____missing_field_name_1", file: !1, line: 38, size: 128, align: 64, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "LowPart", scope: !311, file: !1, line: 39, baseType: !282, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "HighPart", scope: !311, file: !1, line: 40, baseType: !315, size: 64, align: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "LONG", file: !1, line: 19, baseType: !316)
!316 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !308, file: !1, line: 48, baseType: !318, size: 128, align: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_u_2", file: !1, line: 42, size: 128, align: 64, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "LowPart", scope: !318, file: !1, line: 43, baseType: !282, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "HighPart", scope: !318, file: !1, line: 44, baseType: !315, size: 64, align: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "QuadPart", scope: !308, file: !1, line: 49, baseType: !323, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "LONGLONG", file: !1, line: 37, baseType: !324)
!324 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumAddress", scope: !301, file: !1, line: 540, baseType: !306, size: 128, align: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Memory", scope: !298, file: !1, line: 587, baseType: !327, size: 384, align: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Memory_26", file: !1, line: 542, size: 384, align: 64, elements: !328)
!328 = !{!329, !330, !331, !332}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !327, file: !1, line: 543, baseType: !282, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Alignment", scope: !327, file: !1, line: 544, baseType: !282, size: 64, align: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumAddress", scope: !327, file: !1, line: 545, baseType: !306, size: 128, align: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumAddress", scope: !327, file: !1, line: 546, baseType: !306, size: 128, align: 64, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Interrupt", scope: !298, file: !1, line: 588, baseType: !334, size: 128, align: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Interrupt_27", file: !1, line: 548, size: 128, align: 64, elements: !335)
!335 = !{!336, !337}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumVector", scope: !334, file: !1, line: 549, baseType: !282, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumVector", scope: !334, file: !1, line: 550, baseType: !282, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Dma", scope: !298, file: !1, line: 589, baseType: !339, size: 128, align: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Dma_28", file: !1, line: 552, size: 128, align: 64, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumChannel", scope: !339, file: !1, line: 553, baseType: !282, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumChannel", scope: !339, file: !1, line: 554, baseType: !282, size: 64, align: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Generic", scope: !298, file: !1, line: 590, baseType: !344, size: 384, align: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Generic_29", file: !1, line: 556, size: 384, align: 64, elements: !345)
!345 = !{!346, !347, !348, !349}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !344, file: !1, line: 557, baseType: !282, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Alignment", scope: !344, file: !1, line: 558, baseType: !282, size: 64, align: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "MinimumAddress", scope: !344, file: !1, line: 559, baseType: !306, size: 128, align: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumAddress", scope: !344, file: !1, line: 560, baseType: !306, size: 128, align: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "DevicePrivate", scope: !298, file: !1, line: 591, baseType: !351, size: 192, align: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_DevicePrivate_30", file: !1, line: 562, size: 192, align: 64, elements: !352)
!352 = !{!353}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !351, file: !1, line: 563, baseType: !354, size: 192, align: 64)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 192, align: 64, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 3)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "BusNumber", scope: !298, file: !1, line: 592, baseType: !358, size: 256, align: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_BusNumber_31", file: !1, line: 565, size: 256, align: 64, elements: !359)
!359 = !{!360, !361, !362, !363}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !358, file: !1, line: 566, baseType: !282, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "MinBusNumber", scope: !358, file: !1, line: 567, baseType: !282, size: 64, align: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "MaxBusNumber", scope: !358, file: !1, line: 568, baseType: !282, size: 64, align: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !358, file: !1, line: 569, baseType: !282, size: 64, align: 64, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "AssignedResource", scope: !298, file: !1, line: 593, baseType: !365, size: 64, align: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_AssignedResource_32", file: !1, line: 571, size: 64, align: 64, elements: !366)
!366 = !{!367}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "AssignedResource", scope: !365, file: !1, line: 572, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PASSIGNED_RESOURCE", file: !1, line: 457, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PVOID", file: !1, line: 16, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "SubAllocateFrom", scope: !298, file: !1, line: 594, baseType: !372, size: 256, align: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_SubAllocateFrom_33", file: !1, line: 574, size: 256, align: 64, elements: !373)
!373 = !{!374, !375, !377, !378}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !372, file: !1, line: 575, baseType: !290, size: 8, align: 8)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !372, file: !1, line: 576, baseType: !376, size: 24, align: 8, offset: 8)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 24, align: 8, elements: !355)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "AssignedResource", scope: !372, file: !1, line: 577, baseType: !368, size: 64, align: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Transformation", scope: !372, file: !1, line: 578, baseType: !306, size: 128, align: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigData", scope: !298, file: !1, line: 595, baseType: !380, size: 192, align: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_ConfigData_34", file: !1, line: 580, size: 192, align: 64, elements: !381)
!381 = !{!382, !383, !384}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Priority", scope: !380, file: !1, line: 581, baseType: !282, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !380, file: !1, line: 582, baseType: !282, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !380, file: !1, line: 583, baseType: !282, size: 64, align: 64, offset: 128)
!385 = !{!386}
!386 = !DISubrange(count: 1)
!387 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR", file: !1, line: 17, baseType: !390)
!390 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!391 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISR_LIST_ENTRY", file: !1, line: 1636, baseType: !395)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ISR_LIST_ENTRY", file: !1, line: 1629, size: 384, align: 64, elements: !396)
!396 = !{!397, !404, !411, !412, !416}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ListEntry", scope: !395, file: !1, line: 1630, baseType: !398, size: 128, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIST_ENTRY", file: !1, line: 86, baseType: !399)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LIST_ENTRY", file: !1, line: 82, size: 128, align: 64, elements: !400)
!400 = !{!401, !403}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Flink", scope: !399, file: !1, line: 83, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Blink", scope: !399, file: !1, line: 84, baseType: !402, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ServiceRoutine", scope: !395, file: !1, line: 1631, baseType: !405, size: 64, align: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!408, !409, !369}
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !1, line: 80, baseType: !290)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "_KINTERRUPT", file: !1, line: 121, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ServiceContext", scope: !395, file: !1, line: 1632, baseType: !369, size: 64, align: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "DeferredPortCheckRoutine", scope: !395, file: !1, line: 1633, baseType: !413, size: 64, align: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !369}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "CheckContext", scope: !395, file: !1, line: 1634, baseType: !369, size: 64, align: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "REMOVAL_RELATIONS_LIST_ENTRY", file: !1, line: 1644, baseType: !419)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REMOVAL_RELATIONS_LIST_ENTRY", file: !1, line: 1638, size: 384, align: 64, elements: !420)
!420 = !{!421, !422, !1374, !1375}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ListEntry", scope: !419, file: !1, line: 1639, baseType: !398, size: 128, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !419, file: !1, line: 1640, baseType: !423, size: 64, align: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "PDEVICE_OBJECT", file: !1, line: 1002, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DEVICE_OBJECT", file: !1, line: 974, size: 2944, align: 64, elements: !426)
!426 = !{!427, !429, !430, !431, !1299, !1300, !1301, !1302, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1349, !1350, !1359, !1361, !1362, !1363, !1364, !1365, !1366, !1373}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !425, file: !1, line: 975, baseType: !428, size: 16, align: 16)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "CSHORT", file: !1, line: 34, baseType: !391)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !425, file: !1, line: 976, baseType: !278, size: 16, align: 16, offset: 16)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ReferenceCount", scope: !425, file: !1, line: 977, baseType: !315, size: 64, align: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "DriverObject", scope: !425, file: !1, line: 978, baseType: !432, size: 64, align: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DRIVER_OBJECT", file: !1, line: 1015, size: 2688, align: 64, elements: !434)
!434 = !{!435, !436, !437, !438, !439, !440, !441, !442, !465, !466, !469, !1282, !1286, !1287, !1291}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !433, file: !1, line: 1016, baseType: !428, size: 16, align: 16)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !433, file: !1, line: 1017, baseType: !428, size: 16, align: 16, offset: 16)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !433, file: !1, line: 1018, baseType: !423, size: 64, align: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !433, file: !1, line: 1019, baseType: !282, size: 64, align: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "DriverStart", scope: !433, file: !1, line: 1020, baseType: !369, size: 64, align: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "DriverSize", scope: !433, file: !1, line: 1021, baseType: !282, size: 64, align: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "DriverSection", scope: !433, file: !1, line: 1022, baseType: !369, size: 64, align: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "DriverExtension", scope: !433, file: !1, line: 1023, baseType: !443, size: 64, align: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PDRIVER_EXTENSION", file: !1, line: 1014, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DRIVER_EXTENSION", file: !1, line: 1008, size: 320, align: 64, elements: !446)
!446 = !{!447, !448, !453, !454}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "DriverObject", scope: !445, file: !1, line: 1009, baseType: !432, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "AddDevice", scope: !445, file: !1, line: 1010, baseType: !449, size: 64, align: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!452, !432, !424}
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "NTSTATUS", file: !1, line: 36, baseType: !315)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !445, file: !1, line: 1011, baseType: !282, size: 64, align: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ServiceKeyName", scope: !445, file: !1, line: 1012, baseType: !455, size: 128, align: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "UNICODE_STRING", file: !1, line: 78, baseType: !456)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "_UNICODE_STRING", file: !1, line: 73, size: 128, align: 64, elements: !457)
!457 = !{!458, !459, !460}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !456, file: !1, line: 74, baseType: !278, size: 16, align: 16)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumLength", scope: !456, file: !1, line: 75, baseType: !278, size: 16, align: 16, offset: 16)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !456, file: !1, line: 76, baseType: !461, size: 64, align: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWSTR", file: !1, line: 21, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "WCHAR", file: !1, line: 20, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !1, line: 12, baseType: !279)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "DriverName", scope: !433, file: !1, line: 1024, baseType: !455, size: 128, align: 64, offset: 448)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "HardwareDatabase", scope: !433, file: !1, line: 1025, baseType: !467, size: 64, align: 64, offset: 576)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PUNICODE_STRING", file: !1, line: 79, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoDispatch", scope: !433, file: !1, line: 1026, baseType: !470, size: 64, align: 64, offset: 640)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFAST_IO_DISPATCH", file: !1, line: 932, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FAST_IO_DISPATCH", file: !1, line: 863, size: 1792, align: 64, elements: !473)
!473 = !{!474, !475, !565, !569, !570, !583, !596, !603, !607, !611, !615, !619, !623, !624, !628, !642, !691, !708, !712, !713, !717, !723, !724, !725, !726, !1273, !1277, !1281}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfFastIoDispatch", scope: !472, file: !1, line: 864, baseType: !282, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoCheckIfPossible", scope: !472, file: !1, line: 865, baseType: !476, size: 64, align: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!408, !479, !552, !282, !408, !282, !408, !554, !424}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE_OBJECT", file: !1, line: 1046, size: 1728, align: 64, elements: !481)
!481 = !{!482, !483, !484, !485, !502, !503, !504, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !544, !545}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !480, file: !1, line: 1047, baseType: !428, size: 16, align: 16)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !480, file: !1, line: 1048, baseType: !428, size: 16, align: 16, offset: 16)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !480, file: !1, line: 1049, baseType: !423, size: 64, align: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Vpb", scope: !480, file: !1, line: 1050, baseType: !486, size: 64, align: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PVPB", file: !1, line: 957, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "_VPB", file: !1, line: 946, size: 832, align: 64, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497, !498}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !488, file: !1, line: 947, baseType: !428, size: 16, align: 16)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !488, file: !1, line: 948, baseType: !428, size: 16, align: 16, offset: 16)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !488, file: !1, line: 949, baseType: !278, size: 16, align: 16, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "VolumeLabelLength", scope: !488, file: !1, line: 950, baseType: !278, size: 16, align: 16, offset: 48)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !488, file: !1, line: 951, baseType: !424, size: 64, align: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "RealDevice", scope: !488, file: !1, line: 952, baseType: !424, size: 64, align: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", scope: !488, file: !1, line: 953, baseType: !282, size: 64, align: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ReferenceCount", scope: !488, file: !1, line: 954, baseType: !282, size: 64, align: 64, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "VolumeLabel", scope: !488, file: !1, line: 955, baseType: !499, size: 512, align: 16, offset: 320)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 512, align: 16, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "FsContext", scope: !480, file: !1, line: 1051, baseType: !369, size: 64, align: 64, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "FsContext2", scope: !480, file: !1, line: 1052, baseType: !369, size: 64, align: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "SectionObjectPointer", scope: !480, file: !1, line: 1053, baseType: !505, size: 64, align: 64, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSECTION_OBJECT_POINTERS", file: !1, line: 1040, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECTION_OBJECT_POINTERS", file: !1, line: 1039, baseType: !508)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SECTION_OBJECT_POINTERS", file: !1, line: 1034, size: 192, align: 64, elements: !509)
!509 = !{!510, !511, !512}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "DataSectionObject", scope: !508, file: !1, line: 1035, baseType: !369, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "SharedCacheMap", scope: !508, file: !1, line: 1036, baseType: !369, size: 64, align: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ImageSectionObject", scope: !508, file: !1, line: 1037, baseType: !369, size: 64, align: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateCacheMap", scope: !480, file: !1, line: 1054, baseType: !369, size: 64, align: 64, offset: 384)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "FinalStatus", scope: !480, file: !1, line: 1055, baseType: !452, size: 64, align: 64, offset: 448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "RelatedFileObject", scope: !480, file: !1, line: 1056, baseType: !479, size: 64, align: 64, offset: 512)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "LockOperation", scope: !480, file: !1, line: 1057, baseType: !408, size: 8, align: 8, offset: 576)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "DeletePending", scope: !480, file: !1, line: 1058, baseType: !408, size: 8, align: 8, offset: 584)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ReadAccess", scope: !480, file: !1, line: 1059, baseType: !408, size: 8, align: 8, offset: 592)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "WriteAccess", scope: !480, file: !1, line: 1060, baseType: !408, size: 8, align: 8, offset: 600)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteAccess", scope: !480, file: !1, line: 1061, baseType: !408, size: 8, align: 8, offset: 608)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "SharedRead", scope: !480, file: !1, line: 1062, baseType: !408, size: 8, align: 8, offset: 616)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "SharedWrite", scope: !480, file: !1, line: 1063, baseType: !408, size: 8, align: 8, offset: 624)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "SharedDelete", scope: !480, file: !1, line: 1064, baseType: !408, size: 8, align: 8, offset: 632)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !480, file: !1, line: 1065, baseType: !282, size: 64, align: 64, offset: 640)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "FileName", scope: !480, file: !1, line: 1066, baseType: !455, size: 128, align: 64, offset: 704)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentByteOffset", scope: !480, file: !1, line: 1067, baseType: !307, size: 128, align: 64, offset: 832)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Waiters", scope: !480, file: !1, line: 1068, baseType: !282, size: 64, align: 64, offset: 960)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "Busy", scope: !480, file: !1, line: 1069, baseType: !282, size: 64, align: 64, offset: 1024)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "LastLock", scope: !480, file: !1, line: 1070, baseType: !369, size: 64, align: 64, offset: 1088)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", scope: !480, file: !1, line: 1071, baseType: !531, size: 256, align: 64, offset: 1152)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "KEVENT", file: !1, line: 733, baseType: !532)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "_KEVENT", file: !1, line: 730, size: 256, align: 64, elements: !533)
!533 = !{!534}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !532, file: !1, line: 731, baseType: !535, size: 256, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "DISPATCHER_HEADER", file: !1, line: 715, baseType: !536)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DISPATCHER_HEADER", file: !1, line: 707, size: 256, align: 64, elements: !537)
!537 = !{!538, !539, !540, !541, !542, !543}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !536, file: !1, line: 708, baseType: !290, size: 8, align: 8)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Absolute", scope: !536, file: !1, line: 709, baseType: !290, size: 8, align: 8, offset: 8)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !536, file: !1, line: 710, baseType: !290, size: 8, align: 8, offset: 16)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Inserted", scope: !536, file: !1, line: 711, baseType: !290, size: 8, align: 8, offset: 24)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "SignalState", scope: !536, file: !1, line: 712, baseType: !315, size: 64, align: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "WaitListHead", scope: !536, file: !1, line: 713, baseType: !398, size: 128, align: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Event", scope: !480, file: !1, line: 1072, baseType: !531, size: 256, align: 64, offset: 1408)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "CompletionContext", scope: !480, file: !1, line: 1073, baseType: !546, size: 64, align: 64, offset: 1664)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIO_COMPLETION_CONTEXT", file: !1, line: 1045, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64, align: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_COMPLETION_CONTEXT", file: !1, line: 1041, size: 128, align: 64, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Port", scope: !548, file: !1, line: 1042, baseType: !369, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Key", scope: !548, file: !1, line: 1043, baseType: !369, size: 64, align: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "PLARGE_INTEGER", file: !1, line: 52, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIO_STATUS_BLOCK", file: !1, line: 236, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_STATUS_BLOCK", file: !1, line: 231, size: 128, align: 64, elements: !557)
!557 = !{!558, !563}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField4", scope: !556, file: !1, line: 232, baseType: !559, size: 64, align: 64)
!559 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_6", file: !1, line: 227, size: 64, align: 64, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !559, file: !1, line: 228, baseType: !452, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !559, file: !1, line: 229, baseType: !369, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "Information", scope: !556, file: !1, line: 233, baseType: !564, size: 64, align: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "ULONG_PTR", file: !1, line: 13, baseType: !283)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoRead", scope: !472, file: !1, line: 869, baseType: !566, size: 64, align: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!408, !479, !552, !282, !408, !282, !369, !554, !424}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoWrite", scope: !472, file: !1, line: 872, baseType: !566, size: 64, align: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoQueryBasicInfo", scope: !472, file: !1, line: 875, baseType: !571, size: 64, align: 64, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!408, !479, !408, !574, !554, !424}
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFILE_BASIC_INFORMATION", file: !1, line: 284, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64, align: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE_BASIC_INFORMATION", file: !1, line: 277, size: 576, align: 64, elements: !577)
!577 = !{!578, !579, !580, !581, !582}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "CreationTime", scope: !576, file: !1, line: 278, baseType: !307, size: 128, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessTime", scope: !576, file: !1, line: 279, baseType: !307, size: 128, align: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "LastWriteTime", scope: !576, file: !1, line: 280, baseType: !307, size: 128, align: 64, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ChangeTime", scope: !576, file: !1, line: 281, baseType: !307, size: 128, align: 64, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "FileAttributes", scope: !576, file: !1, line: 282, baseType: !282, size: 64, align: 64, offset: 512)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoQueryStandardInfo", scope: !472, file: !1, line: 878, baseType: !584, size: 64, align: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!408, !479, !408, !587, !554, !424}
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFILE_STANDARD_INFORMATION", file: !1, line: 292, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64, align: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE_STANDARD_INFORMATION", file: !1, line: 285, size: 384, align: 64, elements: !590)
!590 = !{!591, !592, !593, !594, !595}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationSize", scope: !589, file: !1, line: 286, baseType: !307, size: 128, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "EndOfFile", scope: !589, file: !1, line: 287, baseType: !307, size: 128, align: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfLinks", scope: !589, file: !1, line: 288, baseType: !282, size: 64, align: 64, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "DeletePending", scope: !589, file: !1, line: 289, baseType: !408, size: 8, align: 8, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Directory", scope: !589, file: !1, line: 290, baseType: !408, size: 8, align: 8, offset: 328)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoLock", scope: !472, file: !1, line: 881, baseType: !597, size: 64, align: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!408, !479, !552, !552, !600, !282, !408, !408, !554, !424}
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "PEPROCESS", file: !1, line: 120, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64, align: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "_EPROCESS", file: !1, line: 119, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoUnlockSingle", scope: !472, file: !1, line: 885, baseType: !604, size: 64, align: 64, offset: 448)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64, align: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!408, !479, !552, !552, !600, !282, !554, !424}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoUnlockAll", scope: !472, file: !1, line: 888, baseType: !608, size: 64, align: 64, offset: 512)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!408, !479, !600, !554, !424}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoUnlockAllByKey", scope: !472, file: !1, line: 890, baseType: !612, size: 64, align: 64, offset: 576)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64, align: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!408, !479, !369, !282, !554, !424}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoDeviceControl", scope: !472, file: !1, line: 892, baseType: !616, size: 64, align: 64, offset: 640)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64, align: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!408, !479, !408, !369, !282, !369, !282, !282, !554, !424}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "AcquireFileForNtCreateSection", scope: !472, file: !1, line: 896, baseType: !620, size: 64, align: 64, offset: 704)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64, align: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !479}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ReleaseFileForNtCreateSection", scope: !472, file: !1, line: 897, baseType: !620, size: 64, align: 64, offset: 768)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoDetachDevice", scope: !472, file: !1, line: 898, baseType: !625, size: 64, align: 64, offset: 832)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, align: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !424, !424}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoQueryNetworkOpenInfo", scope: !472, file: !1, line: 899, baseType: !629, size: 64, align: 64, offset: 896)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64, align: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!408, !479, !408, !632, !555, !424}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64, align: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE_NETWORK_OPEN_INFORMATION", file: !1, line: 293, size: 832, align: 64, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "CreationTime", scope: !633, file: !1, line: 294, baseType: !307, size: 128, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessTime", scope: !633, file: !1, line: 295, baseType: !307, size: 128, align: 64, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "LastWriteTime", scope: !633, file: !1, line: 296, baseType: !307, size: 128, align: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ChangeTime", scope: !633, file: !1, line: 297, baseType: !307, size: 128, align: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationSize", scope: !633, file: !1, line: 298, baseType: !307, size: 128, align: 64, offset: 512)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "EndOfFile", scope: !633, file: !1, line: 299, baseType: !307, size: 128, align: 64, offset: 640)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "FileAttributes", scope: !633, file: !1, line: 300, baseType: !282, size: 64, align: 64, offset: 768)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "AcquireForModWrite", scope: !472, file: !1, line: 902, baseType: !643, size: 64, align: 64, offset: 960)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64, align: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!452, !479, !552, !646, !424}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ERESOURCE", file: !1, line: 794, size: 896, align: 64, elements: !649)
!649 = !{!650, !651, !663, !665, !666, !673, !676, !681, !682, !683, !684, !689}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "SystemResourcesList", scope: !648, file: !1, line: 795, baseType: !398, size: 128, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "OwnerTable", scope: !648, file: !1, line: 796, baseType: !652, size: 64, align: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWNER_ENTRY", file: !1, line: 789, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "_OWNER_ENTRY", file: !1, line: 784, size: 128, align: 64, elements: !655)
!655 = !{!656, !658}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "OwnerThread", scope: !654, file: !1, line: 785, baseType: !657, size: 64, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "ERESOURCE_THREAD", file: !1, line: 779, baseType: !564)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField10", scope: !654, file: !1, line: 786, baseType: !659, size: 64, align: 64, offset: 64)
!659 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_38", file: !1, line: 780, size: 64, align: 64, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "OwnerCount", scope: !659, file: !1, line: 781, baseType: !315, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "TableSize", scope: !659, file: !1, line: 782, baseType: !282, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ActiveCount", scope: !648, file: !1, line: 797, baseType: !664, size: 16, align: 16, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHORT", file: !1, line: 18, baseType: !391)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Flag", scope: !648, file: !1, line: 798, baseType: !278, size: 16, align: 16, offset: 208)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "SharedWaiters", scope: !648, file: !1, line: 799, baseType: !667, size: 64, align: 64, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKSEMAPHORE", file: !1, line: 740, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "_KSEMAPHORE", file: !1, line: 736, size: 320, align: 64, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !669, file: !1, line: 737, baseType: !535, size: 256, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Limit", scope: !669, file: !1, line: 738, baseType: !315, size: 64, align: 64, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ExclusiveWaiters", scope: !648, file: !1, line: 800, baseType: !674, size: 64, align: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKEVENT", file: !1, line: 734, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "OwnerThreads", scope: !648, file: !1, line: 801, baseType: !677, size: 256, align: 64, offset: 384)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 256, align: 64, elements: !679)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "OWNER_ENTRY", file: !1, line: 788, baseType: !654)
!679 = !{!680}
!680 = !DISubrange(count: 2)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ContentionCount", scope: !648, file: !1, line: 802, baseType: !282, size: 64, align: 64, offset: 640)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfSharedWaiters", scope: !648, file: !1, line: 803, baseType: !278, size: 16, align: 16, offset: 704)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfExclusiveWaiters", scope: !648, file: !1, line: 804, baseType: !278, size: 16, align: 16, offset: 720)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField11", scope: !648, file: !1, line: 805, baseType: !685, size: 64, align: 64, offset: 768)
!685 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_39", file: !1, line: 790, size: 64, align: 64, elements: !686)
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Address", scope: !685, file: !1, line: 791, baseType: !369, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "CreatorBackTraceIndex", scope: !685, file: !1, line: 792, baseType: !564, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "SpinLock", scope: !648, file: !1, line: 806, baseType: !690, size: 64, align: 64, offset: 832)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPIN_LOCK", file: !1, line: 212, baseType: !564)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "MdlRead", scope: !472, file: !1, line: 904, baseType: !692, size: 64, align: 64, offset: 1024)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!408, !479, !552, !282, !282, !695, !554, !424}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "PMDL", file: !1, line: 177, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64, align: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MDL", file: !1, line: 166, size: 448, align: 64, elements: !699)
!699 = !{!700, !701, !702, !703, !704, !705, !706, !707}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !698, file: !1, line: 167, baseType: !697, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !698, file: !1, line: 168, baseType: !428, size: 16, align: 16, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "MdlFlags", scope: !698, file: !1, line: 169, baseType: !428, size: 16, align: 16, offset: 80)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Process", scope: !698, file: !1, line: 170, baseType: !601, size: 64, align: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "MappedSystemVa", scope: !698, file: !1, line: 171, baseType: !369, size: 64, align: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "StartVa", scope: !698, file: !1, line: 172, baseType: !369, size: 64, align: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ByteCount", scope: !698, file: !1, line: 173, baseType: !282, size: 64, align: 64, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ByteOffset", scope: !698, file: !1, line: 174, baseType: !282, size: 64, align: 64, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "MdlReadComplete", scope: !472, file: !1, line: 907, baseType: !709, size: 64, align: 64, offset: 1088)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!408, !479, !696, !424}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "PrepareMdlWrite", scope: !472, file: !1, line: 908, baseType: !692, size: 64, align: 64, offset: 1152)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "MdlWriteComplete", scope: !472, file: !1, line: 911, baseType: !714, size: 64, align: 64, offset: 1216)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64, align: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!408, !479, !552, !696, !424}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoReadCompressed", scope: !472, file: !1, line: 913, baseType: !718, size: 64, align: 64, offset: 1280)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64, align: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!408, !479, !552, !282, !282, !369, !695, !554, !721, !282, !424}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64, align: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "_COMPRESSED_DATA_INFO", file: !1, line: 862, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoWriteCompressed", scope: !472, file: !1, line: 917, baseType: !718, size: 64, align: 64, offset: 1344)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "MdlReadCompleteCompressed", scope: !472, file: !1, line: 921, baseType: !709, size: 64, align: 64, offset: 1408)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "MdlWriteCompleteCompressed", scope: !472, file: !1, line: 923, baseType: !714, size: 64, align: 64, offset: 1472)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "FastIoQueryOpen", scope: !472, file: !1, line: 925, baseType: !727, size: 64, align: 64, offset: 1536)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64, align: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!408, !730, !1272, !424}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64, align: 64)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IRP", file: !1, line: 1118, size: 1728, align: 64, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !743, !744, !746, !749, !750, !751, !752, !753, !755, !756, !757, !758, !759, !771, !775, !776}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !731, file: !1, line: 1119, baseType: !428, size: 16, align: 16)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !731, file: !1, line: 1120, baseType: !278, size: 16, align: 16, offset: 16)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "MdlAddress", scope: !731, file: !1, line: 1121, baseType: !696, size: 64, align: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !731, file: !1, line: 1122, baseType: !282, size: 64, align: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "AssociatedIrp", scope: !731, file: !1, line: 1123, baseType: !738, size: 64, align: 64, offset: 192)
!738 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_AssociatedIrp_44", file: !1, line: 1076, size: 64, align: 64, elements: !739)
!739 = !{!740, !741, !742}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "MasterIrp", scope: !738, file: !1, line: 1077, baseType: !730, size: 64, align: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "IrpCount", scope: !738, file: !1, line: 1078, baseType: !315, size: 64, align: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "SystemBuffer", scope: !738, file: !1, line: 1079, baseType: !369, size: 64, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ThreadListEntry", scope: !731, file: !1, line: 1124, baseType: !398, size: 128, align: 64, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "IoStatus", scope: !731, file: !1, line: 1125, baseType: !745, size: 128, align: 64, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "IO_STATUS_BLOCK", file: !1, line: 235, baseType: !556)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "RequestorMode", scope: !731, file: !1, line: 1126, baseType: !747, size: 8, align: 8, offset: 512)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "KPROCESSOR_MODE", file: !1, line: 127, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCHAR", file: !1, line: 33, baseType: !390)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "PendingReturned", scope: !731, file: !1, line: 1127, baseType: !408, size: 8, align: 8, offset: 520)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "StackCount", scope: !731, file: !1, line: 1128, baseType: !389, size: 8, align: 8, offset: 528)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentLocation", scope: !731, file: !1, line: 1129, baseType: !389, size: 8, align: 8, offset: 536)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", scope: !731, file: !1, line: 1130, baseType: !408, size: 8, align: 8, offset: 544)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "CancelIrql", scope: !731, file: !1, line: 1131, baseType: !754, size: 8, align: 8, offset: 552)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "KIRQL", file: !1, line: 107, baseType: !290)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ApcEnvironment", scope: !731, file: !1, line: 1132, baseType: !748, size: 8, align: 8, offset: 560)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationFlags", scope: !731, file: !1, line: 1133, baseType: !290, size: 8, align: 8, offset: 568)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "UserIosb", scope: !731, file: !1, line: 1134, baseType: !554, size: 64, align: 64, offset: 576)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "UserEvent", scope: !731, file: !1, line: 1135, baseType: !674, size: 64, align: 64, offset: 640)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Overlay", scope: !731, file: !1, line: 1136, baseType: !760, size: 128, align: 64, offset: 704)
!760 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_Overlay_45", file: !1, line: 1086, size: 128, align: 64, elements: !761)
!761 = !{!762, !770}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "AsynchronousParameters", scope: !760, file: !1, line: 1087, baseType: !763, size: 128, align: 64)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_AsynchronousParameters_46", file: !1, line: 1081, size: 128, align: 64, elements: !764)
!764 = !{!765, !769}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "UserApcRoutine", scope: !763, file: !1, line: 1082, baseType: !766, size: 64, align: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64, align: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !369, !554, !282}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "UserApcContext", scope: !763, file: !1, line: 1084, baseType: !369, size: 64, align: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "AllocationSize", scope: !760, file: !1, line: 1088, baseType: !307, size: 128, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "CancelRoutine", scope: !731, file: !1, line: 1137, baseType: !772, size: 64, align: 64, offset: 832)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64, align: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !424, !730}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "UserBuffer", scope: !731, file: !1, line: 1138, baseType: !369, size: 64, align: 64, offset: 896)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Tail", scope: !731, file: !1, line: 1139, baseType: !777, size: 768, align: 64, offset: 960)
!777 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_Tail_47", file: !1, line: 1113, size: 768, align: 64, elements: !778)
!778 = !{!779, !1238, !1271}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "Overlay", scope: !777, file: !1, line: 1114, baseType: !780, size: 640, align: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Overlay_48", file: !1, line: 1106, size: 640, align: 64, elements: !781)
!781 = !{!782, !799, !803, !805, !1237}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField15", scope: !780, file: !1, line: 1107, baseType: !783, size: 256, align: 64)
!783 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_49", file: !1, line: 1093, size: 256, align: 64, elements: !784)
!784 = !{!785, !792}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceQueueEntry", scope: !783, file: !1, line: 1094, baseType: !786, size: 256, align: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "KDEVICE_QUEUE_ENTRY", file: !1, line: 729, baseType: !787)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "_KDEVICE_QUEUE_ENTRY", file: !1, line: 724, size: 256, align: 64, elements: !788)
!788 = !{!789, !790, !791}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceListEntry", scope: !787, file: !1, line: 725, baseType: !398, size: 128, align: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "SortKey", scope: !787, file: !1, line: 726, baseType: !282, size: 64, align: 64, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Inserted", scope: !787, file: !1, line: 727, baseType: !408, size: 8, align: 8, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField14", scope: !783, file: !1, line: 1095, baseType: !793, size: 256, align: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct____missing_field_name_50", file: !1, line: 1090, size: 256, align: 64, elements: !794)
!794 = !{!795}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "DriverContext", scope: !793, file: !1, line: 1091, baseType: !796, size: 256, align: 64)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 256, align: 64, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 4)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "Thread", scope: !780, file: !1, line: 1108, baseType: !800, size: 64, align: 64, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "PETHREAD", file: !1, line: 118, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64, align: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ETHREAD", file: !1, line: 117, flags: DIFlagFwdDecl)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "AuxiliaryBuffer", scope: !780, file: !1, line: 1109, baseType: !804, size: 64, align: 64, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCHAR", file: !1, line: 23, baseType: !388)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField17", scope: !780, file: !1, line: 1110, baseType: !806, size: 192, align: 64, offset: 384)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct____missing_field_name_51", file: !1, line: 1102, size: 192, align: 64, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ListEntry", scope: !806, file: !1, line: 1103, baseType: !398, size: 128, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField16", scope: !806, file: !1, line: 1104, baseType: !810, size: 64, align: 64, offset: 128)
!810 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_52", file: !1, line: 1098, size: 64, align: 64, elements: !811)
!811 = !{!812, !1236}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentStackLocation", scope: !810, file: !1, line: 1099, baseType: !813, size: 64, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64, align: 64)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_STACK_LOCATION", file: !1, line: 1382, size: 544, align: 32, elements: !815)
!815 = !{!816, !817, !818, !819, !820, !1228, !1229, !1230, !1235}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "MajorFunction", scope: !814, file: !1, line: 1383, baseType: !290, size: 8, align: 8)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "MinorFunction", scope: !814, file: !1, line: 1384, baseType: !290, size: 8, align: 8, offset: 8)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !814, file: !1, line: 1385, baseType: !290, size: 8, align: 8, offset: 16)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !814, file: !1, line: 1386, baseType: !290, size: 8, align: 8, offset: 24)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "Parameters", scope: !814, file: !1, line: 1387, baseType: !821, size: 256, align: 32, offset: 32)
!821 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_Parameters_55", file: !1, line: 1353, size: 256, align: 32, elements: !822)
!822 = !{!823, !907, !913, !919, !925, !943, !949, !956, !962, !967, !972, !977, !983, !988, !1017, !1058, !1076, !1083, !1087, !1092, !1099, !1107, !1111, !1122, !1136, !1214, !1221}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "Create", scope: !821, file: !1, line: 1354, baseType: !824, size: 224, align: 32)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Create_56", file: !1, line: 1223, size: 224, align: 32, elements: !825)
!825 = !{!826, !903, !904, !905, !906}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityContext", scope: !824, file: !1, line: 1224, baseType: !827, size: 64, align: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIO_SECURITY_CONTEXT", file: !1, line: 945, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64, align: 64)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_SECURITY_CONTEXT", file: !1, line: 939, size: 256, align: 64, elements: !830)
!830 = !{!831, !842, !901, !902}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityQos", scope: !829, file: !1, line: 940, baseType: !832, size: 64, align: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSECURITY_QUALITY_OF_SERVICE", file: !1, line: 208, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64, align: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SECURITY_QUALITY_OF_SERVICE", file: !1, line: 202, size: 128, align: 64, elements: !835)
!835 = !{!836, !837, !839, !841}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !834, file: !1, line: 203, baseType: !282, size: 64, align: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ImpersonationLevel", scope: !834, file: !1, line: 204, baseType: !838, size: 32, align: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECURITY_IMPERSONATION_LEVEL", file: !1, line: 200, baseType: !3)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ContextTrackingMode", scope: !834, file: !1, line: 205, baseType: !840, size: 8, align: 8, offset: 96)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECURITY_CONTEXT_TRACKING_MODE", file: !1, line: 201, baseType: !408)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "EffectiveOnly", scope: !834, file: !1, line: 206, baseType: !408, size: 8, align: 8, offset: 104)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "AccessState", scope: !829, file: !1, line: 941, baseType: !843, size: 64, align: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "PACCESS_STATE", file: !1, line: 851, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64, align: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ACCESS_STATE", file: !1, line: 833, size: 1856, align: 64, elements: !846)
!846 = !{!847, !853, !854, !855, !856, !857, !858, !860, !861, !862, !871, !873, !874, !898, !899, !900}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "OperationID", scope: !845, file: !1, line: 834, baseType: !848, size: 128, align: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "LUID", file: !1, line: 57, baseType: !849)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LUID", file: !1, line: 53, size: 128, align: 64, elements: !850)
!850 = !{!851, !852}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "LowPart", scope: !849, file: !1, line: 54, baseType: !282, size: 64, align: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "HighPart", scope: !849, file: !1, line: 55, baseType: !315, size: 64, align: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityEvaluated", scope: !845, file: !1, line: 835, baseType: !408, size: 8, align: 8, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "GenerateAudit", scope: !845, file: !1, line: 836, baseType: !408, size: 8, align: 8, offset: 136)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "GenerateOnClose", scope: !845, file: !1, line: 837, baseType: !408, size: 8, align: 8, offset: 144)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "PrivilegesAllocated", scope: !845, file: !1, line: 838, baseType: !408, size: 8, align: 8, offset: 152)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !845, file: !1, line: 839, baseType: !282, size: 64, align: 64, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "RemainingDesiredAccess", scope: !845, file: !1, line: 840, baseType: !859, size: 64, align: 64, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "ACCESS_MASK", file: !1, line: 180, baseType: !282)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "PreviouslyGrantedAccess", scope: !845, file: !1, line: 841, baseType: !859, size: 64, align: 64, offset: 320)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "OriginalDesiredAccess", scope: !845, file: !1, line: 842, baseType: !859, size: 64, align: 64, offset: 384)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectSecurityContext", scope: !845, file: !1, line: 843, baseType: !863, size: 256, align: 64, offset: 448)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECURITY_SUBJECT_CONTEXT", file: !1, line: 822, baseType: !864)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SECURITY_SUBJECT_CONTEXT", file: !1, line: 816, size: 256, align: 64, elements: !865)
!865 = !{!866, !868, !869, !870}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ClientToken", scope: !864, file: !1, line: 817, baseType: !867, size: 64, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "PACCESS_TOKEN", file: !1, line: 178, baseType: !369)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ImpersonationLevel", scope: !864, file: !1, line: 818, baseType: !838, size: 32, align: 32, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "PrimaryToken", scope: !864, file: !1, line: 819, baseType: !867, size: 64, align: 64, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessAuditId", scope: !864, file: !1, line: 820, baseType: !369, size: 64, align: 64, offset: 192)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityDescriptor", scope: !845, file: !1, line: 844, baseType: !872, size: 64, align: 64, offset: 704)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSECURITY_DESCRIPTOR", file: !1, line: 179, baseType: !369)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "AuxData", scope: !845, file: !1, line: 845, baseType: !369, size: 64, align: 64, offset: 768)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "Privileges", scope: !845, file: !1, line: 846, baseType: !875, size: 704, align: 64, offset: 832)
!875 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion_Privileges_40", file: !1, line: 829, size: 704, align: 64, elements: !876)
!876 = !{!877, !890}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "InitialPrivilegeSet", scope: !875, file: !1, line: 830, baseType: !878, size: 704, align: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "INITIAL_PRIVILEGE_SET", file: !1, line: 828, baseType: !879)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "_INITIAL_PRIVILEGE_SET", file: !1, line: 823, size: 704, align: 64, elements: !880)
!880 = !{!881, !882, !883}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "PrivilegeCount", scope: !879, file: !1, line: 824, baseType: !282, size: 64, align: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !879, file: !1, line: 825, baseType: !282, size: 64, align: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "Privilege", scope: !879, file: !1, line: 826, baseType: !884, size: 576, align: 32, offset: 128)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !885, size: 576, align: 32, elements: !355)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "LUID_AND_ATTRIBUTES", file: !1, line: 186, baseType: !886)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LUID_AND_ATTRIBUTES", file: !1, line: 182, size: 192, align: 32, elements: !887)
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "Luid", scope: !886, file: !1, line: 183, baseType: !848, size: 128, align: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !886, file: !1, line: 184, baseType: !282, size: 64, align: 64, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "PrivilegeSet", scope: !875, file: !1, line: 831, baseType: !891, size: 320, align: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "PRIVILEGE_SET", file: !1, line: 193, baseType: !892)
!892 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PRIVILEGE_SET", file: !1, line: 188, size: 320, align: 64, elements: !893)
!893 = !{!894, !895, !896}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "PrivilegeCount", scope: !892, file: !1, line: 189, baseType: !282, size: 64, align: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "Control", scope: !892, file: !1, line: 190, baseType: !282, size: 64, align: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "Privilege", scope: !892, file: !1, line: 191, baseType: !897, size: 192, align: 32, offset: 128)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !885, size: 192, align: 32, elements: !385)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "AuditPrivileges", scope: !845, file: !1, line: 847, baseType: !408, size: 8, align: 8, offset: 1536)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ObjectName", scope: !845, file: !1, line: 848, baseType: !455, size: 128, align: 64, offset: 1600)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ObjectTypeName", scope: !845, file: !1, line: 849, baseType: !455, size: 128, align: 64, offset: 1728)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "DesiredAccess", scope: !829, file: !1, line: 942, baseType: !859, size: 64, align: 64, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "FullCreateOptions", scope: !829, file: !1, line: 943, baseType: !282, size: 64, align: 64, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "Options", scope: !824, file: !1, line: 1225, baseType: !282, size: 64, align: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "FileAttributes", scope: !824, file: !1, line: 1226, baseType: !278, size: 16, align: 16, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ShareAccess", scope: !824, file: !1, line: 1227, baseType: !278, size: 16, align: 16, offset: 144)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "EaLength", scope: !824, file: !1, line: 1228, baseType: !282, size: 64, align: 64, offset: 160)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "Read", scope: !821, file: !1, line: 1355, baseType: !908, size: 256, align: 32)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Read_57", file: !1, line: 1230, size: 256, align: 32, elements: !909)
!909 = !{!910, !911, !912}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !908, file: !1, line: 1231, baseType: !282, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "Key", scope: !908, file: !1, line: 1232, baseType: !282, size: 64, align: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ByteOffset", scope: !908, file: !1, line: 1233, baseType: !307, size: 128, align: 64, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "Write", scope: !821, file: !1, line: 1356, baseType: !914, size: 256, align: 32)
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Write_58", file: !1, line: 1235, size: 256, align: 32, elements: !915)
!915 = !{!916, !917, !918}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !914, file: !1, line: 1236, baseType: !282, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "Key", scope: !914, file: !1, line: 1237, baseType: !282, size: 64, align: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ByteOffset", scope: !914, file: !1, line: 1238, baseType: !307, size: 128, align: 64, offset: 128)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "QueryFile", scope: !821, file: !1, line: 1357, baseType: !920, size: 96, align: 32)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryFile_59", file: !1, line: 1240, size: 96, align: 32, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !920, file: !1, line: 1241, baseType: !282, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "FileInformationClass", scope: !920, file: !1, line: 1242, baseType: !924, size: 32, align: 32, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE_INFORMATION_CLASS", file: !1, line: 276, baseType: !9)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "SetFile", scope: !821, file: !1, line: 1358, baseType: !926, size: 224, align: 32)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_SetFile_60", file: !1, line: 1253, size: 224, align: 32, elements: !927)
!927 = !{!928, !929, !930, !932}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !926, file: !1, line: 1254, baseType: !282, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "FileInformationClass", scope: !926, file: !1, line: 1255, baseType: !924, size: 32, align: 32, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "FileObject", scope: !926, file: !1, line: 1256, baseType: !931, size: 64, align: 64, offset: 96)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFILE_OBJECT", file: !1, line: 1075, baseType: !479)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField19", scope: !926, file: !1, line: 1257, baseType: !933, size: 64, align: 32, offset: 160)
!933 = !DICompositeType(tag: DW_TAG_union_type, name: "__anonunion____missing_field_name_61", file: !1, line: 1248, size: 64, align: 32, elements: !934)
!934 = !{!935, !940, !941}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "__annonCompField18", scope: !933, file: !1, line: 1249, baseType: !936, size: 16, align: 8)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct____missing_field_name_62", file: !1, line: 1244, size: 16, align: 8, elements: !937)
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ReplaceIfExists", scope: !936, file: !1, line: 1245, baseType: !408, size: 8, align: 8)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "AdvanceOnly", scope: !936, file: !1, line: 1246, baseType: !408, size: 8, align: 8, offset: 8)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ClusterCount", scope: !933, file: !1, line: 1250, baseType: !282, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteHandle", scope: !933, file: !1, line: 1251, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "HANDLE", file: !1, line: 31, baseType: !370)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "QueryVolume", scope: !821, file: !1, line: 1359, baseType: !944, size: 96, align: 32)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryVolume_63", file: !1, line: 1259, size: 96, align: 32, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !944, file: !1, line: 1260, baseType: !282, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "FsInformationClass", scope: !944, file: !1, line: 1261, baseType: !948, size: 32, align: 32, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "FS_INFORMATION_CLASS", file: !1, line: 314, baseType: !48)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceIoControl", scope: !821, file: !1, line: 1360, baseType: !950, size: 256, align: 32)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_DeviceIoControl_64", file: !1, line: 1263, size: 256, align: 32, elements: !951)
!951 = !{!952, !953, !954, !955}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "OutputBufferLength", scope: !950, file: !1, line: 1264, baseType: !282, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "InputBufferLength", scope: !950, file: !1, line: 1265, baseType: !282, size: 64, align: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "IoControlCode", scope: !950, file: !1, line: 1266, baseType: !282, size: 64, align: 64, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "Type3InputBuffer", scope: !950, file: !1, line: 1267, baseType: !369, size: 64, align: 64, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "QuerySecurity", scope: !821, file: !1, line: 1361, baseType: !957, size: 128, align: 32)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QuerySecurity_65", file: !1, line: 1269, size: 128, align: 32, elements: !958)
!958 = !{!959, !961}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityInformation", scope: !957, file: !1, line: 1270, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "SECURITY_INFORMATION", file: !1, line: 209, baseType: !282)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !957, file: !1, line: 1271, baseType: !282, size: 64, align: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "SetSecurity", scope: !821, file: !1, line: 1362, baseType: !963, size: 128, align: 32)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_SetSecurity_66", file: !1, line: 1273, size: 128, align: 32, elements: !964)
!964 = !{!965, !966}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityInformation", scope: !963, file: !1, line: 1274, baseType: !960, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "SecurityDescriptor", scope: !963, file: !1, line: 1275, baseType: !872, size: 64, align: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "MountVolume", scope: !821, file: !1, line: 1363, baseType: !968, size: 128, align: 32)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_MountVolume_67", file: !1, line: 1277, size: 128, align: 32, elements: !969)
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Vpb", scope: !968, file: !1, line: 1278, baseType: !486, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !968, file: !1, line: 1279, baseType: !423, size: 64, align: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "VerifyVolume", scope: !821, file: !1, line: 1364, baseType: !973, size: 128, align: 32)
!973 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_VerifyVolume_68", file: !1, line: 1281, size: 128, align: 32, elements: !974)
!974 = !{!975, !976}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "Vpb", scope: !973, file: !1, line: 1282, baseType: !486, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceObject", scope: !973, file: !1, line: 1283, baseType: !423, size: 64, align: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "Scsi", scope: !821, file: !1, line: 1365, baseType: !978, size: 64, align: 32)
!978 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_Scsi_69", file: !1, line: 1285, size: 64, align: 32, elements: !979)
!979 = !{!980}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "Srb", scope: !978, file: !1, line: 1286, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SCSI_REQUEST_BLOCK", file: !1, line: 859, flags: DIFlagFwdDecl)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "QueryDeviceRelations", scope: !821, file: !1, line: 1366, baseType: !984, size: 32, align: 32)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryDeviceRelations_70", file: !1, line: 1288, size: 32, align: 32, elements: !985)
!985 = !{!986}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !984, file: !1, line: 1289, baseType: !987, size: 32, align: 32)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEVICE_RELATION_TYPE", file: !1, line: 1150, baseType: !59)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "QueryInterface", scope: !821, file: !1, line: 1367, baseType: !989, size: 224, align: 32)
!989 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_QueryInterface_71", file: !1, line: 1291, size: 224, align: 32, elements: !990)
!990 = !{!991, !1004, !1005, !1006, !1016}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceType", scope: !989, file: !1, line: 1292, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !1, line: 104, baseType: !995)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GUID", file: !1, line: 98, size: 192, align: 64, elements: !996)
!996 = !{!997, !998, !999, !1000}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !995, file: !1, line: 99, baseType: !283, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !995, file: !1, line: 100, baseType: !279, size: 16, align: 16, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !995, file: !1, line: 101, baseType: !279, size: 16, align: 16, offset: 80)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !995, file: !1, line: 102, baseType: !1001, size: 64, align: 8, offset: 96)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 64, align: 8, elements: !1002)
!1002 = !{!1003}
!1003 = !DISubrange(count: 8)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !989, file: !1, line: 1293, baseType: !278, size: 16, align: 16, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !989, file: !1, line: 1294, baseType: !278, size: 16, align: 16, offset: 80)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "Interface", scope: !989, file: !1, line: 1295, baseType: !1007, size: 64, align: 64, offset: 96)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "PINTERFACE", file: !1, line: 1171, baseType: !1008)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DICompositeType(tag: DW_TAG_structure_type, name: "_INTERFACE", file: !1, line: 1164, size: 256, align: 64, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1014, !1015}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !1009, file: !1, line: 1165, baseType: !278, size: 16, align: 16)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !1009, file: !1, line: 1166, baseType: !278, size: 16, align: 16, offset: 16)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "Context", scope: !1009, file: !1, line: 1167, baseType: !369, size: 64, align: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceReference", scope: !1009, file: !1, line: 1168, baseType: !413, size: 64, align: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceDereference", scope: !1009, file: !1, line: 1169, baseType: !413, size: 64, align: 64, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceSpecificData", scope: !989, file: !1, line: 1296, baseType: !369, size: 64, align: 64, offset: 160)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceCapabilities", scope: !821, file: !1, line: 1368, baseType: !1018, size: 64, align: 32)
!1018 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_DeviceCapabilities_72", file: !1, line: 1298, size: 64, align: 32, elements: !1019)
!1019 = !{!1020}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "Capabilities", scope: !1018, file: !1, line: 1299, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "PDEVICE_CAPABILITIES", file: !1, line: 1202, baseType: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DEVICE_CAPABILITIES", file: !1, line: 1172, size: 704, align: 64, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1052, !1054, !1055, !1056, !1057}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !1023, file: !1, line: 1173, baseType: !278, size: 16, align: 16)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !1023, file: !1, line: 1174, baseType: !278, size: 16, align: 16, offset: 16)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceD1", scope: !1023, file: !1, line: 1175, baseType: !282, size: 1, align: 64, offset: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceD2", scope: !1023, file: !1, line: 1176, baseType: !282, size: 1, align: 64, offset: 33)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "LockSupported", scope: !1023, file: !1, line: 1177, baseType: !282, size: 1, align: 64, offset: 34)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "EjectSupported", scope: !1023, file: !1, line: 1178, baseType: !282, size: 1, align: 64, offset: 35)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "Removable", scope: !1023, file: !1, line: 1179, baseType: !282, size: 1, align: 64, offset: 36)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "DockDevice", scope: !1023, file: !1, line: 1180, baseType: !282, size: 1, align: 64, offset: 37)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "UniqueID", scope: !1023, file: !1, line: 1181, baseType: !282, size: 1, align: 64, offset: 38)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "SilentInstall", scope: !1023, file: !1, line: 1182, baseType: !282, size: 1, align: 64, offset: 39)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "RawDeviceOK", scope: !1023, file: !1, line: 1183, baseType: !282, size: 1, align: 64, offset: 40)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "SurpriseRemovalOK", scope: !1023, file: !1, line: 1184, baseType: !282, size: 1, align: 64, offset: 41)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "WakeFromD0", scope: !1023, file: !1, line: 1185, baseType: !282, size: 1, align: 64, offset: 42)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "WakeFromD1", scope: !1023, file: !1, line: 1186, baseType: !282, size: 1, align: 64, offset: 43)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "WakeFromD2", scope: !1023, file: !1, line: 1187, baseType: !282, size: 1, align: 64, offset: 44)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "WakeFromD3", scope: !1023, file: !1, line: 1188, baseType: !282, size: 1, align: 64, offset: 45)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "HardwareDisabled", scope: !1023, file: !1, line: 1189, baseType: !282, size: 1, align: 64, offset: 46)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "NonDynamic", scope: !1023, file: !1, line: 1190, baseType: !282, size: 1, align: 64, offset: 47)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "WarmEjectSupported", scope: !1023, file: !1, line: 1191, baseType: !282, size: 1, align: 64, offset: 48)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !1023, file: !1, line: 1192, baseType: !282, size: 15, align: 64, offset: 49)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "Address", scope: !1023, file: !1, line: 1193, baseType: !282, size: 64, align: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "UINumber", scope: !1023, file: !1, line: 1194, baseType: !282, size: 64, align: 64, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceState", scope: !1023, file: !1, line: 1195, baseType: !1048, size: 224, align: 32, offset: 192)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 224, align: 32, elements: !1050)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEVICE_POWER_STATE", file: !1, line: 407, baseType: !66)
!1050 = !{!1051}
!1051 = !DISubrange(count: 7)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "SystemWake", scope: !1023, file: !1, line: 1196, baseType: !1053, size: 32, align: 32, offset: 416)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSTEM_POWER_STATE", file: !1, line: 387, baseType: !74)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceWake", scope: !1023, file: !1, line: 1197, baseType: !1049, size: 32, align: 32, offset: 448)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "D1Latency", scope: !1023, file: !1, line: 1198, baseType: !282, size: 64, align: 64, offset: 512)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "D2Latency", scope: !1023, file: !1, line: 1199, baseType: !282, size: 64, align: 64, offset: 576)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "D3Latency", scope: !1023, file: !1, line: 1200, baseType: !282, size: 64, align: 64, offset: 640)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "FilterResourceRequirements", scope: !821, file: !1, line: 1369, baseType: !1059, size: 64, align: 32)
!1059 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_FilterResourceRequirements_73", file: !1, line: 1301, size: 64, align: 32, elements: !1060)
!1060 = !{!1061}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "IoResourceRequirementList", scope: !1059, file: !1, line: 1302, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIO_RESOURCE_REQUIREMENTS_LIST", file: !1, line: 625, baseType: !1063)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_RESOURCE_REQUIREMENTS_LIST", file: !1, line: 616, size: 1088, align: 64, elements: !1065)
!1065 = !{!1066, !1067, !1069, !1070, !1071, !1072, !1073}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "ListSize", scope: !1064, file: !1, line: 617, baseType: !282, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceType", scope: !1064, file: !1, line: 618, baseType: !1068, size: 32, align: 32, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERFACE_TYPE", file: !1, line: 335, baseType: !84)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "BusNumber", scope: !1064, file: !1, line: 619, baseType: !282, size: 64, align: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "SlotNumber", scope: !1064, file: !1, line: 620, baseType: !282, size: 64, align: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !1064, file: !1, line: 621, baseType: !354, size: 192, align: 64, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "AlternativeLists", scope: !1064, file: !1, line: 622, baseType: !282, size: 64, align: 64, offset: 448)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "List", scope: !1064, file: !1, line: 623, baseType: !1074, size: 576, align: 64, offset: 512)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1075, size: 576, align: 64, elements: !385)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "IO_RESOURCE_LIST", file: !1, line: 614, baseType: !275)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "ReadWriteConfig", scope: !821, file: !1, line: 1370, baseType: !1077, size: 256, align: 32)
!1077 = !DICompositeType(tag: DW_TAG_structure_type, name: "__anonstruct_ReadWriteConfig_74", file: !1, line: 1304, size: 256, align: 32, elements: !1078)
!1078 = !{!1079, !1080, !1081, !1082}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "WhichSpace", scope: !1077, file: !1, line: 1305, baseType: !282, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !1077, file: !1, line: 1306, baseType: !369, size: 64, align: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !1077, file: !1, line: 1307, baseType: !282, size: 64, align: 64, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !1077, file: !1, line: 1308, baseType: !282, size: 64, align: 64, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "SetLock", scope: !821, file: !1, line: 1371, baseType: !1084, size: 8, align: 8)
